[
  {
    "name": "Tony",
    "age": 25,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "Sydney Australia",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://bit.ly/dm-tony",
    "lastUpdated": "2025-11-15",
    "profileDetails": {
      "fullText": "﻿Tony’s Date-me Doc\r\n(Last updated: 15 Nov 2025)\r\n\r\n\r\nN MY UNDERGRADUATE YEARS, I was very focused on my studies.  So when my parents found out after graduation that I had departed from my studies and become interested in solving the world’s problems, they were surprised and worried that I wouldn’t be able to find a proper job.  They asked “why don’t you become a politician?  We can support your further studies.”  I responded that while it is an option, there is one vocation with a greater potential to do good, and that is the philosopher.  I hope that by perpetually learning, understanding perspectives, and experiencing all that the world has to offer, I can philosophise with enough acuity to help guide humanity through these turbulent times and contribute to our roadmap for the future.    \r\nAbout me  \r\n* I am a 25-year-old 175cm-tall man.\r\n* I work as an online tutor, an occupation bestowed upon me by my wanderlust.  Even though I currently live in Melbourne, I could be anywhere, anytime.\r\n* I am agnostic and liberal-leaning.  I don’t drink or smoke.  I neither have nor want children.\r\nCore values\r\nI am a positive, lively, and happy person.  Life is inherently beautiful, and the world is my playground.  I think most people who meet me would say I have a fun, bubbly character.  I loathe to offend others, though I feel disingenuous telling white lies, so I have become quite adept at telling “white truths”.\r\nI am extremely curious.  One of my long-term goals is to “climb the mountain of knowledge”.  This knowledge includes reading undergraduate textbooks on every major university discipline, but equally includes picking up skills and experiences, travelling the natural and cultural world, and so on.  A Chinese proverb tells me “read ten thousand books and journey ten thousand miles”.  Of course, I realise that life is too short to accomplish this goal, but the process matters more to me than the destination.  Besides, the mountain of knowledge has no summit!\r\nI am independent and free-spirited.  I don’t like relying on others, and rarely ask others for favours.  Despite being a bit of a people-pleaser, I am highly resistant to peer-pressure, and do not mind being perceived as quirky.  In thought, I am naturally skeptical and like to come to my own conclusions.\r\nI have many ideas and perspectives.  I love exploring the intangible world through conversation, whether that leans objective (such as STEM, history, society, politics, ...) or subjective (such as life, relationships, experiences, identity, ...).  If I think an opinion is one-sided, I feel an urge to defend other perspectives, as “a wise man proportions his belief to the evidence”.  Because of this, I can play a mighty devil’s advocate, though I realise it is seldom called for.\r\nI am highly greed-avoidant.  I believe that it is possible to live a happy and fulfilling life on a modest amount of money, so I am suspicious of rich people who earn more than they can ever spend.  I would rather do meaningful work voluntarily (and I do) than be paid well to do a bullshit job.  The rich and the poor are both preoccupied with money at the expense of happiness, so I intend to be neither.\r\n\r\n\r\n“Tony will no doubt be one of the most interesting people you’ll ever meet. [...] Tony is also incredibly warm and brings a very positive energy to any group activity.”\r\n      — Alan, friend of two years\r\nAbout you\r\nIt is difficult to qualify what one finds attractive.  For me, sharing core values is a good start.  In terms of character, I generally find myself attracted to quieter people who feel deeply, care unabashedly, and whose smile and laughter bring joy to the world.  Having agency and a strong work ethic is also a big plus.  Many of the qualities I am attracted to are shared by affectionate cats, and I confess I absolutely adore cats and it seems they generally like me back!\r\nAbout us\r\nI believe that the happiest relationships are those where the partners are already happy coming into the relationship.  The most uplifting relationships are those where each partner’s strengths inspire the other to grow.  The most loving relationships are those built upon a deep friendship and a genuine respect for each other.  \r\nI’m looking for love that makes life worth living all over again.\r\nIt is said that Zeus knew humans would be too powerful if we weren’t split at birth and condemned to search for our other half.  But really, he just meant us.  We’d be the power couple who saves the world.  Maybe we’ve finally found each other, much to Zeus’ chagrin?  If you think this might be the case, please dispatch a messenger to deliver your message to the following address at once.  We can then conduct a low-stakes holographic encounter through the aether  :)\r\nTW2000X@GMAIL.COM\r\n  More photos of me and my travels",
      "wordCount_fullText": 33
    },
    "scrapeTimestampDetail": "2025-11-26T19:53:34.435945+00:00",
    "id": "usr_f2fa5eadbf",
    "docAccessible": true,
    "docPlatform": "shortener",
    "expandedUrl": "https://docs.google.com/document/d/1p7ZOer34FwIkX2y8t8I1TJHgaG1SmIQy-76ZxfglKTY/edit?usp=sharing"
  },
  {
    "name": "Monel",
    "age": 36,
    "gender": "F",
    "interestedIn": [
      "M",
      "NB"
    ],
    "location": "Western US Seattle Portland Berkeley WA Oregon",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://tinyurl.com/DateMonel",
    "lastUpdated": "2025-10-17",
    "profileDetails": {
      "fullText": "﻿(Feel free to share this doc – this has been publicly shared)\r\n\r\n\r\nHello! My name is Monel :) \r\n  \r\n\r\nMore pictures here\r\n\r\n\r\nAs of October 2025, I’m based in Portland, Oregon, USA. \r\n\r\n\r\nProfessionally, I am the medical resident at an integrative clinic in Portland and specialize in naturopathic mental health and somatic medicine. I am the 2025 performance artist-in-residence at Shaking The Tree Theater and will be the 2026 Coho Theater artist-in-residence. I teach Contact Improvisation (CI) workshops internationally. \r\n\r\n\r\n\r\n\r\nKorean name: 장윤정\r\nAge: 36, Female \r\nHeight: 5'2''\r\nBody Type: Slim/Toned/Athletic, 26 inch waist\r\nBirthplace: Seoul, Republic of Korea\r\nRaised in: Santa Monica (Los Angeles), California \r\nDegrees: Doctorate, Masters of Science\r\nLanguages: Korean, English, Spanish (Intermediate), German (Intermediate) \r\nSeeking: Life partner who wants children, bonus if you share Korean ancestry or are supportive of learning Korean culture, language, and traditions\r\nHow to contact me: Facebook, Instagram (My life is full of love, laughter, joy, and adventure, and while sometimes I document it, I mostly share the images with my inner circle.)\r\nQualities I prioritize in a match: emotionally mature, genuine, intelligent, curious, self-aware \r\nRelationship Intentions:\r\n* Goals:\r\n   * Ideally, I’m looking for a life partner who wants to start a biological family within the next 2-5 years. \r\n   * Age range: 30-45\r\n   * Dynamics: co-parenting, team-mate, best friend\r\n   * Attachment style: earned secure or secure \r\n________________\r\nTable of Contents\r\nIntroduction\r\nTable of Contents\r\nAbout Me\r\nCurrent Priorities/Focus:\r\nLong Term Aspirations:\r\nWhat I do for fun:\r\nPersonality:\r\nA little story about me:\r\nCommunity/Friendships:\r\nBooks That Have Shaped Me:\r\nValues:\r\nWhat others have said:\r\nRelationship\r\nGeneral compatibility:\r\nRelationship Intentions and preparation:\r\nI like people who:\r\nHow I resolve conflict:\r\nThings you should know about me in relationships:\r\nHow to Get in Touch:\r\nAbout Me\r\nCurrent Priorities/Professional:\r\n* As of October 2025\r\n* Working on my 3 main projects\r\n   * Psychiatric Association of Naturopathic Physician Fellowship\r\n   * Somatic Medicine\r\n   * Trauma-Informed Contact Improvisation\r\n* Degrees: Doctor of Naturopathic Medicine, Masters of Science in Integrative Mental Health\r\n* What is naturopathic medicine? Naturopathic medicine blends modern scientific research with natural and traditional forms of medicine to help activate the body's inherent ability to heal. The focus is not just on managing symptoms, but on addressing the underlying causes of illness by treating the whole person—mind, body, and spirit. We serve as a doctor and a teacher, empowering the patient with the knowledge and personalized tools, like nutrition and lifestyle counseling, to achieve and maintain optimal health.\r\n* My LinkedIn \r\nLong Term Aspirations:\r\n* Host gatherings on a forested property in the PNW with a garden, sauna, and other homesteading features\r\n* Raise 1-2 children with conscious parenting\r\n* Open a private practice\r\n* Write a book\r\n* Continue to travel the world \r\n* Live a long life full of love, wisdom, and depth\r\nWhat I do for fun:\r\n* Social: dinner parties, potlucks, intentional relating (Authentic Relating, Circling)\r\n* Mind-Body: Vipassana meditation, sauna and cold plunge, plant medicine\r\n* Nature: forest bathing, backpacking, hiking, camping \r\n* Dance: Contact Improvisation, Butoh, Ecstatic Dance\r\n* Performance art: Clown, Social Practice\r\n* Sports: Badminton, Pickleball, Tennis, Bouldering, White water kayaking\r\n* Music: DJ Monel on Soundcloud \r\nPersonality:\r\n* Astrology: Sagittarius Sun, Aquarius Moon, Cancer Ascendant\r\n* Myers-Briggs Type Indicator: ENFP (Extraversion, Intuition, Feeling, Perceiving)\r\n* Human Design: Manifesting Generator\r\n* Chinese Astrology: Year of the Dragon\r\n* I am grounded, logical, and have emotional maturity\r\n* I am good at advocating my needs\r\n* I am low technology and try to be off screens as much as possible\r\n\r\n\r\n  \r\n  \r\n  \r\n\r\nMovement and Nourishment \r\n\r\n\r\nA little story about me:\r\nI was born in Seoul, Korea and moved to west Los Angeles when I was 9 months old. My father had lived most of his adult life in the US and wanted to get his MBA at USC. I attended Carlthorp School then Marlborough School, and undergrad at Williams College in western Massachusetts to become a contemporary art curator. Along the way I heavily pursued Buddhist psychology living at various Zen temples and Buddhist retreat centers. While learning German in Berlin, I discovered activist art and changed my major to Studio art when I returned to school. I won a travel scholar grant to study activist art in Korea and eventually focused on durational performance art and social practice. After college I lived at an intentional community for contact improvisation called Earthdance Creative Living Project where I studied Body-Mind Centering, Authentic Movement, and a host of other embodied anatomy movement practices. I returned to Los Angeles to study Continuum Movement with Emilie Conrad until she passed away in 2014. I decided to dedicate my career to combining somatics with medicine and completed post baccalaureate pre medical training at UCLA Extension while studying craniosacral therapy. That led me to the National University of Natural Medicine in Portland Oregon where I reside to this day. \r\n  Community/Friendships:\r\n* Fernhill Ecstatic Dance\r\n* Thursday Night Contact Improvisation\r\n* Korean American Coalition, KAC Oregon\r\n                \r\n\r\n\r\n  \r\n  \r\n  \r\n  \r\n\r\n\r\n\r\nBooks That Have Shaped Me:\r\n   * New Self, New World by Philip Shepherd  \r\n   * The Power of Now by Eckhart Tolle\r\n   * Unlimiting Mind: The Radically Experiential Psychology of Buddhism by Andrew Olendzki \r\nValues:\r\n   * Universal love\r\n   * Sovereignty\r\n   * Curiosity and open mindedness \r\n   * Taking initiative \r\n   * Integrity\r\n   * Growth mindset \r\n   * Kindness\r\n   * Generosity\r\n   * Empathy\r\n   * Optimism\r\n   * Nonjudgement\r\n   * Unattachment\r\n   * Creativity\r\n   * “Seek first to understand”\r\nWhat others have said:\r\n   * Words about me\r\n   * “You have one of the most vital energies of someone I have felt” - Akash Gama\r\n   * “I have smelled a lot of people, but you have the rolls royce of smells” - Dean Evans \r\n   * “5/5 stars, would date again” “You have great genes, you should definitely procreate” - Phil Illy \r\n   * “Your voice is so soothing, I could listen to you all day.” Thom LaFond\r\nRelationship\r\nGeneral compatibility stuff:\r\n   * Gender/Orientation:\r\n   * Pansexual female \r\n   * Religion:\r\n   * Raised Protestant, currently none \r\n   * Recreational substances\r\n   * Non smoker (no tobacco or cannabis), seldom drinker (wine tasting yes)\r\n   * Entheogens \r\n   * Soon-to-be licensed psilocybin facilitator \r\n   * Politics\r\n   * Apolitical, issue-based bipartisan \r\n   * Lifestyle\r\n   * Diet: whole foods, home cooking, occasional processed foods\r\n   * Environmental: scent-free, avoid microplastic and petroleum based products \r\n   * Fitness\r\n   * Yoga, running, outdoor sports\r\nRelationship Intentions and preparation: \r\n   * Do you know how to regulate your nervous system after getting triggered?\r\n   * Do you know what unresolved relational patterns or attachment wounds you could potentially be bringing into the relationship? \r\n   * What are your relationship boundaries/needs/requests/demands - do you know the difference between each, and do you know how to clearly communicate them? \r\n   * Do you know what your heart needs to feel safe and connected? \r\n   * Are you able to fully accept and enjoy love without suspicion, doubt, or the constant anxiety that something bad is inevitably going to happen? \r\n   * Do you know the difference between your inner child's needs and your adult self's needs in a relationship? \r\n   * Do you have clarity around what you actually want from a relationship? \r\n   * Have you been emotionally available to yourself in these ways? \r\n   * Are you emotionally available to the love you're seeking? \r\nI like people who:\r\n   * Eat vegetables and whole foods, generally avoid processed food \r\n   * Have a relationship with nature and the earth\r\n   * Meditate regularly or have attended meditation retreats\r\n   * Have participated in counseling, therapy or are familiar with self-reflection\r\n   * Practice embodiment and feel comfortable in their own skin\r\n   * Have a growth mindset and have experience with improving behaviors\r\n   * Are free of substance use or addiction\r\n   * Have experienced oneness and mind-expansive states through fasting, plant medicine, meditation, chanting, or prayer\r\n   * Have earned-secure or secure attachment\r\n   * Want to live a long healthy life and take care of their body\r\n   * Have deep relationships with people in their community \r\n   * Express positive regard with current and past relationships \r\n   * Have emotional and financial stability\r\n   * Are supportive of me fostering close friendships which include platonic affection\r\nHow I resolve conflict: \r\n   * With Nonviolent communication or thoughtful language\r\n   * If escalated conflict, ask a third party for mediation\r\nThings you should know about me in relationships:\r\nLifestyle\r\nTypical week night\r\nTypical weekend \r\n\r\n\r\n________________\r\n________________\r\n\r\n\r\n________________\r\n\r\n\r\n\r\n\r\nHow to get in touch: \r\nFeel free to email me or add me on Facebook/ping me on Messenger about what resonated, what you’re working on, thinking about, or learning lately!",
      "wordCount_fullText": 37
    },
    "scrapeTimestampDetail": "2025-11-26T19:53:50.405806+00:00",
    "id": "usr_f98cae6f00",
    "docAccessible": true,
    "docPlatform": "shortener",
    "expandedUrl": "https://docs.google.com/document/d/1OzAA2F1rIrwlb3alCaNwseiYlUmu2nZ77yuT5li_vrg/edit?usp=drivesdk"
  },
  {
    "name": "Malvin G.",
    "age": 34,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "San Francisco Bay Area NYC London Central Europe DC UK Los Angeles Barcelona, Spain North America Flexible Boston NY Western US Seattle Chicago NJ Philadelphia Paris, France Colorado Toronto Austin PA Canada Southern US Vancouver TX Portland MA Denver Brazil Amsterdam South of France WA Vancouver Island Oxford Oregon North Carolina Sacramento Ohio Madrid, Spain Indianapolis Georgia Sydney Australia Sweden Ribeirão Bonito ON New Haven Collingswood CT Rhode Island Miami Norway Israel Spain",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://docs.google.com/presentation/d/17HYGfwVYRrewKq3XA_CY8PxKvLKJSjbsHbdgtYIf4pQ/edit?slide=id.g380709d89f2_0_1#slide=id.g380709d89f2_0_1",
    "lastUpdated": "2025-09-18",
    "profileDetails": {
      "fullText": "M.G. Date Me Doc\nSaved to Drive\nSlideshow\nShare\nSign in\nFileEditViewHelp\nView only\n1\nMalvin's\nDate\nMe\nDoc\n34\n|\nNew\nJersey\n|\nProject\nManager\n2\nTable\nof\ncontents\n01\n03\n02\n04\nAbout\nMe\nWho\nI\nam\nand\nwhat\ndrives\nme\nLife\n&\nAdventures\nWhat\nmakes\nmy\nlife\nmeaningful\nand\nfun\nLooking\nAhead\nWho\nI\nhope\nto\nmeet\nand\nwhat\nI'm\nseeking\nConversation\nStarters\nFun\nand\ndeep\nquestions\nto\nspark\nour\nconnection\n3\nAbout\nMe\nI’m\na\nproject\nmanager\nat\nan\nautomation\nand\nrobotics\ncompany.\n●\nFormer\nrobotics\nengineer\nnow\nfocused\non\nclimate\nsolutions\n●\nPassionate\nabout\ncreating\na\nmore\nsustainable\nworld\n●\nAnimal\nlover,\nworld\nexplorer,\nand\nlifelong\nlearner\n●\nEnergized\nby\ntech,\ntravel,\nand\nmaking\na\npositive\nimpact\n4\nLife\n&\nAdventures\nHow\nI\nrecharge\nand\nexplore\n●\nPerfecting\nmy\nyoga\nposes\n(still\nworking\non\nthat\nheadstand!)\n●\nGetting\nlost\nin\nstory-driven\ngames\nlike\nRed\nDead\nRedemption\nII\n●\nFollowing\nFormula\n1\n&\nFormula\nE\n(ask\nme\nabout\nsustainable\nracing!)\n●\nRecent\ntravels:\nAustria’s\nmountain\ntrails,\nUAE’s\nvibrant\ncities,\ncycling\nin\nthe\nNetherlands,\nwaterfalls\nin\nCroatia,\nhistoric\nHungary,\nbeach\ndays\nin\nthe\nDominican\nRepublic,\nand\nexploring\nPuerto\nRico’s\nculture\n5\nLooking\nAhead\nSeeking\nreal\nconnection\nwith\nsomeone\nwho:\n-\nLoves\nboth\nspontaneous\nadventures\nand\ncozy\nNetflix\nnights\n-\nEnjoys\ndeep\ntalks\nand\nsilly\nmoments\n-\nHas\ntheir\nown\ndreams\nand\npassions\n-\nWants\nto\nbuild\nsomething\nmeaningful\n(family\nsomeday)\n6\nLet’s\nConnect\n-\nTop\nhiking\ntrail\nor\nFormula\n1\nteam?\n-\nMust-visit\ntravel\nrecommendations?\nI’m\nalways\nadding\nto\nmy\ntravel\nwishlist!\n-\nFavorite\ngo-to\nkaraoke\nsong?\n-\nDeep\nquestion:\nIf\nyou\ncould\nwake\nup\ntomorrow\nwith\na\nnew\nability,\nwhat\nwould\nit\nbe?\n(Mine:\nspeaking\nevery\nlanguage—think\nof\nthe\nstories\nto\ndiscover!)\n7\n“A\npessimist\nsees\nthe\ndifficulty\nin\nevery\nopportunity;\nan\noptimist\nsees\nthe\nopportunity\nin\nevery\ndifficulty.”\n—\nWinston\nChurchill\nFavorite\nQuote\n8\nMore\nPictures\n9\nMore\nPictures\n10\nIf\nyou\nlike\nwhat\nyou\nsee\nand\nfeel\nwe\nmight\nconnect,\nI'd\nlove\nto\nhear\nfrom\nyou!\nSend\na\nmessage\nwith\nsome\npictures\nand\ntell\nme\na\nbit\nabout\nyourself.\nIf\nit's\nnot\na\nmatch,\nno\nproblem\nat\nall—thanks\nfor\nchecking\nout\nmy\nprofile!\nAnd\nif\nyou\nknow\nsomeone\nwho\nmight\nbe\nperfect,\nplease\ndon't\nhesitate\nto\nshare.\nConnect\nwith\nme\nhere\nMore\nPictures\nHTML view of the presentation\nTurn on screen reader support\nBanner hidden\nTo enable screen reader support, press ⌘+Option+Z To learn about keyboard shortcuts, press ⌘slash",
      "wordCount_fullText": 49
    },
    "scrapeTimestampDetail": "2025-11-26T19:54:26.133138+00:00",
    "id": "usr_1a3dd3479b",
    "docAccessible": true,
    "docPlatform": "google_slides"
  },
  {
    "name": "Celeste",
    "age": 52,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "San Francisco Bay Area",
    "locationFlexibility": "Some",
    "profileUrl": "https://docs.google.com/document/d/1j87Cj4V-upLscz3E9OXhF9selw3zNOJT3FA_9eDqG1I/edit?usp=drivesdk",
    "lastUpdated": "2025-08-24",
    "profileDetails": {
      "fullText": "Date me; I’m Celeste\nSaved to Drive\nRequest edit access\nShare\nSign in\nFileEditViewToolsHelp\nDocument tabs\nTab 1\nDate me; I’m Celeste\nThe basics\nPhotos\nThe meat sack\nBrain orientation / work: Geek\nBrain orientation / work: Freak\nOther things to know about me\nDating outlook\nDon’t reach out to me if\nTurn on screen reader support\nTo enable screen reader support, press ⌘+Option+Z To learn about keyboard shortcuts, press ⌘slash\nBanner hidden",
      "wordCount_fullText": 37
    },
    "scrapeTimestampDetail": "2025-11-26T19:30:36.502393+00:00",
    "id": "usr_0a00f7b10f",
    "docAccessible": true,
    "docPlatform": "google_docs"
  },
  {
    "name": "Sophie",
    "age": 34,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "London Central Europe UK Flexible Oxford",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://docs.google.com/document/d/1-JOHPfarVxfc4jjKW8CmjYEfKy9jR8BznGX8fkdi9K8/edit?usp=sharing",
    "lastUpdated": "2025-08-01",
    "profileDetails": {
      "fullText": "Date Me Doc - Sophie\nSaved to Drive\nRequest edit access\nShare\nSign in\nFileEditViewToolsHelp\nDocument tabs\nTab 1\nHeadings you add to the document will appear here.\nTurn on screen reader support\nTo enable screen reader support, press ⌘+Option+Z To learn about keyboard shortcuts, press ⌘slash\nBanner hidden",
      "wordCount_fullText": 0
    },
    "scrapeTimestampDetail": "2025-11-26T19:55:14.721679+00:00",
    "id": "usr_f813fe3406",
    "docAccessible": true,
    "docPlatform": "google_docs"
  },
  {
    "name": "Toku McCree",
    "age": 44,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "Flexible",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://datetoku.com/",
    "lastUpdated": "2025-07-30",
    "profileDetails": {
      "fullText": "DateMeDoc\nDate Me Doc For Toku McCree\nThis site is not optimized for Mobile for a mobile-friendly version, click here\nEste sitio estÃ¡ en inglÃ©s. Para espaÃ±ol, presiona 2 (o haz clic aquÃ­).\nTOKU'S DATE ME DOC\nWelcome To Tokus Date Me Doc\nIf no doc appears above you can use the link to view it in google docs.\nView In Google Docs\nÂ©2025 DateMeDoc",
      "wordCount_fullText": 70
    },
    "scrapeTimestampDetail": "2025-11-26T19:55:16.910618+00:00",
    "id": "usr_a52a5374c0",
    "docAccessible": true,
    "docPlatform": "custom_site"
  },
  {
    "name": "Mr. Gillion",
    "age": 47,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "Berlin",
    "locationFlexibility": "None",
    "profileUrl": "https://weblove.de",
    "lastUpdated": "2025-05-29",
    "profileDetails": {
      "fullText": "Diese Domain kaufen oder mieten!\nweblove.de\n2025 Copyright | All Rights Reserved.\nPrivacy Policy",
      "wordCount_fullText": 2
    },
    "scrapeTimestampDetail": "2025-11-25T15:53:25.378862Z",
    "id": "usr_506a722e91",
    "docAccessible": true,
    "docPlatform": "custom_site"
  },
  {
    "name": "Toku McCree",
    "age": 44,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "Flexible",
    "locationFlexibility": "Flexible",
    "profileUrl": "http://datetoku.com",
    "lastUpdated": "2025-04-24",
    "profileDetails": {
      "fullText": "DateMeDoc\nDate Me Doc For Toku McCree\nThis site is not optimized for Mobile for a mobile-friendly version, click here\nEste sitio estÃ¡ en inglÃ©s. Para espaÃ±ol, presiona 2 (o haz clic aquÃ­).\nTOKU'S DATE ME DOC\nWelcome To Tokus Date Me Doc\nIf no doc appears above you can use the link to view it in google docs.\nView In Google Docs\nÂ©2025 DateMeDoc",
      "wordCount_fullText": 70
    },
    "scrapeTimestampDetail": "2025-11-26T19:56:45.882121+00:00",
    "id": "usr_de0fcb7938",
    "docAccessible": true,
    "docPlatform": "custom_site"
  },
  {
    "name": "Isaac K.",
    "age": 25,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "DC",
    "locationFlexibility": "Some",
    "profileUrl": "https://docs.google.com/presentation/d/1mX3Js5U4cwewVle-gjtmdbt5eX8QvdLjTkFCVI70l_8/edit?usp=sharing",
    "lastUpdated": "2025-04-21",
    "profileDetails": {
      "fullText": "Isaac K. Date-Me\nSaved to Drive\nSlideshow\nShare\nSign in\nFileEditViewHelp\nView only\n1\nIsaac\nDate-Me\nDoc\nCreated\nby\nhis\ntwo\nfriends,\nwho\nwould\nlike\ncredit\nat\nhis\nwedding.\n(or\ncash)\n2\nSo\nhere’s\nthe\nbasic\nrundown:\n24\nyears\nold\nliving\nin\nthe\nD.C.\nMetro\nArea,\nwhere\nhe\nwas\nborn\nand\nraised.\nRaised\nby\nRussian\nJewish\nimmigrants,\nspeaks\nfluent\nRussian,\nand\nworks\nas\na\nprogrammer.\nHe\ndidn’t\nwant\nus\nto\nput\nhis\nSAT\nscore\nbut\nwe\nknow\nthe\ntarget\naudience.\nIt’s\n1570.\n3\nBut\nlike,\nwho\nIS\nIsaac?\nIsaac\nis\nthe\nkind\nof\nperson\nwho\nwill\nfly\n15\nhours\nto\nsee\nyou\nand\ndestroy\nyou\nin\nBoggle\nwhen\nhe\ndoes.\nHis\nfavorite\nmovie\nis\nthe\n2005\nKeira\nKnightley\nversion\nof\nPride\nand\nPrejudice,\nand\nhe\nwill\nread\nand\nenjoy\nauthors\nfrom\nJane\nAusten\nto\nKlaas\nKraay.\nHe\nis\ncurious,\nthoughtful,\nand\nengaging.\nHe’s\nour\ngo-to\nsource\nfor\npolitical\nmemes\nand\nthe\nfirst\nperson\nwe\ncall\nto\nvent\nabout\nour\nproblems.\nGenuinely,\nwe\nwouldn’t\ndo\nthis\nfor\nany\nof\nour\nother\nfriends,\nbut\nwe\nwanted\nto\ndo\nthis\nfor\nhim\nbecause\nhe\ndeserves\nthe\nworld.\n4\nHobbies\nand\nInterests\n●\nClassic\nliterature\n●\nTalking\nabout\nmedia,\npolitics,\nphilosophy\nand\nreligion\n●\nMaking\nhis\nfriends\nlaugh\nwith\nan\nimpeccable\nsense\nof\nhumor\n●\nReading\nsubstacks\n●\nBoggle\nand\nother\nboard\ngames\n●\nChess\n●\nHosting\nhouse\nparties\n●\nCalisthenics\n●\nTravel\n5\nWho’s\nIsaac\nlooking\nfor?\nSomeone\nwho\nis\ninterested\nin\nstarting\na\nfamily,\nbut\nisn’t\nin\na\nhuge\nrush.\nA\nwoman,\naround\nhis\nage,\nwho\nlives\nin\nthe\nD.C.\nMetro\nArea\nand\nis\ninterested\nin\nhim.\nA\ncompanion\nwho\nis\ninterested\nin\nengaging\nin\nthoughtful\nconversation\nabout\nanything\nfrom\nSeverance\nto\nwhether\ndivine\nsatisficing\ncan\nanswer\nthe\nproblem\nof\nevil.\nA\npartner\nthat\nloves\nand\nreciprocates\nclear\nand\nhonest\ncommunication.\n6\nMore\nPhotos\nIsaac\nwith\nhis\ncat.\nLook\nat\nhow\nsweet\nhe\nis\nwith\nhim.\nHe\ncould\nbe\nthat\nsweet\nwith\nyou\ntoo.\nIsaac\nsomewhere\nin\nthe\nworld…\nidk\nI\ndidn’t\nask,\nhe’s\na\nwell\ntravelled\nman\n7\nSome\nextremely\ncool\nand\nfunny\nand\nsmart\npeople\ncan\nbe\nseen\nin\nthis\nphoto.\n8\nInterested?\nEmail:\nikarachunsky@gmail.com\nPlease\nrespond\nwith\nyour\nname,\nage,\nlocation,\nsome\nphotos\nand\na\ngeneral\noverview\nof\nwhat\nyou're\nlooking\nfor\nand\nwho\nyou\nare!\nIsaac\nDate-Me\nDoc\nCreated\nby\nhis\ntwo\nfriends,\nwho\nwould\nlike\ncredit\nat\nhis\nwedding.\n(or\ncash)\nHTML view of the presentation\nTurn on screen reader support\nBanner hidden\nTo enable screen reader support, press ⌘+Option+Z To learn about keyboard shortcuts, press ⌘slash",
      "wordCount_fullText": 47
    },
    "scrapeTimestampDetail": "2025-11-26T19:56:50.465644+00:00",
    "id": "usr_dc07f2432e",
    "docAccessible": true,
    "docPlatform": "google_slides"
  },
  {
    "name": "Heather K",
    "age": 27,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "DC",
    "locationFlexibility": "None",
    "profileUrl": "https://docs.google.com/document/d/12NNPqHmwqHQd3x3HM_P3OzM7ELQRLYcEFS79zEIxtXw/edit?usp=sharing",
    "lastUpdated": "2025-04-17",
    "profileDetails": {
      "fullText": "✨HEATHER’S DATE-ME DOC 💕\nSaved to Drive\nRequest edit access\nShare\nSign in\nFileEditViewToolsHelp\nDocument tabs\nTab 1\nHeadings you add to the document will appear here.\nTurn on screen reader support\nBanner hidden\nTo enable screen reader support, press ⌘+Option+Z To learn about keyboard shortcuts, press ⌘slash",
      "wordCount_fullText": 23
    },
    "scrapeTimestampDetail": "2025-11-26T19:56:57.946442+00:00",
    "id": "usr_41403a44f7",
    "docAccessible": true,
    "docPlatform": "google_docs"
  },
  {
    "name": "Voyteck",
    "age": 37,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "Spain",
    "locationFlexibility": "Some",
    "profileUrl": "http://gamevoycolor.com/",
    "lastUpdated": "2025-04-12",
    "profileDetails": {
      "fullText": "Date Voy\nis a video game based project with a sole focus of\nfinding a life partner\n.\nIt is not a datesim, it is a real project, with a real person trying to do things differently.\nPlay DateVoyColor\nRead more on:\ntelegraph.co.uk\nign.com\nyoutube.com",
      "wordCount_fullText": 48
    },
    "scrapeTimestampDetail": "2025-11-26T19:57:00.348123+00:00",
    "id": "usr_2e42d0c9b7",
    "docAccessible": true,
    "docPlatform": "custom_site"
  },
  {
    "name": "Benjamin",
    "age": 28,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "DC",
    "locationFlexibility": "Some",
    "profileUrl": "https://docs.google.com/document/d/1NI8vZN7vpLYbZR-mEm5Q1x-ykVsjl4rbBnAa_3MmrDQ/edit?usp=sharing",
    "lastUpdated": "2025-04-12",
    "profileDetails": {
      "fullText": "Benjamin's Date Me Doc\nSaved to Drive\nRequest edit access\nShare\nSign in\nFileEditViewToolsHelp\nDocument tabs\nTab 1\nPERSONALITY\nHEALTH & GROOMING\nABOUT THE OWNER\nCONTACT INFORMATION\nTurn on screen reader support\nTo enable screen reader support, press ⌘+Option+Z To learn about keyboard shortcuts, press ⌘slash\nBanner hidden",
      "wordCount_fullText": 37
    },
    "scrapeTimestampDetail": "2025-11-26T19:32:10.321594+00:00",
    "id": "usr_3d242f0e92",
    "docAccessible": true,
    "docPlatform": "google_docs"
  },
  {
    "name": "Dmitry Vaintrob",
    "age": 36,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "San Francisco Bay Area",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://docs.google.com/document/d/142ryjHRZI17fxPnYatc5zh1q9ue5CjSV8_NSdA_sC3k/edit?usp=sharing",
    "lastUpdated": "2025-04-12",
    "profileDetails": {
      "fullText": "very serious bio\nSaved to Drive\nShare\nSign in\nFileEditViewInsertFormatToolsExtensionsHelp\n Normal text\n Arial\nSuggesting\nRebecca Turner\n12:48 AM Jun 6\nAdd: “I’m gay”\nDmitry Vaintrob\n1:27 AM Jun 6\nloving this collaborative project! Generally a solid personality trait\nAnonymous\nMay 26, 2025\nAdd: “So serious.”\nDmitry Vaintrob\nMay 26, 2025\nThank you for appreciating how much work went into this\n2 more replies\nDmitry Vaintrob\n8:28 PM Jun 4\nSo maybe it's emergent trolling rather than premeditated?\nAnonymous\n10:00 PM Jul 17\nAdd: “what in the lord’s”\nAnonymous\n10:00 PM Jul 17\nAdd: “name”\nAnonymous\n10:00 PM Jul 17\nAdd space\nAnonymous\n10:00 PM Jul 17\nAdd: “is going on here?”\nVictoria P\n11:35 PM Oct 10\nAdd: “Are you in Paris or SFBay now, fellow gayman? :)”\nAnonymous\n10:00 PM Jul 17\nAdd paragraph\nYou're suggesting\nDocument tabs\nTab 1\n8\nHeadings you add to the document will appear here.\nTurn on screen reader support\nTo enable screen reader support, press ⌘+Option+Z To learn about keyboard shortcuts, press ⌘slash\nBanner hidden",
      "wordCount_fullText": 0
    },
    "scrapeTimestampDetail": "2025-11-26T19:57:03.491584+00:00",
    "id": "usr_eafd834d0c",
    "docAccessible": true,
    "docPlatform": "google_docs"
  },
  {
    "name": "Kendra",
    "age": 37,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "Paris, France",
    "locationFlexibility": "Some",
    "profileUrl": "https://kaput-cycle-add.notion.site/Dating-Kendra-1c6f39a9767880baa5b6ec5d07f0086d",
    "lastUpdated": "2025-03-30",
    "profileDetails": {
      "fullText": "Skip to content\nNew page\nGet Notion free\nI am no longer seeking a partner.\nWishing you all the best with your dating journey!",
      "wordCount_fullText": 24
    },
    "scrapeTimestampDetail": "2025-11-27T16:50:51.192697+00:00",
    "id": "usr_c83c3cd09e",
    "docAccessible": true,
    "docPlatform": "notion"
  },
  {
    "name": "Daniil",
    "age": 35,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "Central Europe",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://www.canva.com/design/DAGDz1WujkI/hXbfOEzolp-R8Vo0OUgfRA/view?utm_content=DAGDz1WujkI&utm_campaign=designshare&utm_medium=link2&utm_source=uniquelinks&utlId=hf95c5b72c1",
    "lastUpdated": "2025-03-29",
    "profileDetails": {
      "fullText": "Canva\n⁠\n(opens in a new tab or window)\nShare\nCreate with Canva\n􀀀 housekeeping (including dishwashing and general cleanliness&hygiene maintaining)\n􀀀 cooking expert (always ready to compose some breakfast, launch or dinner)\n􀀀 career driven (financial stability = family stability)\n􀀀 baby sitter (not eximined yet, but high potential i quess)\n􀀀 pet sitter (i really like morning walks!)\n􀀀 health conscious (good spouse = healthy spouse,  so i am caring about my body)\n􀀀 languages spoken: EN, PL, RU, UA, RO\n  email: dweidmann.mailbox@gmail.com\n    address: Central Europe\nSKILLS\nINTERESTS\n􀀀 solitaires\n􀀀 geometry puzzles\n􀀀 crosswords\n􀀀 latin maximas\nRELATIONSHIP EXPERIENCE\n 􀀀 to be updated ☺\nDaniil\nWeidmann\nMARRIAGE OBJECTIVE\nA 35-year old 6'2\" man is ready to estabilish traditional family with good woman.\nMonogamous, open to kids.\nGarantee marital fidelity, long-life support and tangible spouce performance☺.\nSober (no alkohol, smoking, drugs). Catholic. Romantic.\nReady for relocating  for the right person.\nHope that you are this right person, so feel free to contact me!\nPHOTO\n1\n/\n1\nSlide content\nSlide controls\nToolbar\nPrevious page\nNext page\nZoom in and out\nMore\nEnter full screen",
      "wordCount_fullText": 57
    },
    "scrapeTimestampDetail": "2025-11-26T19:57:09.371084+00:00",
    "id": "usr_a64be45867",
    "docAccessible": true,
    "docPlatform": "custom_site"
  },
  {
    "name": "Henry Roark",
    "age": 34,
    "gender": "M",
    "interestedIn": [
      "M"
    ],
    "location": "San Francisco Bay Area",
    "locationFlexibility": "Some",
    "profileUrl": "https://docs.google.com/presentation/d/1Zj9f2xbiKbeLVzXv3vGJSCIYuHycUbaecDLI2Vr0pOc/edit#slide=id.g193b26f510_0_0",
    "lastUpdated": "2025-01-27",
    "profileDetails": {
      "fullText": "Tyler Freckmann pitching Henry 磊磊 Roark\nSaved to Drive\nSlideshow\nShare\nSign in\nFileEditViewHelp\nView only\n1\nHenry\n磊\n磊\nRoark\nTyler\npresents…\n2\nNot\na\nprofessional\nPilot\nMeet\nHenry\nProbably\npondering\nsomething\ndeep\nSingle\nGay\nMale\n33\nyears\nold\nEx-big\ntech\n->\nNon-profit\nwork\nOccasional\nsub-stack\nblogger\n3\nAn\nEye\nfor\nBeauty\nPosing\nwith\ncool\ndesign-y\nthings\nMaking\nhis\nown\ntable\n4\n5\n6\nSwing\ninto\nHenry’s\nDMs!\ninsta:\n@henry.midi\n7\nHenry\n磊\n磊\nRoark\nTyler\npresents…\nHTML view of the presentation\nTurn on screen reader support\nBanner hidden\nTo enable screen reader support, press ⌘+Option+Z To learn about keyboard shortcuts, press ⌘slash",
      "wordCount_fullText": 51
    },
    "scrapeTimestampDetail": "2025-11-26T19:57:58.919537+00:00",
    "id": "usr_f84a619384",
    "docAccessible": true,
    "docPlatform": "google_slides"
  },
  {
    "name": "Ethan",
    "age": 20,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "North America",
    "locationFlexibility": "Some",
    "profileUrl": "https://drive.google.com/file/d/1naHqbmAesoQ4OS3eOosGUUPLvbS-_WZa/view?usp=sharing",
    "lastUpdated": "2025-01-26",
    "profileDetails": {
      "fullText": "Page\n/\n11\na treatise concerning dating.odt\nSign In\nPage 1",
      "wordCount_fullText": 10
    },
    "scrapeTimestampDetail": "2025-11-26T19:58:00.797629+00:00",
    "id": "usr_44af922bc3",
    "docAccessible": true,
    "docPlatform": "google_drive_file"
  },
  {
    "name": "Chris Pang",
    "age": 22,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "London UK",
    "locationFlexibility": "Some",
    "profileUrl": "https://drive.google.com/file/d/1fG75OJY3ifsDvl-A-IiaaKGuYnnG1TXv/view?usp=sharing",
    "lastUpdated": "2024-12-12",
    "profileDetails": {
      "fullText": "Page\n/\n1\ndateme.pdf\nSign In\nDisplaying dateme.pdf. Page 1 of 1",
      "wordCount_fullText": 7
    },
    "scrapeTimestampDetail": "2025-11-26T19:58:51.159443+00:00",
    "id": "usr_b61bd2b297",
    "docAccessible": true,
    "docPlatform": "google_drive_file"
  },
  {
    "name": "Rosie",
    "age": 40,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "London",
    "locationFlexibility": "Some",
    "profileUrl": "https://cuties.app/profile/rosie-1730641476155x359447874586026400",
    "lastUpdated": "2024-11-03",
    "profileDetails": {
      "fullText": "cuties!\nSign up\nRosie\nPetite, curious, empathetic Mediterranean. In London\nSign up to see all details\nAdditional Link\nRosie asked,\nWhat's the best book you've read lately or what are you reading now?\nLog in to indicate interest\nSign up or Log in\nVouch for this person!\nView friend reviews\nSuggest a pairing\nCommunities & Interests\nLog in to add to a community\nDescription\nSign up to view more photos + details.\nI'm Interested\nThey won't be notified unless you both match.\nFriend Reviews\nLog in to write a review\nCuties!\nmade by @christineist\nProduct\nOverview\nCustomers\nCompany\nAbout\nJobs\nSupport\nFAQs\nContact us\nLegal\nTerms\nPrivacy",
      "wordCount_fullText": 1
    },
    "scrapeTimestampDetail": "2025-11-26T19:59:16.712441+00:00",
    "id": "usr_54d1128b0f",
    "docAccessible": true,
    "docPlatform": "cuties_app"
  },
  {
    "name": "Saurav Saha",
    "age": 29,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "San Francisco Bay Area NYC Los Angeles Flexible Seattle Chicago Asia Dubai",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://youtu.be/F1t-mkH0vcw",
    "lastUpdated": "2024-11-02",
    "profileDetails": {
      "fullText": "- YouTube\nAbout\nPress\nCopyright\nContact us\nCreators\nAdvertise\nDevelopers\nTerms\nPrivacy\nPolicy & Safety\nHow YouTube works\nTest new features\nNFL Sunday Ticket\n© 2025 Google LLC",
      "wordCount_fullText": 25
    },
    "scrapeTimestampDetail": "2025-11-26T19:59:19.168688+00:00",
    "id": "usr_5963b90403",
    "docAccessible": true,
    "docPlatform": "youtube"
  },
  {
    "name": "Asher",
    "age": 47,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "Flexible",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://bit.ly/asher-dateme-directory",
    "lastUpdated": "2024-11-01",
    "profileDetails": {
      "fullText": "Here's a preview of your destination\ndocs.google.com/presentation/d/1IyRbJGh-9nzC1SxW4wWMvA10dIKAN4UUJdzKmCpk-pg/edit\nasher.dateme.directory\nHi, I’m Asher! ✔ Life-long learner ✔ Full-time digital nomad ✔ Active / sporty ✔ Non-smoker And … Age: 48 (Feels like 38) Height: 6’3” / 191 cm Speaks: EN, ES, PT, FR Looking For: Woman (Age 30-50) Marriage: Yes please :) Kids: No thanks :) Relationship Goals: Committed Monogamous Living together...\nContinue to destination\nYou'll be redirected in 8 seconds...\nThis preview is powered by Bitly\nBitly is dedicated to making the internet a safer place for everyone.\nUse the site preview above to make sure the link takes you where you expect.\n© 2025 Bitly - Handmade in New York City, Denver, Berlin, Bielefeld, and all over the world.\nConsent management",
      "wordCount_fullText": 45
    },
    "scrapeTimestampDetail": "2025-11-26T19:59:21.464827+00:00",
    "id": "usr_4da5e702b2",
    "docAccessible": true,
    "docPlatform": "shortener",
    "expandedUrl": "https://docs.google.com/presentation/d/1IyRbJGh-9nzC1SxW4wWMvA10dIKAN4UUJdzKmCpk-pg/edit?usp=sharing"
  },
  {
    "name": "Katie Barlow",
    "age": 32,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "Philadelphia",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://docs.google.com/document/d/1kgorrR6OPYxLMa3EqwnW6vWnJdxMJH0-PmjTWFEg6m4/edit?usp=sharing",
    "lastUpdated": "2024-10-22",
    "profileDetails": {
      "fullText": "Katie B.\nSaved to Drive\nRequest edit access\nShare\nSign in\nFileEditViewToolsHelp\nDocument tabs\nTab 1\nSummary:\nPurpose:\nStatistics:\nHobbies\nTurn on screen reader support\nTo enable screen reader support, press ⌘+Option+Z To learn about keyboard shortcuts, press ⌘slash\nBanner hidden",
      "wordCount_fullText": 31
    },
    "scrapeTimestampDetail": "2025-11-26T19:33:57.330389+00:00",
    "id": "usr_d9a2830398",
    "docAccessible": true,
    "docPlatform": "google_docs"
  },
  {
    "name": "Charlie Rogers-Smith",
    "age": 26,
    "gender": "M",
    "interestedIn": [
      "M"
    ],
    "location": "San Francisco Bay Area",
    "locationFlexibility": "Some",
    "profileUrl": "https://tinyurl.com/date-charlie",
    "lastUpdated": "2024-10-19",
    "profileDetails": {
      "fullText": "﻿Date Charlie  \r\nHey, thanks for stopping by! I’m Charlie, and I’m looking for a deep connection with a man, hopefully in the Bay Area, with an eye to finding my life partner. If you’re interested, please reach out! You can message me, get a mutual friend to intro us, email me, or use this link. \r\n\r\n\r\nAbout me\r\nI come across as perceptive, caring, attuned, ambitious, and sincere. \r\nHere’s how some of my friends describe me:\r\nSasha Chapin: “I think of Charlie as a graceful mover, both in physical space and in conversational space — he is a striking presence that improves the energy of a room.”\r\nCatherio: “Perceptive, caring, attuned.”\r\nMax Heitmann (ex-bf): “Charlie is his own person, probably the most himself of anyone I know. That person is sincere, curious, determined, and loving.”\r\nNora Ammann: “Charlie is thoughtful, caring and attuned, as well as spirited, curious and courageous. He is a good and loyal friend.”\r\nJohn Salvatier: “Unrelentingly present.”\r\n  \r\n\r\nRelationship style\r\nI lean monogamous, though I have a few years of experience with poly / open relationships, which I’m open to exploring with the right person. I think I’ll want children in the future, but likely not within the next 5 years.\r\nInterests\r\nI spend a significant part of my life on self-discovery, introspecting, and deepening my relationships with others. I did some Serious Meditation a few years back, and had some profound experiences. I now spend a good chunk of my time on relational practices—which often looks like having very present, authentic, conversations. Relational practices bring more truth and love to my relationships and my self-expression, and nourish me massively. \r\n  \r\n\r\nI like running events! I host dance parties and run regular relational practices; I’ve run a Relateful (circling) immersion with Jordan Allen, a Coherence Psychology retreat with Malcolm Ocean, and many CFAR and CFAR-adjacent workshops. \r\nBesides that, I love to dance west coast swing (see me dancing here), lift heavy things with perfect form (see me lifting here), hang out with my friends’ kids, and cry at Jacob Collier videos.\r\nCareer stuff: I’m Chief of Staff at Palisade Research, where we’re trying to build awareness of AI risks among policymakers. Previously, I worked as an instructor for the Center For Applied Rationality. And before that, I did a master’s at Oxford, and developed Bayesian ML models to estimate the effectiveness of interventions against COVID. Tyler Cowen described my paper as ‘The best mask-wearing study so far?’.\r\n  \r\n\r\nAbout you\r\nI’m usually more attracted to people who are more:\r\n* Emotionally attuned: You’re in touch with yourself and listen deeply to others. You care a lot about communicating authentically.\r\n* Vibrantly interested in stuff: You’re intellectually lively, sharp/analytical, and curious. \r\n* Extroverted / energetic.\r\n* Playful!\r\n* Grounded: You’re steady in yourself, and in touch with your masculine energy.\r\n* Cute / sweet.\r\nAbout us\r\nSpending time with each other nourishes us, brings us closer to ourselves, and reminds us what life is about. \r\nI’d be especially happy if our relationship had:\r\n* Deep listening. Over time, we come to know each other, and how we relate to one another, more and more deeply. \r\n* Alive, attuned, and perhaps wildly kinky, sex (I’m switch). Also, attuned touch; cuddling.\r\n* We’re entangled with what matters most to each of us. We mutually support each other’s interests, and sometimes even participate / collaborate / build together.\r\n* Fun: We go on adventures, nature or otherwise. We share music. We dance together, messy and silly, gentle and sensual. We play. We laugh lots. We cuddle up with an excellent movie or a trashy TV show.\r\nIf you’re interested, please reach out! You can message me, get a mutual friend to intro us, email me, or use this link.",
      "wordCount_fullText": 31
    },
    "scrapeTimestampDetail": "2025-11-26T19:59:27.807113+00:00",
    "id": "usr_e546949ddc",
    "docAccessible": true,
    "docPlatform": "shortener",
    "expandedUrl": "https://docs.google.com/document/d/1N9ABkO90kpWiXJTKmbLiplmkMtpYCxDGPNTcBGnwql8/edit?usp=sharing"
  },
  {
    "name": "Swante",
    "age": 31,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "Central Europe",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://docs.google.com/document/d/12XQMK59tZAGKHEHCRx8dVJhVmTqU4w7riPW-0SVvY74/edit?usp=sharing",
    "lastUpdated": "2024-10-14",
    "profileDetails": {
      "fullText": "Swante's dating doc\nSaved to Drive\nRequest edit access\nShare\nSign in\nFileEditViewToolsHelp\nDocument tabs\nTab 1\nHeadings you add to the document will appear here.\nTurn on screen reader support\nBanner hidden\nTo enable screen reader support, press ⌘+Option+Z To learn about keyboard shortcuts, press ⌘slash",
      "wordCount_fullText": 11
    },
    "scrapeTimestampDetail": "2025-11-26T19:59:30.627340+00:00",
    "id": "usr_c1f47b1d9f",
    "docAccessible": true,
    "docPlatform": "google_docs"
  },
  {
    "name": "C",
    "age": 31,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "UK Flexible Brazil",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://coda.io/d/_dYTnWh111k-/CO-CEEALAR-DMD-Activity_suLS5Hov",
    "lastUpdated": "2024-10-08",
    "profileDetails": {
      "fullText": "Skip to content\nCEEALAR DMD Activity\nPages\nCO | CEEALAR DMD Activity\nCEEALAR DMD Activity\n/\nCO | CEEALAR DMD Activity\nCreate your own collaborative docs\nSign up for free\nCO | CEEALAR DMD Activity\nUpdate Oct ‘25: Happily taken. He seems to be the one. I’ve shown him this DMD and he said “that’s so cool, you’ve described yourself extremely well”, so I’m leaving this here for info value.\nHi!\nI'm a brazilian lady that's just a little guy\n*\n⁠\n and who's keen on helping the world thrive, and thinks that future people matter.\nThis means I am personally and professionally interested in making sure suffering and existential risks are mitigated — this is a big part of my life.\nI love people and I love love, and this doc should serve to assess compatibility between us.\n👩🏾\n🎂\n📍\n👫🏾\n💝\n🛐\n🥗\nCIS-F\n32\n(currently SF; mostly just around)\nHeterosexual\nMonogamous\nChristian\nReducetarian\n⁠\nTIME SAVERS\n⁠\n〰️ Who do I think I am?\n〰️ What do people say I am?\n⁠\nPros\nCons\nI'm a great cheerleader to whatever ambitions you have, and I'll probably want to help you (if you desire help) build your vision (if the vision aligns with making a thriving world).\n↔️\nWill sound delusional sometimes, putting faith that TREMENDOUSLY BIG THINGS can be done. Disregard for some probabilistic thinking.\nVery energetic, I do things with a high intensity at most times\n↔️\nThis means a lot of loud speaking, jumping, sometimes happy screaming from across the room!\nHave a lot of nurturing qualities. Or mothering qualities.\n↔️\nMay mother you on things you consider important to do yourself. Open (and looking forward) to changing.\nWants a relationship with traditional dating values\n↔️\nWill probably expect you to pay the bills, lead the way\nWarm personality\n↔️\nToo hot. Hot damn.\n⁠\n⁠\nInterests\n⁠\n💖 Traits I'd like you to have\n🤔 Why didn't you add pictures of yourself?\nI'd prefer you like my essence enough that you have curiosity to see how I look like.\n🤠 I'm curious, what should I do?\nLeave your name & contact below and I'll reach out so we can talk a bit! :)\n⁠\n⁠\n⁠\nGod bless!\n⁠\n*\n⁠\n⁠",
      "wordCount_fullText": 11
    },
    "scrapeTimestampDetail": "2025-11-26T19:59:32.195303+00:00",
    "id": "usr_e2e23a6e0e",
    "docAccessible": true,
    "docPlatform": "coda"
  },
  {
    "name": "Tim",
    "age": 35,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "Western US Seattle Vancouver Portland WA Oregon",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://datefirefly.com/u/tim133",
    "lastUpdated": "2024-10-04",
    "profileDetails": {
      "fullText": "Home\nBlog\nProgress Tracker\nSupport Firefly\nHome\nBlog\nProgress Tracker\nSupport Firefly\nTim\nDetails\nAge\n36\nGender\nMan\nOrientation\nStraight\nRelationship Type\nMonogamous\nLocation\nDecatur, GA\nInterested in\nGender\nWoman\nRelationship\nLong-term relationship\nAbout me\nInto the outdoors, homebrewing and more!\nWorking on a hop farm as research chemist/technical outreach in the Yakima Valley.\nTravel a lot for work and fun throughout the country/world so open to exploring high quality connections. Ultimately looking for a partnership but want something that flows naturally. I have been single for 10+ years and want to find something with mutual kindness, respect and intention. Also open to relocating.\nAlways reading and learning about something new. Enjoy whitewater kayaking, hiking, being outside, and currently learning to ski as well as cooking. Usually have esoteric niche interests that can range for obscure southern rap to existential philosophy as well as neurochemistry/behavioral material. Not concerned about a person's depth of knowledge but feel best around those who are curious, eager to learn, and open minded.\nI usually crave social connection/community but enjoy deeper 1 on 1 interactions the most. While I have an analytical mind, I am a deep feeler and usually operate from an emotional place. I have a very active mind and identify with the highly sensitive/sensation seeking temperament. It often feels like I have one foot on the brakes/one foot on the gas when navigating life.\nHave a vasectomy, so child free.\nSend me a message\nIn a relationship, I am looking for...\nOpen mindedness, kindness, and curiosity. Shared laughter doesn't hurt either.\nThe first thing I notice about a partner's body is...\nThe eyes definitely!\nmail\npatreon\ninstagram\nreddit\ndiscord\nDateFirefly, Inc.\n•\n© 2025\n•\nFirefly™️\nPrivacy Policy • Terms & Conditions • Child Safety • Resources",
      "wordCount_fullText": 54
    },
    "scrapeTimestampDetail": "2025-11-26T19:59:41.620268+00:00",
    "id": "usr_04732cb97b",
    "docAccessible": true,
    "docPlatform": "datefirefly"
  },
  {
    "name": "Voy",
    "age": 37,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "London Central Europe Flexible",
    "locationFlexibility": "Flexible",
    "profileUrl": "http://gamevoycolor.com",
    "lastUpdated": "2024-10-04",
    "profileDetails": {
      "fullText": "Date Voy\nis a video game based project with a sole focus of\nfinding a life partner\n.\nIt is not a datesim, it is a real project, with a real person trying to do things differently.\nPlay DateVoyColor\nRead more on:\ntelegraph.co.uk\nign.com\nyoutube.com",
      "wordCount_fullText": 48
    },
    "scrapeTimestampDetail": "2025-11-26T19:59:43.758971+00:00",
    "id": "usr_96e5c79e7c",
    "docAccessible": true,
    "docPlatform": "custom_site"
  },
  {
    "name": "Monica Rodriguez",
    "age": 39,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "North America Western US Seattle WA",
    "locationFlexibility": "None",
    "profileUrl": "https://docs.google.com/document/d/10RgS909geDjiyX8BxYqhsPeyPCNFxynRxetE27DYcjg/edit",
    "lastUpdated": "2024-10-02",
    "profileDetails": {
      "fullText": "Latina love\nSaved to Drive\nRequest edit access\nShare\nSign in\nFileEditViewToolsHelp\nDocument tabs\nTab 1\nHeadings you add to the document will appear here.\nTurn on screen reader support\nTo enable screen reader support, press ⌘+Option+Z To learn about keyboard shortcuts, press ⌘slash\nBanner hidden",
      "wordCount_fullText": 22
    },
    "scrapeTimestampDetail": "2025-11-26T19:59:46.580726+00:00",
    "id": "usr_8d4bde0d61",
    "docAccessible": true,
    "docPlatform": "google_docs"
  },
  {
    "name": "Ying",
    "age": 33,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "London UK",
    "locationFlexibility": "Some",
    "profileUrl": "https://docs.google.com/document/d/1DIWvOO0YS3k2AKeujK-0IVA1w88wgAupnS3TkmpE0-I/edit",
    "lastUpdated": "2024-09-10",
    "profileDetails": {
      "fullText": "A\nSaved to Drive\nRequest edit access\nShare\nSign in\nFileEditViewToolsHelp\nDocument tabs\nTab 1\nHeadings you add to the document will appear here.\nTurn on screen reader support\nBanner hidden\nTo enable screen reader support, press ⌘+Option+Z To learn about keyboard shortcuts, press ⌘slash",
      "wordCount_fullText": 14
    },
    "scrapeTimestampDetail": "2025-11-26T20:00:23.079108+00:00",
    "id": "usr_3a690462a0",
    "docAccessible": true,
    "docPlatform": "google_docs"
  },
  {
    "name": "Ally Berke",
    "age": 36,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "San Francisco Bay Area",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://docs.google.com/document/d/10s4aF-fHPM9E5F8fvT8kCwfdlt1CYXOXHJgD3Uhge2A/edit?usp=sharing",
    "lastUpdated": "2024-09-04",
    "profileDetails": {
      "fullText": "Date Ally\nSaved to Drive\nRequest edit access\nShare\nSign in\nFileEditViewToolsHelp\nDocument tabs\nTab 1\nHeadings you add to the document will appear here.\nTurn on screen reader support\nBanner hidden\nTo enable screen reader support, press ⌘+Option+Z To learn about keyboard shortcuts, press ⌘slash",
      "wordCount_fullText": 31
    },
    "scrapeTimestampDetail": "2025-11-26T20:00:28.344130+00:00",
    "id": "usr_2ac7390d20",
    "docAccessible": true,
    "docPlatform": "google_docs"
  },
  {
    "name": "Carter Allen",
    "age": 23,
    "gender": "M",
    "interestedIn": [
      "F",
      "M",
      "NB"
    ],
    "location": "San Francisco Bay Area Berkeley",
    "locationFlexibility": "None",
    "profileUrl": "https://docs.google.com/document/d/1A2WhNw3WMskp7m04_p9iVrDBBgfro_L1QYRIIo_IMJY/edit?usp=sharing",
    "lastUpdated": "2024-08-26",
    "profileDetails": {
      "fullText": "carter dating doc\nSaved to Drive\nRequest edit access\nShare\nSign in\nFileEditViewToolsHelp\nDocument tabs\nTab 1\nHeadings you add to the document will appear here.\nTurn on screen reader support\nBanner hidden\nTo enable screen reader support, press ⌘+Option+Z To learn about keyboard shortcuts, press ⌘slash",
      "wordCount_fullText": 7
    },
    "scrapeTimestampDetail": "2025-11-26T20:00:36.268018+00:00",
    "id": "usr_721192ee4b",
    "docAccessible": true,
    "docPlatform": "google_docs"
  },
  {
    "name": "Maura Kate Costello",
    "age": 37,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "NYC Flexible NY",
    "locationFlexibility": "Some",
    "profileUrl": "https://docs.google.com/presentation/d/1lisz26rYwSvDBCqKcdXzY5ZoWZEumaleFkTH4I2zOd8/edit?usp=sharing",
    "lastUpdated": "2024-08-16",
    "profileDetails": {
      "fullText": "About Me\nSaved to Drive\nSlideshow\nShare\nSign in\nFileEditViewHelp\nView only\n1\nScan\nor\ngo\nhere\nto\nfollow\nalong:\nbit.ly/mkaboutme\nMaura\nKate\n2\nQuick\nfacts:\nI\ngo\nby\nMaura\nKate\nor\nMK\n37\nyears\nold\n5’6”\nScience\nCommunicator\nBeacon,\nNY\nin\nNYC\n1-2x/month\nat\nminimum\n1-2\nhr\ntravel\ndistance\nokay\nfor\ndates\nsmart,\ncreative,\nempathetic\nMaura\nKate\n3\n4\n5\n6\nRandom\nTidbits\n7\n8\n9\n10\nScan\nor\ngo\nhere\nto\nfollow\nalong:\nbit.ly/mkaboutme\nMaura\nKate\nHTML view of the presentation\nTurn on screen reader support\nBanner hidden\nTo enable screen reader support, press ⌘+Option+Z To learn about keyboard shortcuts, press ⌘slash",
      "wordCount_fullText": 43
    },
    "scrapeTimestampDetail": "2025-11-26T20:00:49.815195+00:00",
    "id": "usr_fb725bc901",
    "docAccessible": true,
    "docPlatform": "google_slides"
  },
  {
    "name": "Stephen",
    "age": 25,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "North America",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://drive.proton.me/urls/0XBYSKBV28#kpfCOyF7CSMl",
    "lastUpdated": "2024-08-06",
    "profileDetails": {
      "fullText": "Proton Drive\nEnd-to-end encrypted\nCreate free account\nHm, we couldn't find that one\nThis file may have been deleted, moved or made unavailable. Try reaching out to the file owner.\nBack to Homepage",
      "wordCount_fullText": 2
    },
    "scrapeTimestampDetail": "2025-11-26T20:01:03.780746+00:00",
    "id": "usr_25a840c5ee",
    "docAccessible": true,
    "docPlatform": "proton_drive"
  },
  {
    "name": "Tenley Schwartz",
    "age": 28,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "",
    "locationFlexibility": "None",
    "profileUrl": "https://docs.google.com/document/d/1e18PAlHifiEUNpmbmBleMePmPyhXuGBQ0avo43sYnpc/edit?usp=sharing",
    "lastUpdated": "2024-08-05",
    "profileDetails": {
      "fullText": "Tenley's Date Me Doc\nSaved to Drive\nRequest edit access\nShare\nSign in\nFileEditViewToolsHelp\nDocument tabs\nTenley's Date Me Doc\nHeadings you add to the document will appear here.\nTurn on screen reader support\nTo enable screen reader support, press ⌘+Option+Z To learn about keyboard shortcuts, press ⌘slash\nBanner hidden",
      "wordCount_fullText": 37
    },
    "scrapeTimestampDetail": "2025-11-26T19:35:10.001242+00:00",
    "id": "usr_fa62304510",
    "docAccessible": true,
    "docPlatform": "google_docs"
  },
  {
    "name": "Stephen",
    "age": 25,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "North America",
    "locationFlexibility": "Some",
    "profileUrl": "https://drive.proton.me/urls/F1S1KSNNC4#5ZxugINhUL16",
    "lastUpdated": "2024-08-01",
    "profileDetails": {
      "fullText": "Proton Drive\nEnd-to-end encrypted\nCreate free account\nHm, we couldn't find that one\nThis file may have been deleted, moved or made unavailable. Try reaching out to the file owner.\nBack to Homepage",
      "wordCount_fullText": 2
    },
    "scrapeTimestampDetail": "2025-11-26T20:01:08.398154+00:00",
    "id": "usr_649482f4b6",
    "docAccessible": true,
    "docPlatform": "proton_drive"
  },
  {
    "name": "Yash",
    "age": 34,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "San Francisco Bay Area NYC",
    "locationFlexibility": "Some",
    "profileUrl": "https://yasharma.xyz/date/",
    "lastUpdated": "2024-08-01",
    "profileDetails": {
      "fullText": "Skip to main content\nExcellent\n4.6 out of 5\nThe domain name\nyasharma.xyz\nis for sale!\nGet this domain\nOwn it today for $699, or select Lease to Own.\nBuy now\nUSD$699\nLease to own\nUSD$100\n/ month\nNext\nFree transaction support\nSecure payments\nLocal currency available in cart at checkout\nNeed help? Give us a call.\n480-651-9741\nSafe & secure transactions\nFast & easy transfers\nHassle free payments\nThe simple, and safe way to buy domain names\nNo matter what kind of domain you want to buy or lease, we make the transfer simple and safe.\nHere's how it works\nAsk AI\nCopyright © 2025 GoDaddy Operating Company, LLC. All Rights Reserved.\nDo not share my personal information\n•\nPrivacy Settings",
      "wordCount_fullText": 0
    },
    "scrapeTimestampDetail": "2025-11-26T20:01:10.207876+00:00",
    "id": "usr_0815a0bd72",
    "docAccessible": true,
    "docPlatform": "custom_site"
  },
  {
    "name": "Paul",
    "age": 23,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "Berlin",
    "locationFlexibility": "Some",
    "profileUrl": "https://docs.google.com/document/d/1QuvNz-hQLWwsmuRszWWnbWeTaUuNWGXZkqOTDh_Cty0/edit?usp=sharing",
    "lastUpdated": "2024-07-30",
    "profileDetails": {
      "fullText": "Paul’s Date Me Doc\nSaved to Drive\nRequest edit access\nShare\nSign in\nFileEditViewToolsHelp\nDocument tabs\nPaul’s Date Me Doc\nHeadings you add to the document will appear here.\nTurn on screen reader support\nBanner hidden\nTo enable screen reader support, press ⌘+Option+Z To learn about keyboard shortcuts, press ⌘slash",
      "wordCount_fullText": 5
    },
    "scrapeTimestampDetail": "2025-11-26T20:01:12.460437+00:00",
    "id": "usr_ac16a8898f",
    "docAccessible": true,
    "docPlatform": "google_docs"
  },
  {
    "name": "Beat",
    "age": 24,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "Central Europe",
    "locationFlexibility": "Some",
    "profileUrl": "https://zelium.io/beat/date-me-doc/public-9sNwK65jTo25St6lNImZW",
    "lastUpdated": "2024-07-20",
    "profileDetails": {
      "fullText": "/\nbeat\n/\ndate-me-doc\nRegister\nLog in →\ndate-me-doc\n⌄\n⌄\n⌄\n⌄\n# Beat's date-me document\nHi! 👋\nI'm Beat – it's nice to meet you!\nI just started working as a Software Architect at a small software consultancy (and I'm really enjoying it!). Before that, I did a orientational study year\n, studied physics\n for 3 semesters, and then went to a programming school\n.\nI care about a lot of things, but these feel the most fundamental to who I am:\n working on creating a good/better future for all of us\n personal growth/learning\n deep connections with kind people\nMore about me\nI care deeply about making the world a better place and living in alignment with my values.\nI find the amount to which our broken systems hurt people very upsetting, and I want to help as much as I can.\n© 2024\nBeat Hagenlocher\nTerms\nImprint\nPrivacy Policy",
      "wordCount_fullText": 46
    },
    "scrapeTimestampDetail": "2025-11-26T20:01:28.019152+00:00",
    "id": "usr_ce8d89cc9a",
    "docAccessible": true,
    "docPlatform": "custom_site"
  },
  {
    "name": "Sisi",
    "age": 31,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "San Francisco Bay Area",
    "locationFlexibility": "Some",
    "profileUrl": "https://docs.google.com/document/d/1e1x4Ch3nOmtS7NioUyH6RHX2syIuGT0hxABqxlxgM3E/edit?usp=sharing",
    "lastUpdated": "2024-06-24",
    "profileDetails": {
      "fullText": "Sisi's Dating Doc\nSaved to Drive\nRequest edit access\nShare\nSign in\nFileEditViewToolsHelp\nDocument tabs\nSisi's Dating Doc\nHeadings you add to the document will appear here.\nTurn on screen reader support\nBanner hidden\nTo enable screen reader support, press ⌘+Option+Z To learn about keyboard shortcuts, press ⌘slash",
      "wordCount_fullText": 3
    },
    "scrapeTimestampDetail": "2025-11-26T20:01:32.587478+00:00",
    "id": "usr_ec4b81af94",
    "docAccessible": true,
    "docPlatform": "google_docs"
  },
  {
    "name": "Francesca",
    "age": 32,
    "gender": "FNB",
    "interestedIn": [
      "F",
      "M",
      "NB"
    ],
    "location": "San Francisco Bay Area Berkeley",
    "locationFlexibility": "Some",
    "profileUrl": "http://go.boba.monster/datingdoc",
    "lastUpdated": "2024-06-20",
    "profileDetails": {
      "fullText": "Skip to content\nFrancesca’s Dating Doc\nGet Notion free\nFrancesca’s Dating Doc\nHi, I’m Francesca (she/her/they 🏳️‍🌈)! I’m looking for more partners; I’m glad you’re here! If you think we might be a good match, I’d love to hear from you: please fill in this form.\n💡\nThis is weird: I dislike writing about myself, and my primary partner was excited to draft this for me, so this doc mostly describes me through his eyes. I’ve added comments where I would characterize myself differently. This document carried the prose of my primary partner moreso than my own voice.\n👉 You can also read the doc I wrote for myself (sans partner intervention) here.\nTestimonials\nI <3 Francesca, she’s awesome, and I feel super lucky to be her friend and partner!\n  - The guy who wrote this dating doc\nBurning Man, Mudpocalypse edition\nALT\nWho I am\n🌉 San Francisco & Oakland-based\n🐣 In my early 30’s\n🏳️‍🌈 Bi: I think I’d like to date all genders, but thus far I’ve only dated men. I’m open to more! 😉\n🎨 Crafty: I love creating things (I draw professionally as a digital illustrator), make cool hats (like my persimmon-shaped hat), fish backpacks, and so much more!\n🤪 Goofy: I enjoy being playful and uninhibited (with people I know well). I start out quite shy, however.\n🤫 Introverted: I’m not excited about being in big groups, especially with strangers, and it takes me a while to recharge from social situations. As a result, sometimes people who are just meeting me might see me as a bit colder… but once I get to know people I can be fun and goofy (see above!).\n🔐 A private person: I am an open book. But I am also the kind of person who won’t put that contents of that book on social media, or share personal details with others unless its on a need-to-know basis. I value my privacy and don’t often share things with strangers.\n🫂 Caring: my friends know me as being extremely empathetic, and go out of my way to help others - maybe even to a fault!\n🍣 Foodie: I love trying new foods, even though I’m a vampire-white American - when I travel, I’ll try almost anything once. Some of my favorites are jjajangmyeon, raw fish or poke (e.g. from Foodland), and mentaiko bowls. Let’s go on food adventures!\n✈️ Adventurous: I said “yes” to packing up everything and nomading in 2020, and also went on a 2 week adventure diving through the Galapagos and exploring other parts of South America last year. Burning Man is kind of my vibe too. I like doing this with other people, but it will take me a while to build up the trust to do this with you!\n🤼 Addicted to Brazilian Jiu Jitsu: I know I go 6 times a week, but it’s not a problem, I swear. Just one more hit. 🥺\n👪 Poly-ish: I’ve started experimenting with having multiple partners, and I’ve enjoyed it so far! I’m a solo-poly type - I have a primary partner I live with, and date alone (as much as he might like to date you too 😜).\nWhat I’m looking for\n👫 A long-term relationship: I’d like to have a long-lasting friendship and connection, where we enjoy each other’s company outside of\n❤️ Sex, eventually: see @What I’m not looking for\n📅 Dates: let’s chat briefly to make sure it’s a good fit, and then meet in person soon! I think in-person dates are the most efficient way for us to find out whether we’re a good fit for each other.\n🧭 Someone I can adventure with: this can take many forms, like wandering through the city and finding good food, going to quirky events or museum exhibits together, doing outdoor things, you showing me something new, getting some delicious to eat, and much more!\n💬 Great communication: I think communication is super important, and is something I’ve been practicing myself - I’m looking for someone who is self-aware and can talk about what they’re feeling and what they want. I also appreciate having meta discussions about our relationship and ways we can improve it together!\n🛡️ Kindness & trust: someone who is kind to others, and to themselves, who deserves the trust of their friends.\n👾 Quality time: I love walks, video gaming together (e.g. coop), holding hands, cuddling…after the shyness part of me goes away, of course!\n❤️ Sex, eventually: see\nWhat I’m not looking for\nWrestling in Golden Gate Park\nALT\nWhat I’m not looking for\n🦄 An exclusive relationship: I have a few partners that I am very close to, and expect the partner I’m living with to be continue to be my main squeeze until we get old and wrinkly together!\n💟 Sex, at first: it’s really important to me that we like each other more than just wanting to get into each others’ pants - looks aren’t #1 for me when it comes to my interest in dates, and I’m much more interested in who you are and how your brain works. Sexual health is also critically important to me, so if we get to it (maybe in a few dates) let’s talk about what this means for each of us.\n🚭 Someone who drinks or smokes a lot: This isn’t a dealbreaker but a strong preference. I’d hope that my partner is working towards a healthy lifestyle, and drinking/smoking daily in my opinion hinders that progress.\n🗒️ A FWB-like relationship: see\n👫 A long-term relationship: I’d like to have a long-lasting…\nAlong the same lines, long distance relationships or relationships with a definitive end-goal in mind (for example, you’re moving to Europe in a year) are not appealing to me.\n🍼 Kids: I’m not interested in this for myself!\nUnless you consider your pets your children, in which case I will adopt them all. Any living thing counts (your cat, your gecko, your ant colony, your succulent collection, etc.).\nDabbling in diving!\nALT\nI went and got a boyfriend and all I got were these bad pics\nI love bubble tea and can make it, too!\nALT\nGangsta\nALT\nI made a persimmon-shaped hat! The photo doesn’t do it justice\nALT\nI love animals\nALT\nTasty\nALT\nMore tasty\nALT\nIguazu Falls with one of my partners - look how tiny I am!\nALT\nCotton candy from a machine, in Argentina!\nALT\nClimbing out of a volcano in Ecuador\nALT\nBaller - because of the fish bag I made\nALT\nBaller - because of the balls\nALT\nWow, you’re still here\n🤙\nIf you think we might be a good match, I’d love to hear from you: please fill in this form. Even if you’re unsure, you should contact me anyway! 0% risk, with potential for reward 🙂\nIf you’re really bored and want to read even more babble about myself in a more sterile format, or want to learn more before you contact me, you can browse the doc I wrote for myself (sans partner intervention) here.\nFran\n06/20/2024\nI’ve had experiences with women way, way long ago. I’d say my experience is very little, but not nonexistent\nFran\n06/23/2024\nMany people who know me, including my partner, like to poke fun about my skin color, and the dichotomy between where I was born and the kind of food/experiences I’m open to 😅\nFran\n06/20/2024\nhit/roll 😉\nFran\n06/23/2024\nStraight from the answer key: One of my two main love languages\nFran\n06/23/2024\nI also hate fascism! 🤣\nFran\n06/23/2024\nI love watermelon",
      "wordCount_fullText": 1
    },
    "scrapeTimestampDetail": "2025-11-26T20:01:34.966168+00:00",
    "id": "usr_0ad3cadb21",
    "docAccessible": true,
    "docPlatform": "custom_site"
  },
  {
    "name": "Allan J.",
    "age": 35,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "DC",
    "locationFlexibility": "None",
    "profileUrl": "https://docs.google.com/document/d/1b8ddwOLdB4V18dv4dutb6tO55aJ104dsAPCKzerLKsg/edit",
    "lastUpdated": "2024-06-03",
    "profileDetails": {
      "fullText": "Allan's Date-Me-Doc\nSaved to Drive\nRequest edit access\nShare\nSign in\nFileEditViewToolsHelp\nDocument tabs\nAllan's Date-Me-Doc\nHeadings you add to the document will appear here.\nTurn on screen reader support\nTo enable screen reader support, press ⌘+Option+Z To learn about keyboard shortcuts, press ⌘slash\nBanner hidden",
      "wordCount_fullText": 37
    },
    "scrapeTimestampDetail": "2025-11-26T19:35:35.609136+00:00",
    "id": "usr_eaf227740a",
    "docAccessible": true,
    "docPlatform": "google_docs"
  },
  {
    "name": "Nadia",
    "age": 28,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "London Berlin Central Europe",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://www.bit.ly/date-me-doctor",
    "lastUpdated": "2024-05-25",
    "profileDetails": {
      "fullText": "﻿Please don't share publicly. \r\n\r\n\r\nHi, I’m Nadia, 29, seeking the right partner for an altruistic power couple. Get in touch with me or share with men who you think might be a good match.\r\nI work in a big consulting firm (for skill building and “earning to give”) but previously dabbled in pandemic preparedness policy, research, nonprofit work, and a biotech startup. Located in Berlin as of August 2025.\r\n\r\n\r\n  \r\n\r\nThis is the most recent picture (July 2025). I need to update my photos however, I have since cut my hair to shoulder length\r\n🍦Pro\r\n* Energetic and bubbly. I laugh a lot, and I’m an easy audience if you want to test your own comedic aptitude. Examples of this:\r\n   * Exercise and humour are my favourite coping skills, so…—well, I better be strong and hilarious.\r\n   * I play improv and host improv workshops sometimes.\r\n   * I go hoarse before I run out of social energy.\r\n* Deliberate approach to life, love efficiency, agentic as fuck.\r\n   * Nothing that can’t be solved with a spreadsheet, a rubber duck, and coffee.\r\n   * I found my last longterm partner after less than 2 months of building a funnel with screening criteria and setting up 5-min video calls. I won’t be a great match for most, and want to be mindful of everyone’s time while I find the person who is. \r\n* Excitable & curious. \r\n   * I’ve been told that my questions are unique and inspiring.\r\n   * I can make surface-level boring topics like patent landscaping and ISO standards sexy.\r\n* Committed to self-improvement.\r\n   * I had a lot of coaching and have set up systems so I don’t make the same mistake twice. I like having essentialist routines and hacking my brain.\r\n   * I worked as a junior psychiatrist before. I am trained in CBT and NVC, and not afraid to use both to help us grow.\r\n* Emotionally stable & pragmatic.\r\n   * Friends appreciate how I balance succinctness and solution-focus with warmth and care.\r\n   * For years, I lived out of a suitcase and didn’t really have a home address. I also cached in dozens of rejections before finding my academic supervisor—but I’m really happy most of the time. This is to say, I’m rather tolerant of uncertainty and rejection in both my personal and professional life.\r\n⚖️ Neutral (?)\r\n* Vegetarian.\r\n   * It’s important to me that my partner is vegetarian or vegan, too.\r\n* I don’t do alcohol, cigarettes, or THC.\r\n   * I care about sharing an evidence-based, healthy lifestyle that acknowledges tradeoffs quantitatively.\r\n   * Not all drugs are created equal; I’ve found psychonauting with loved ones meaningful and connecting. \r\n* No children, by default.\r\n   * Unlikely circumstances such as ²⁴⁄₇ nanny support, a surrogate, and strong impact-related arguments could change my mind if my partner became very excited about having children.\r\n* Good dancer.\r\n   * As a pretty low priority, I would love to find someone who’s into dancing, too. But I’m too impatient to take beginner’s classes together. \r\n🦄 Con/”Niche taste”\r\n* I work a lot. \r\n   * I usually travel for work 4 days a week, and quite long hours. We’ll probably need to compromise and get creative to make space for enough quality time.\r\n* Disagreeable and very direct.\r\n   * I’m also responsive to feedback on my communication style. Still, I’m a better match for someone who enjoys mutual teasing and the occasional roast.\r\n   * I love people who sharpen my thinking—let’s be each other’s whetstones, like these two.\r\n* My sleep is sacred.\r\n   * I need to leave dates before 22:30, otherwise I turn into a pumpkin. Sometimes, I need to set timers for physical intimacy.\r\n🧩 And you?\r\nI’d like to find a partner who has been told he’s a great communicator and fundamentally cares about similar things as I do. Of course, I like all the things most people find attractive in potential mates (humour, intelligence, kindness, success, conventional physical attractiveness, etc). However, I don’t believe I—or anyone, really—can armchair checkbox-criteria for compatibility. You should err on the side of getting in touch! I won’t bite I only bite with consent!\r\n\r\n\r\nIf you’ve read until here and think we vibe, tell me why we would make a great team, and I’ll make time to chat: nadia@montazeri.co or via Facebook messenger (Nadia Xenia Montazeri). Please also share some photos or links to socials. 😊\r\n⭐ Testimonial\r\nI’m good friends with Jan, my previous partner, and I asked him for a review I could add to this document. Here’s what he wrote:\r\n“Nadia and I were in a relationship for two years, so as a Nadia connoisseur, I want to share my experience with you. Reading this document, you might feel like I felt eons ago, when I first encountered her. A bit intimidated, a bit confused, but also intrigued and excited. Being with Nadia is an acquired, yet highly rewarding taste.\r\nYou know how when you go lift weights, you should have a spotter? Someone that both has your back, but also pushes you to improve?\r\nNadia is like that, but for life. Being with her is like standing on a skyscraper-grade foundation and simultaneously jumping on a trampoline. \r\nYou're having a good day? You will not find a more bubbly, more enthusiastic, more supportive person to share it with. Nadia is thirsty for life, and she will show you how to drink your day with gusto. Her shenanigans are legendary and her laughter is more contagious than a pandemic.\r\nYou're having a bad day? She will hold you and show you that it's okay to be vulnerable, that it's okay to be human. With her, heaven is just a hug away. Nadia deeply cares about those around her, and she will always be there for you. She is a person both sharp and soft, both strong and gentle, both wise and curious. Nadia has a vast, vast soul, a one-of-a-kind soul that you will always remember.”\r\n🎨 Pictures\r\n  \r\n  \r\n  \r\n  \r\n\r\n(Pyjama party! I’m the one with the pink toothbrush)\r\n  \r\n\r\n  \r\n\r\n(yes, I’m tiny, 1.57m)",
      "wordCount_fullText": 35
    },
    "scrapeTimestampDetail": "2025-11-26T20:01:45.753119+00:00",
    "id": "usr_ec181fb208",
    "docAccessible": true,
    "docPlatform": "shortener",
    "expandedUrl": "https://docs.google.com/document/d/1J21xd-Fj9clSrMJlf0VkylKV7eKc7dTme6UGuZC61BU/edit?usp=sharing"
  },
  {
    "name": "Greg Rosenthal",
    "age": 28,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "UK Cambridge",
    "locationFlexibility": "Some",
    "profileUrl": "https://freckle-botany-7b8.notion.site/Greg-s-dating-doc-5574d7f17d6e49be86513dab9e971f3e",
    "lastUpdated": "2024-04-29",
    "profileDetails": {
      "fullText": "Skip to content\nGreg’s date-me doc\nGet Notion free\nGreg’s date-me doc\nBasic info\nPhotos\nCareer\nPersonality and values\nLifestyle preferences\nHobbies",
      "wordCount_fullText": 26
    },
    "scrapeTimestampDetail": "2025-11-27T17:11:45.312884+00:00",
    "id": "usr_0949dff098",
    "docAccessible": true,
    "docPlatform": "notion"
  },
  {
    "name": "Domo Hazzard",
    "age": 33,
    "gender": "FNB",
    "interestedIn": [
      "F",
      "M",
      "NB"
    ],
    "location": "DC",
    "locationFlexibility": "Some",
    "profileUrl": "https://bit.ly/dateDomo",
    "lastUpdated": "2024-04-29",
    "profileDetails": {
      "fullText": "﻿Domo (She/They)\r\n\r\n\r\nIG ⧫ Interest form  \r\nBlack, Queer/Bisexual, 34, Nonbinary woman, 5'1\"\r\nWashington, D.C. \r\nPhD student, public historian, and sometimes professor. Food justice advocate. Black freedom organizer on hiatus. \r\nI’m looking for my life partner. Hoping to build a long term relationship that includes romance and sexual intimacy, social and financial partnership, cohabitation (or nearby habitation), and child rearing. My vision is a partnership that is central and committed. I’d like to birth a child in the next 2-4 years. Ethically non-monogamous.\r\nRaised in the black church, currently exploring traditional spiritual practices. Leftist. Omnivorous. I love DIY home improvement, gardening, Netflix reality competition shows, swimming in lakes, hosting dinner parties, and dancing in queer clerbs. ADHD babe. \r\nI’d describe myself as: Opinionated, silly, kind, sensual, insightful, adventurous, committed, contemplative, ambitious\r\n\r\n\r\nMy friends say:\r\n\r\n\r\n* “Hilarious, thoughtful, compassionate, an outstanding and conversational Netflix partner, and a quality co-strategist”\r\n* “Domo offers stability, peace, fresh perspectives, compassion, patience, and good vibes”\r\n* “Domo is a beautiful being inside and out to be experienced by a person who respects deep intellect, history, organizing, political education, food and plants and rituals.”\r\n* “A strategic thinker, deeply caring, enthusiastic researcher and lifelong learner. Her curiosity about life fuels deep connections with her environment, community, friends, family and partners.” \r\n  \r\n  \r\n  \r\n\r\nBeyoncé trip to Berlin with the bestie, Summer 2023\r\nPaddle boating with my mom, Spring 2023\r\n \r\n  \r\n  \r\n\r\n  \r\n  \r\n\r\n\r\n\r\nShowing off a section of a museum exhibition I co-curated! Fall 2022\r\nGassing myself up before speaking on a panel, Winter 2023\r\nLook at this soup I made for my friends and this fence I stained\r\nYou are:\r\n* Black or a person of color\r\n* Kind and generous\r\n* On a continuing journey of unlearning racism, classism, homophobia, transantagonism, ableism, fatphobia, patriarchy, and colonialism. Anti-capitalist. Always working to squash the police inside you.\r\n* Comfortable setting and respecting boundaries. \r\n* A person dedicated to improving the world around you.\r\nAnd also probably:\r\n* Queer\r\n* Intellectually curious\r\n* Clear headed in a crisis\r\n* Fly as hell\r\nYou can read more on how I think about money, non-monogamy, and parenting here.\r\nI know somebody out there wants to be my emergency contact 😂. Want to date and see if that person might be you? Ask me out here or here.",
      "wordCount_fullText": 33
    },
    "scrapeTimestampDetail": "2025-11-26T20:02:14.360256+00:00",
    "id": "usr_388e4d83da",
    "docAccessible": true,
    "docPlatform": "shortener",
    "expandedUrl": "https://docs.google.com/document/d/1FLZWX7gr07KfJ6w8alGYxk1Yrt6AEmlTqKO-M0Cs8tE/edit?usp=sharing"
  },
  {
    "name": "Meaningful Existence",
    "age": 38,
    "gender": "M",
    "interestedIn": [
      "F",
      "NB"
    ],
    "location": "",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://disk.yandex.com/i/k7TfKGcI5a7kEA",
    "lastUpdated": "2024-04-15",
    "profileDetails": {
      "fullText": "MeaningfulExistence.pdf — Yandex Disk\n26\n+1 TB\nMeaningfulExistence.pdf\nSave to Yandex Disk\nDownload\nView\nInstall Yandex Disk on your phone\nYour photos, videos, and documents will always be at hand\nHelp and support\nReport\n©\nYandex\n2012—\n2025\nEN",
      "wordCount_fullText": 39
    },
    "scrapeTimestampDetail": "2025-11-26T20:02:35.859817+00:00",
    "id": "usr_f7b9428395",
    "docAccessible": true,
    "docPlatform": "yandex_disk"
  },
  {
    "name": "Y",
    "age": 28,
    "gender": "M",
    "interestedIn": [
      "F",
      "M"
    ],
    "location": "Western US",
    "locationFlexibility": "Some",
    "profileUrl": "https://docs.google.com/viewerng/viewer?url=https://github.com/YawarRaza7349/YawarRaza7349/raw/main/YawarRaza_Resume.pdf",
    "lastUpdated": "2024-04-13",
    "profileDetails": {
      "fullText": "",
      "wordCount_fullText": 0
    },
    "scrapeTimestampDetail": "2025-11-26T20:02:38.255361+00:00",
    "id": "usr_5639889d6a",
    "docAccessible": true,
    "docPlatform": "google_docs_other"
  },
  {
    "name": "Lilith",
    "age": 32,
    "gender": "F",
    "interestedIn": [
      "M",
      "NB"
    ],
    "location": "NYC NY",
    "locationFlexibility": "Some",
    "profileUrl": "https://elixander.notion.site/Hi-hi-hello-d69bfcec34d248aa85dc804a29e48143?pvs=4",
    "lastUpdated": "2024-04-11",
    "profileDetails": {
      "fullText": "Skip to content\n💘\nHi hi hello\nGet Notion free\n💘\nHi hi hello\nLast updated: Jan 1, 2025\n⏸️\nCurrently taking a break from dating. I’ve archived the contents of this page for now. Wishing everyone luck in their searches!\n💡\nIf you didn’t land here from a Date Me directory, you might be wondering what this is and/or think this is Very Weird (fair). Here’s the NYT Article that first introduced me to the idea—I just think of it as a more custom profile that’s not tied to a specific app.",
      "wordCount_fullText": 95
    },
    "scrapeTimestampDetail": "2025-11-27T17:15:08.109202+00:00",
    "id": "usr_2a12586f88",
    "docAccessible": true,
    "docPlatform": "notion"
  },
  {
    "name": "Kayla Pio",
    "age": 31,
    "gender": "F",
    "interestedIn": [
      "F",
      "M",
      "NB"
    ],
    "location": "San Francisco Bay Area Sacramento Monterey",
    "locationFlexibility": "Some",
    "profileUrl": "https://docs.google.com/document/d/1XA08BjNI_e1avLdtAHWZAD8ZcpNonVPMR5-p0O1pebM",
    "lastUpdated": "2024-03-22",
    "profileDetails": {
      "fullText": "DateMeDocKayla\nSaved to Drive\nRequest edit access\nShare\nSign in\nFileEditViewToolsHelp\nDocument tabs\nDateMeDocKayla\nHeadings you add to the document will appear here.\nTurn on screen reader support\nTo enable screen reader support, press ⌘+Option+Z To learn about keyboard shortcuts, press ⌘slash\nBanner hidden",
      "wordCount_fullText": 0
    },
    "scrapeTimestampDetail": "2025-11-26T20:02:59.531631+00:00",
    "id": "usr_c05d895fb7",
    "docAccessible": true,
    "docPlatform": "google_docs"
  },
  {
    "name": "Allan J",
    "age": 35,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "DC",
    "locationFlexibility": "None",
    "profileUrl": "https://docs.google.com/document/d/1b8ddwOLdB4V18dv4dutb6tO55aJ104dsAPCKzerLKsg/edit?usp=sharing",
    "lastUpdated": "2024-02-18",
    "profileDetails": {
      "fullText": "Allan's Date-Me-Doc\nSaved to Drive\nRequest edit access\nShare\nSign in\nFileEditViewToolsHelp\nDocument tabs\nAllan's Date-Me-Doc\nHeadings you add to the document will appear here.\nTurn on screen reader support\nBanner hidden\nTo enable screen reader support, press ⌘+Option+Z To learn about keyboard shortcuts, press ⌘slash",
      "wordCount_fullText": 37
    },
    "scrapeTimestampDetail": "2025-11-26T19:37:01.040678+00:00",
    "id": "usr_0d7badcc45",
    "docAccessible": true,
    "docPlatform": "google_docs"
  },
  {
    "name": "Micole Rondinone",
    "age": 35,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "NYC NY North America",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://docs.google.com/presentation/d/e/2PACX-1vQ3Kwlop-b1i0cE_VVeyvmCJr-LpkON2mvIMYZq_AEPbo3Q54ChVWVMPSLOdOV7BB_3IrubUH03P0VU/pub?start=true&loop=true&delayms=60000",
    "lastUpdated": "2024-02-18",
    "profileDetails": {
      "fullText": "Micole's Date Me Doc - Google Slides",
      "wordCount_fullText": 7
    },
    "scrapeTimestampDetail": "2025-11-26T20:03:49.416491+00:00",
    "id": "usr_5b4dc04d14",
    "docAccessible": true,
    "docPlatform": "google_slides"
  },
  {
    "name": "Abeer Agrawal",
    "age": 33,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "San Francisco Bay Area",
    "locationFlexibility": "Some",
    "profileUrl": "https://www.dropbox.com/scl/fi/poc3e40guids8rxtl791k/Abeer-s-dating-profile.paper?rlkey=iiflqfzrkal4jmg9hlsef1slu&dl=0",
    "lastUpdated": "2024-02-08",
    "profileDetails": {
      "fullText": "Sign up\nSign in to Dropbox\n​​Abeer’s dating profile\n​​\n​\n​tl;dr\n​​\n​​\n​​Abeer Agrawal\n​​\n​​\n​​Age: 32\n​\n​Gender: Male\n​​Location: San Francisco/NYC\n​​\n​​Looking for: Something longterm, ideally my person - but taking it easy and eager to be surprised​✨​\n​\n​About you\n​​Not “requirements”, but any of these is a very strong plus for me!\n​​\n​​Intellectual curiosity: You’re sharp, intellectually lively, and curious.\n​​\n​​Kindness and Empathy: You’re aware of how your actions impact other people, and make an effort to have a positive influence on people’s lives.\n​​\n​​Emotional Maturity: You’re high EQ, low drama, and communicate in relationships. I’m not great at picking up on hints!\n​​\n​​Growth Mindset: You have goals you want to achieve, and will support me in mine. You’ll call me out when I’m doing something stupid.\n​\n​About me\n​​I’ve spent the last 10 years building two companies that help expand access to credit and finance, with a year long break in between them (during which I felt very lost!). I studied engineering at Carnegie Mellon before that.\n​​\n​​I’m definitely a nerd, but an outdoorsy one - I enjoy hiking, biking, golf and hosting dinners for friends, as much as going to Green Apple Books, going down Wikipedia rabbit holes and reading about bioreactors and the history of the Russian royal family.\n​​\n​​I love to travel, and bake the best brownies and banana pudding that you’ll eat. I always have snacks on me :)\n​​\n​​Being in touch with my inner self is important to me, I mediate and keep a gratitude journal. I’m more likely to make people groan than laugh - I was voted “teller of the deadliest dad jokes” in college\n​​\n​\n​What next?\n​​If this sounds interesting, reach out and schedule a date! Or get a mutual friend to intro us? No need to mention this doc, just get to know me!\n​​\n​​Some ways to find me:\n​​Twitter DM: https://twitter.com/abeerag\n​​FB Messenger: https://www.facebook.com/abeera/\n​​\n​​\nAbeer’s dating profile\ntl;dr\nGender: Male\nAbout you\nAbout me\nWhat next?\nUpdated 712 days ago\nYou are not logged in and changes cannot be saved.",
      "wordCount_fullText": 1
    },
    "scrapeTimestampDetail": "2025-11-26T20:04:03.029591+00:00",
    "id": "usr_73fb709f6f",
    "docAccessible": true,
    "docPlatform": "dropbox_file"
  },
  {
    "name": "Debbie",
    "age": 51,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "UK",
    "locationFlexibility": "Some",
    "profileUrl": "https://www.google.com/webhp",
    "lastUpdated": "2024-02-07",
    "profileDetails": {
      "fullText": "Google\nSearch\nImages\nMaps\nPlay\nYouTube\nNews\nGmail\nDrive\nMore\n»\nWeb History\n|\nSettings\n|\nSign in\nAdvanced search\nAdvertising\nBusiness Solutions\nAbout Google\n© 2025 -\nPrivacy\n-\nTerms",
      "wordCount_fullText": 25
    },
    "scrapeTimestampDetail": "2025-11-26T20:04:04.329549+00:00",
    "id": "usr_990945cacb",
    "docAccessible": true,
    "docPlatform": "custom_site"
  },
  {
    "name": "Mitchell Reynolds",
    "age": 32,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "San Francisco Bay Area",
    "locationFlexibility": "Some",
    "profileUrl": "https://bit.ly/mitchell-doc",
    "lastUpdated": "2024-02-05",
    "profileDetails": {
      "fullText": "Here's a preview of your destination\ntundra-shell-d74.notion.site/Mitchell-s-Date-Me-Doc-9325999704f347a4b2515df774b3c7ff\nMitchell’s Date Me Doc | Notion\nLast updated: @September 22, 2024\nContinue to destination\nYou'll be redirected in 8 seconds...\nThis preview is powered by Bitly\nBitly is dedicated to making the internet a safer place for everyone.\nUse the site preview above to make sure the link takes you where you expect.\n© 2025 Bitly - Handmade in New York City, Denver, Berlin, Bielefeld, and all over the world.\nConsent management",
      "wordCount_fullText": 1
    },
    "scrapeTimestampDetail": "2025-11-26T20:04:06.328098+00:00",
    "id": "usr_2d7cd51549",
    "docAccessible": true,
    "docPlatform": "shortener",
    "expandedUrl": "https://tundra-shell-d74.notion.site/Mitchell-s-Date-Me-Doc-9325999704f347a4b2515df774b3c7ff"
  },
  {
    "name": "Helga",
    "age": 36,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "Central Europe",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://docs.google.com/document/d/1XXtMifaP-rPEZa2TwkXE3p6jg0Vj6rKSnAgRRpkkbiA/edit?usp=sharing",
    "lastUpdated": "2024-02-02",
    "profileDetails": {
      "fullText": "﻿Helga \r\nLocation: Minsk/Belarus, ready to relocate\r\nStudies: BSc in Psychology\r\nProfession: IT recruiter at freelance\r\nEnglish level: В1\r\nHeight/Weight: 168 cm/50 kilos\r\n\r\n\r\nInterested in a serious relationship with a 31-41 years old man without children or with grown-up children. Prefer strong, successful and positive men. I'm not interested in a long-distance relationship.\r\n\r\n\r\nI'm quick-witted, creative, tender and friendly. Well brought up and continue to develop myself.\r\nKey words: art, design, painting, psychology, dancing, traveling, electronics/pop, aerobics, swimming, sauna, health, atheism, nature, camping, going out, beautiful life, humor, drama/comedy.",
      "wordCount_fullText": 99
    },
    "scrapeTimestampDetail": "2025-11-26T20:04:12.427040+00:00",
    "id": "usr_11ad441620",
    "docAccessible": true,
    "docPlatform": "google_docs"
  },
  {
    "name": "Samantha",
    "age": 38,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "DC Philadelphia",
    "locationFlexibility": "None",
    "profileUrl": "https://docs.google.com/presentation/d/e/2PACX-1vRG8EyQRI_ti7OLUf4Yg2agBnmuZITGG7YljSHDkLChAMz3Cf1Qlcv_7ZF_myFCYruP2fZVA66UD0gc/pub?start=true&loop=false&delayms=30000&slide=id.p",
    "lastUpdated": "2024-01-30",
    "profileDetails": {
      "fullText": "Date Me: Samantha - Google Slides",
      "wordCount_fullText": 5
    },
    "scrapeTimestampDetail": "2025-11-26T20:04:14.205605+00:00",
    "id": "usr_eefb5fb22b",
    "docAccessible": true,
    "docPlatform": "google_slides"
  },
  {
    "name": "Oz Chen",
    "age": 34,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "Los Angeles",
    "locationFlexibility": "Some",
    "profileUrl": "https://docs.google.com/document/d/1wXPkP9h1cNvG1dktB5lPVQ0MQ8912rxcE1zfix0h21I/view",
    "lastUpdated": "2024-01-29",
    "profileDetails": {
      "fullText": "Oz's Date-Me Doc\nSaved to Drive\nRequest edit access\nShare\nSign in\nFileEditViewToolsHelp\nDocument tabs\nOz's Date-Me Doc\nLOCATION\nAGE\nCHILDREN\nHEALTH AND HEIGHT\nMARRIAGE\nETHNICITY & “TYPE”\nSUBSTANCES\nMONEY, CAREER AND FINANCE\nOTHER LIFESTYLE PREFERENCES I don’t mind as long as I have the freedom to practice mine:\nTurn on screen reader support\nBanner hidden\nTo enable screen reader support, press ⌘+Option+Z To learn about keyboard shortcuts, press ⌘slash",
      "wordCount_fullText": 37
    },
    "scrapeTimestampDetail": "2025-11-26T19:37:25.754341+00:00",
    "id": "usr_915ab6e464",
    "docAccessible": true,
    "docPlatform": "google_docs"
  },
  {
    "name": "Stephanie",
    "age": 36,
    "gender": "F",
    "interestedIn": [
      "M",
      "F"
    ],
    "location": "San Francisco Bay Area",
    "locationFlexibility": "Some",
    "profileUrl": "https://docs.google.com/document/d/1EBqqElL1ZOEQ2tI7bu5X_vNdlmmkt5eFJ4jzepMKecM/",
    "lastUpdated": "2024-01-15",
    "profileDetails": {
      "fullText": "Stephanie's Date Me Doc\nSaved to Drive\nRequest edit access\nShare\nSign in\nFileEditViewToolsHelp\nDocument tabs\nStephanie's Date Me Doc\nHeadings you add to the document will appear here.\nTurn on screen reader support\nBanner hidden\nTo enable screen reader support, press ⌘+Option+Z To learn about keyboard shortcuts, press ⌘slash",
      "wordCount_fullText": 18
    },
    "scrapeTimestampDetail": "2025-11-26T20:04:43.283069+00:00",
    "id": "usr_e5c2cbe86a",
    "docAccessible": true,
    "docPlatform": "google_docs"
  },
  {
    "name": "Nurdaulet",
    "age": 20,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "Asia",
    "locationFlexibility": "None",
    "profileUrl": "https://www.notion.so/invite/2ad42cdc7a96d6580cc209da189adb166eff3fd4",
    "lastUpdated": "2024-01-12",
    "profileDetails": {
      "fullText": "English (US)\nYour AI workspace.\nCreate your Notion account\nContinue with Google\nContinue with Apple\nContinue with Microsoft\nLog in with passkey\nSingle sign-on (SSO)\nWork email\nUse an organization email to easily collaborate with teammates\nContinue\nBy continuing, you acknowledge that you understand and agree to the Terms & Conditions and Privacy Policy",
      "wordCount_fullText": 54
    },
    "scrapeTimestampDetail": "2025-11-27T17:23:35.127729+00:00",
    "id": "usr_b4980f011e",
    "docAccessible": true,
    "docPlatform": "notion"
  },
  {
    "name": "Kavindu Bimsara Fernando",
    "age": 28,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "Asia",
    "locationFlexibility": "Some",
    "profileUrl": "https://docs.google.com/document/d/1-19K7lvV5H2nr2lNWCePvjIh0wx9DkggVbcqEihP6s0/edit",
    "lastUpdated": "2024-01-09",
    "profileDetails": {
      "fullText": "Date me directory\nSaved to Drive\nRequest edit access\nShare\nSign in\nFileEditViewToolsHelp\nDocument tabs\nDate me directory\nKavindu Bimsara Fernando\nTurn on screen reader support\nBanner hidden\nTo enable screen reader support, press ⌘+Option+Z To learn about keyboard shortcuts, press ⌘slash",
      "wordCount_fullText": 27
    },
    "scrapeTimestampDetail": "2025-11-26T20:05:09.479420+00:00",
    "id": "usr_ccaccd6c86",
    "docAccessible": true,
    "docPlatform": "google_docs"
  },
  {
    "name": "Yuliya",
    "age": 32,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "",
    "locationFlexibility": "",
    "profileUrl": "https://docs.google.com/document/d/1c6vmlqQRkzZz65JZm-5LEGDZ8bytfnSxUx00_KRYf0w/edit",
    "lastUpdated": "2024-01-08",
    "profileDetails": {
      "fullText": "﻿Hello\r\n\r\n\r\nMy name is Yuliya. I'm 32 years old, 173 cm, living in Minsk, Belarus. I work as an engineer.\r\n\r\n\r\nI am looking for a monogamous relationship with someone who is located in the Connecticut area. I am looking for someone who has a sense of humor, is family oriented, shares similar interests, is looking to have children, has a desire to travel and go on adventures, but is also comfortable just staying in and watching movies. \r\n\r\n\r\ntg @yuliya_911\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n08.01.2024",
      "wordCount_fullText": 83
    },
    "scrapeTimestampDetail": "2025-11-26T20:05:15.115129+00:00",
    "id": "usr_5217484fbd",
    "docAccessible": true,
    "docPlatform": "google_docs"
  },
  {
    "name": "Jacob",
    "age": 39,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "San Francisco Bay Area",
    "locationFlexibility": "Some",
    "profileUrl": "https://typezero.fun/Personal/date+me",
    "lastUpdated": "2024-01-07",
    "profileDetails": {
      "fullText": "Type Zero Fun\nBreathwork\nEvergreen Notes\nPersonal\ndate me\nreading list\nhome\nI have moved this to a private document. Please request to view it and leave me a note, preferably with a link to your own doc.\nDate Me\nI have also prepared a matchmaking guide, where I outline my bounty and additional information that will help prospective matchmakers identify someone compatible with me. If you request access to this document I will assume that you are not interested in dating me.\nMatch Me\nLINKS TO THIS PAGE\nevergreen notes\ndate me\nPowered by Obsidian Publish",
      "wordCount_fullText": 5
    },
    "scrapeTimestampDetail": "2025-11-26T20:05:28.263141+00:00",
    "id": "usr_21be78652a",
    "docAccessible": true,
    "docPlatform": "custom_site"
  },
  {
    "name": "jocy.wu",
    "age": 48,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "Asia",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://docs.google.com/document/d/e/2PACX-1vQH9IMFePkOpVqHmITN4dVs9gK3gAkZaW8YpSZp18h4eFIMguNPR5qwI2hlxQz1jf2N8v7OIQ1c7OSQ/pub",
    "lastUpdated": "2024-01-06",
    "profileDetails": {
      "fullText": "无标题文档\nPublished using Google Docs\nReport abuse\nLearn more\n无标题文档\nUpdated automatically every 5 minutes\nHello\nI love life, love to laugh, and love photography\nLived in southern China\nLike traveling, outdoor activities, and beautiful life\nhave a daughter",
      "wordCount_fullText": 39
    },
    "scrapeTimestampDetail": "2025-11-26T19:38:26.919941+00:00",
    "id": "usr_6c16f99123",
    "docAccessible": true,
    "docPlatform": "google_docs"
  },
  {
    "name": "G. Scott Graham-Stephens",
    "age": 60,
    "gender": "M",
    "interestedIn": [
      "M"
    ],
    "location": "",
    "locationFlexibility": "",
    "profileUrl": "https://drive.google.com/file/d/1kIi7bDCGqKWqdNnAT646R3xuvSjQLAwV/",
    "lastUpdated": "2024-01-04",
    "profileDetails": {
      "fullText": "about_scott_graham-stephens.pdf - Google Drive\nLoading…\nSign in",
      "wordCount_fullText": 8
    },
    "scrapeTimestampDetail": "2025-11-26T20:05:38.403827+00:00",
    "id": "usr_eeda9ca742",
    "docAccessible": true,
    "docPlatform": "google_drive_file"
  },
  {
    "name": "Simon",
    "age": 30,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "Central Europe",
    "locationFlexibility": "Some",
    "profileUrl": "https://drive.proton.me/urls/EBFN1C3DYR#dy4uSOHlAoYi",
    "lastUpdated": "2024-01-04",
    "profileDetails": {
      "fullText": "Proton Drive\nEnd-to-end encrypted\nCreate free account\nHm, we couldn't find that one\nThis file may have been deleted, moved or made unavailable. Try reaching out to the file owner.\nBack to Homepage",
      "wordCount_fullText": 2
    },
    "scrapeTimestampDetail": "2025-11-26T20:05:41.157741+00:00",
    "id": "usr_7f046d16f7",
    "docAccessible": true,
    "docPlatform": "proton_drive"
  },
  {
    "name": "Ben Dylan",
    "age": 39,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "NYC Los Angeles Flexible",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://docs.google.com/document/d/1-XTJsW9s_2sAJ7UAM4fQrAqaiE9bsJFZ3mmENnrxdIg/edit?usp=sharing",
    "lastUpdated": "2024-01-03",
    "profileDetails": {
      "fullText": "date me\nSaved to Drive\nRequest edit access\nShare\nSign in\nFileEditViewToolsHelp\nDocument tabs\ndate me\nHeadings you add to the document will appear here.\nTurn on screen reader support\nBanner hidden\nTo enable screen reader support, press ⌘+Option+Z To learn about keyboard shortcuts, press ⌘slash",
      "wordCount_fullText": 0
    },
    "scrapeTimestampDetail": "2025-11-26T20:05:53.201422+00:00",
    "id": "usr_6050579a71",
    "docAccessible": true,
    "docPlatform": "google_docs"
  },
  {
    "name": "Nosa",
    "age": 33,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "Colorado Flexible",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://docs.google.com/document/d/1T_tiwZ3ZD3KMxcYAsqPJRzqIHIdweE3aBUm_SSI6s60/edit",
    "lastUpdated": "2023-12-29",
    "profileDetails": {
      "fullText": "About Nosa\nSaved to Drive\nRequest edit access\nShare\nSign in\nFileEditViewToolsHelp\nDocument tabs\nAbout Nosa\nHeadings you add to the document will appear here.\nTurn on screen reader support\nBanner hidden\nTo enable screen reader support, press ⌘+Option+Z To learn about keyboard shortcuts, press ⌘slash",
      "wordCount_fullText": 0
    },
    "scrapeTimestampDetail": "2025-11-26T20:05:59.143161+00:00",
    "id": "usr_d53c962261",
    "docAccessible": true,
    "docPlatform": "google_docs"
  },
  {
    "name": "Sindhu",
    "age": 35,
    "gender": "F",
    "interestedIn": [
      "M",
      "F"
    ],
    "location": "London UK",
    "locationFlexibility": "Some",
    "profileUrl": "https://docs.google.com/document/d/1bsEIkpmyDxn778qUukRktJhpv_mIH82F6_jEG5Ebfa4/edit",
    "lastUpdated": "2023-12-18",
    "profileDetails": {
      "fullText": "Sindhu Date me Doc\nSaved to Drive\nRequest edit access\nShare\nSign in\nFileEditViewToolsHelp\nDocument tabs\nSindhu Date me Doc\nSindhu’s Dating Bio\nTurn on screen reader support\nBanner hidden\nTo enable screen reader support, press ⌘+Option+Z To learn about keyboard shortcuts, press ⌘slash",
      "wordCount_fullText": 28
    },
    "scrapeTimestampDetail": "2025-11-26T20:06:16.348193+00:00",
    "id": "usr_2936a1d29e",
    "docAccessible": true,
    "docPlatform": "google_docs"
  },
  {
    "name": "Manan Ghelani",
    "age": 32,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "France",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://docs.google.com/document/d/1r8Udo27OPrPD84ZC6ULBUBE8TMn8EDGj2ni1nhmcgHU/edit?usp=sharing",
    "lastUpdated": "2023-12-11",
    "profileDetails": {
      "fullText": "Manan Ghelani About Me\nSaved to Drive\nRequest edit access\nShare\nSign in\nFileEditViewToolsHelp\nDocument tabs\nManan Ghelani About Me\nHeadings you add to the document will appear here.\nTurn on screen reader support\nBanner hidden\nTo enable screen reader support, press ⌘+Option+Z To learn about keyboard shortcuts, press ⌘slash",
      "wordCount_fullText": 35
    },
    "scrapeTimestampDetail": "2025-11-26T19:39:08.502938+00:00",
    "id": "usr_fe955a7bbb",
    "docAccessible": true,
    "docPlatform": "google_docs"
  },
  {
    "name": "Max Alexander",
    "age": 22,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "NJ",
    "locationFlexibility": "Some",
    "profileUrl": "https://www.dropbox.com/scl/fi/gfwlovmellrmicjddxnib/Max.paper?rlkey=rmfepdkhm2128uqhel41mmljh&dl=0",
    "lastUpdated": "2023-11-29",
    "profileDetails": {
      "fullText": "Sign up\nSign in to Dropbox\n​​Max’s Dating Profile\n​​\n​​Hey, thanks for coming. I already ordered some appetizers for us :)\n​​\n​​Since you’re here I’m guessing you have some interest in possibly dating, at least I hope so (otherwise I just wasted 10 dollars on bread sticks and cauliflower)\n​​\n​​Before we get any further I guess I should say I’m:\n​​A 22 year old straight man\n​​From/live in NJ but went to college in Ohio (and semi-recently graduated ​🎉​)\n​​I studied Philosophy and have a minor in Mathematics\n​​Open to long distance\n​​Not sure if my dream girl lives in Ohio, but if she does I hope she doesn’t like it too much because I want to escape this state as soon as I can\n​​Interested in a long-term relationship\n​​but I’m open to trying something more casual\n​​Mostly confident I want kids (one day)\n​​I have a beard and I’ll probably never shave it\n​​sorry for the inaccurate pics, I don’t know how to draw beards\n​​\n​​Here’s a photo of me with my Bionicle collection (I hear girls find this very attractive)\n​​\n​​I can understand if you want to skip the rest of the date and just go back to my place (and play with legos together <3), but why don’t I tell you a bit more about myself first!\n​​\n​\n​I’ve been described as someone who\n​​Is a great listener\n​​Should look into becoming a therapist\n​​Gives good dating/relationship advice (and is very single, someone do the the math here)\n​​Is understanding,\n​​won’t take things personally,\n​​very communicative,\n​​extremely kind,\n​​emotionally intelligent\n​​Cares, in his own way\n​​Is an excellent writer\n​​Can make it hard for people to tell when they’ve done something I like or dislike\n​​Incredibly bad at communication\n​​Has amazing hair and beautiful eyes (perfect to lose yourself in)\n​​Is very welcoming, both academically and socially\n​​Number one coolest EA and third funniest EA on Twitter (these were self assigned)\n​​Is incapable of small talk (at least when I’m the one who has to do the small talking)\n​​Has a lot of passion and knowledge about the things I care about\n​​\n​​Me pretending to be a Greek philosopher on Twitter at 2 am\n​​\n​​That all sounds pretty good to me! Doesn’t it sound good to you? Wait… you want to hear even more? Dang, I should have let you take me home when I showed you my legos, oh well.\n​​\n​\n​Some positive traits about me\n​​I am incredibly defensive of the people I care about and always willing to see the good in them\n​​I’m not necessarily very good at expressing it\n​​I’m funny, in a very stupid kind of way\n​​Passionate\n​​I really like talking, especially about ideas! I love taking things apart with other people, and seeing if we can understand something better\n​​Someone who updates a lot, including updating their behavior\n​​I view myself as not very skilled at a lot of things, but willing to learn how to be better (remember this for when we start making out)\n​​My incompetency is so extreme you have no choice but to find it endearing (I have shattered 5 water bottle lids this year because I keep dropping them on the concrete)\n​​Strong moral convictions\n​​Very good at couching my positive traits in slightly negative context\n​​I have a lot of love and care to give (but it might not be a consistent daily amount)\n​​I’m not necessarily good at showing it\n​​I could imagine me expressing it being overwhelming\n​​I think sometimes I can come off as very hot and then cold\n​​I’m creative\n​​Probably decently intelligent\n​​Very extraverted (but I'm sometimes a bit shy, I’m not a stereotypical extravert type for sure)\n​​I’m really interested in other people\n​​I will never get sick of you telling me about yourself or the troubles or triumphs of your day\n​​No like actually, no one believes me, but rant at me for hours I want to hear you talk about the things you care about, were impactful to you, important to you, or just kind of annoying\n​​I’m very dumb, so if we ever play chess or a strategy game you will surely beat the ever loving crap out of me\n​​I try to be very kind, and have been described as such (I kinda doubt those people though)\n​​I have a lot of thoughts per minute, not all of them connected\n​​never a boring moment with Max! (this is not a guarantee and probably very false)\n​​\n​​I’m also just very nerdy. I love movies, I like TV. I read a lot of the new comics that are released every Wednesday. I play D&D and I like writing stories and world building. I like learning and talking about new ideas and concepts. I like math even though I suck at it. I feel like I don’t fit into the personality stereotype of someone who studies philosophy and plays d&d, but everything I described before this makes it sound like I do. And I kinda look like I play d&d (as in my appearance).\n​​\n​​Wow look at this totally real phot of me at a party, I’m so cool right?\n​​\n​​Oh uh, sorry I haven’t looked at the menu yet, I’ve been too busy telling this stranger how cool I am. The restaurant closes in an hour? Uh… can we get more bread?\n​​\n​​Sorry about that, guess the waiter thinks they’re sooo cool because it’s their job to ask us for our order. Where was I? Oh yes, some of my worst traits. I had to put in serious work to cut this list down from the original 300 bullet points. What that says about me we may never know.\n​​\n​\n​Abridged list of Negative traits\n​​I am very lazy, to the point I may fail to do something incredibly important or be averse to doing something that would improve everyone’s life at very little cost to me (like the dishes)\n​​I like when my room is clean, but I’m lazy enough and unbothered enough that I’ll let it get really bad and then clean it when it’s so bad I have to\n​​This is probably why I only get a haircut every 6 months\n​​I can be very forgetful or inconsiderate in ways that seem to suggest I don’t value you\n​​I once finished a TV show me and a friend had been watching every week together because they went away for a weekend so I thought “hmm what am I going to do tonight, oh I’ll watch that tv show I watch every week that just released the last episode”\n​​This means that I may repeatedly do something that hurts you a lot, not out of malice but out of forgetfulness (which may be worse). I think this can make me come off as someone who doesn’t care or won’t put in the effort\n​​I may bottle up my feelings and not share them (or forget about them)\n​​I think I’ve been doing a good job as of late not doing this though!\n​​I have difficulty communicating my feelings in the moment\n​​It’s easy for me to say “oh I was sad once” or “that TV show makes me sad”, it’s harder for me to say “I’m sad right now, this TV show is making me sad”\n​​I can be very private and a bit shy (hint: I don’t actually look like a stick figure)\n​​Very brash and opinionated but also weirdly willing to hold my tongue (more than I should)\n​​sometimes I say or believe the dumbest things you’ve ever heard\n​​I don’t value myself as much as I should\n​​I have imposter syndrome about being a good person\n​​I have an inadequate sense of fashion (or at the very least I’m just not trying very hard)\n​​I can make people feel taken for granted\n​​Incompetent speller, incapable of properly pronouncing words in my native tongue (I only speak one language, idk why I said ‘native tongue’)\n​​Weirdly pedantic though\n​​\n​​look at how cute I am in my comfy hoodie\n​​\n​​Yeah we might as well leave now, sorry I never ordered a real dish, I was trying to figure out which one would optimize my personal utility (and tell you about myself at the same time) so my brain kind of overloaded. Not sure if that’s a good or bad thing, just like these next set of traits.\n​​\n​\n​Neutral traits I have\n​​I probably forgive people too easily\n​​I like to talk a lot\n​​I present very solid (no idea what this means but my friend said it about me)\n​​I get a lot of happiness when other people are happy\n​​I’ve had a lot of depressed friends over the years, so I may be better than average at dealing with mental health issues in others\n​​I find it incredibly hard to maintain anger at other people\n​​I absolutely hate when someone doesn’t engage, especially in a fight. I may be more sensitive than average to getting muted/blocked or leaving a disagreement unresolved for hours or days\n​​Kinda silly even when I’m being serious (at least sometimes)\n​​\n​​Me thinking deep thoughts such as “can you still love someone as a worm”\n​​\n​​What am I looking for in a partner? Sorry, give me a second I just choked on some bread. I’m just so bad at stating and understanding my preferences I nearly died just then. Yes I took the bread, I paid for it after all.\n​​\n​​Surly Max, you must have some sort of preference for your partner, I can hear you asking. I do! But I’m inexperienced enough and generally amicable that it’s hard for me to tell exactly what I’d like. My sense is:\n​​I like people who are\n​​Strong. This can be in a bunch of different ways such as, emotional maturity, intelligence, literally strong, or something else, but I like people who have some kind of strength\n​​Willing to engage with me\n​​Are kind and willing to be epistemically virtuous\n​​I like physicality and touch\n​​I want someone to grow old and get constantly nerd-sniped with\n​​\n​​But that list is pretty rough for me, if you think we might be compatible or that you might want to go on a date with me I’d encourage you to reach out, even if you’re immortal and don’t age (happy to get nerd-sniped and stay young).\n​​\n​​Really, my ideal relationship is with someone I can send cute pictures of rats to, share interesting things I find on the internet with, be physical with (give you a hug), talk to a lot and discuss lots of interesting things with. I’m happy if you drag me to activities you find really fun and engaging, or if we just bought potato chips and sat at home all night. I like to be very silly, but I take things extremely seriously, sometimes with a silly approach but still I am being serious (in my own way).\n​​\n​​I really value open discussion and intellectual honesty. We don’t have to share the same opinions or values on everything, but I think we do need to be able to have conversations about our agreements and disagreements. I believe lots of our ideas should be weakly held and we should be open to changing them (but I’ll hold you as tightly as you’d like ​😉​).\n​​\n​​I am very extraverted, so I’m basically happy to talk for like 8 hour straight. In my ideal world, and when I’m well rested enough, we might have multiple conversations going on at once (maybe one about how your day was and another passionate discussion about the dumbest philosophical disagreement two human have ever had). I think this could be overwhelming, but I’m also good at and happy to give people the space they need.\n​​\n​​I want to completely share myself with someone, and flood them with love and support, and be wowed by their existence (I’m very easy to impress don’t worry).\n​​\n​​Ideally you are at least on board with or sympathetic to the broad concept of EA, but you do not have to be an EA!\n​​\n​​If you think we might be a good fit, or at least might want to be friends, please reach out on Twitter or email absurdlymax@gmail.com. Sorry I don’t have a more romantic outreach method, but I figured putting my mailing address on the internet could end poorly. Happy to talk more and answer anything this doc didn’t (I won’t take offense to any of your questions! Feel free to ask me how tall I am).\n​​\n​​Edit Nov 2023: I now begrudgingly accept that adding pictures of myself is a good idea. Here’s a bunch in a google doc.\n​​\n​​I no longer live in Ohio, thank goodness\n​​Still open to long distance though\n​​Disclaimer, this is not my real collection, it’s a photo I found on the internet\n​​Hindsight 20/20 some of this might be adhd\n​​I don’t actually smoke, this is a candy cigarette\nMax’s Dating Profile\nI’ve been described as someone who\nSome positive traits about me\nAbridged list of Negative traits\nNeutral traits I have\nUpdated 640 days ago\nYou are not logged in and changes cannot be saved.",
      "wordCount_fullText": 1
    },
    "scrapeTimestampDetail": "2025-11-26T20:06:27.405077+00:00",
    "id": "usr_169fe68959",
    "docAccessible": true,
    "docPlatform": "dropbox_file"
  },
  {
    "name": "Abeer Agrawal",
    "age": 32,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "San Francisco Bay Area NYC NY Western US Berkeley",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://www.dropbox.com/scl/fi/poc3e40guids8rxtl791k/Abeers-dating-profile.paper?rlkey=iiflqfzrkal4jmg9hlsef1slu&dl=0",
    "lastUpdated": "2023-11-02",
    "profileDetails": {
      "fullText": "Sign up\nSign in to Dropbox\n​​Abeer’s dating profile\n​​\n​\n​tl;dr\n​​\n​​\n​​Abeer Agrawal\n​​\n​​\n​​Age: 32\n​\n​Gender: Male\n​​Location: San Francisco/NYC\n​​\n​​Looking for: Something longterm, ideally my person - but taking it easy and eager to be surprised​✨​\n​\n​About you\n​​Not “requirements”, but any of these is a very strong plus for me!\n​​\n​​Intellectual curiosity: You’re sharp, intellectually lively, and curious.\n​​\n​​Kindness and Empathy: You’re aware of how your actions impact other people, and make an effort to have a positive influence on people’s lives.\n​​\n​​Emotional Maturity: You’re high EQ, low drama, and communicate in relationships. I’m not great at picking up on hints!\n​​\n​​Growth Mindset: You have goals you want to achieve, and will support me in mine. You’ll call me out when I’m doing something stupid.\n​\n​About me\n​​I’ve spent the last 10 years building two companies that help expand access to credit and finance, with a year long break in between them (during which I felt very lost!). I studied engineering at Carnegie Mellon before that.\n​​\n​​I’m definitely a nerd, but an outdoorsy one - I enjoy hiking, biking, golf and hosting dinners for friends, as much as going to Green Apple Books, going down Wikipedia rabbit holes and reading about bioreactors and the history of the Russian royal family.\n​​\n​​I love to travel, and bake the best brownies and banana pudding that you’ll eat. I always have snacks on me :)\n​​\n​​Being in touch with my inner self is important to me, I mediate and keep a gratitude journal. I’m more likely to make people groan than laugh - I was voted “teller of the deadliest dad jokes” in college\n​​\n​\n​What next?\n​​If this sounds interesting, reach out and schedule a date! Or get a mutual friend to intro us? No need to mention this doc, just get to know me!\n​​\n​​Some ways to find me:\n​​Twitter DM: https://twitter.com/abeerag\n​​FB Messenger: https://www.facebook.com/abeera/\n​​\n​​\nAbeer’s dating profile\ntl;dr\nGender: Male\nAbout you\nAbout me\nWhat next?\nUpdated 712 days ago\nYou are not logged in and changes cannot be saved.",
      "wordCount_fullText": 1
    },
    "scrapeTimestampDetail": "2025-11-26T20:06:54.879103+00:00",
    "id": "usr_870452fa93",
    "docAccessible": true,
    "docPlatform": "dropbox_file"
  },
  {
    "name": "Alex Wilson",
    "age": 32,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "San Francisco Bay Area",
    "locationFlexibility": "Some",
    "profileUrl": "https://awlego.com/dateme",
    "lastUpdated": "2023-10-31",
    "profileDetails": {
      "fullText": "Log in or sign up\nContinue with Apple\nor\nEmail\nContinue\nDropbox\nDesktop app\nMobile app\nIntegrations\nFeatures\nSolutions\nSecurity\nEarly access\nTemplates\nFree tools\nProducts\nPlus\nProfessional\nBusiness\nEnterprise\nDash\nReclaim.ai\nDropbox Sign\nDocSend\nPlans\nProduct updates\nFeatures\nSend large files\nSend long videos\nCloud photo storage\nSecure file transfer\nCloud backup\nEdit PDFs\nElectronic signatures\nConvert to PDF\nSupport\nHelp center\nContact us\nPrivacy & terms\nCookie policy\nCookies & CCPA preferences\nAI principles\nSitemap\nLearning resources\nResources\nBlog\nEvents\nCustomer stories\nResources library\nDevelopers\nCommunity forums\nReferrals\nReseller partners\nIntegration partners\nFind a partner\nCompany\nAbout us\nJobs\nInvestor relations\nOur impact\nEnglish (United States)",
      "wordCount_fullText": 9
    },
    "scrapeTimestampDetail": "2025-11-26T20:06:56.872482+00:00",
    "id": "usr_bacc2418a5",
    "docAccessible": true,
    "docPlatform": "custom_site"
  },
  {
    "name": "Alena",
    "age": 34,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "Central Europe Berlin",
    "locationFlexibility": "Some",
    "profileUrl": "https://docs.google.com/document/d/1RwGSgua9ZTo6uP19gANAORfjMKQucLCwDuxx9G1YsrE/edit?usp=sharing",
    "lastUpdated": "2023-10-21",
    "profileDetails": {
      "fullText": "﻿Basics\r\n* Woman, straight, born 1989\r\n* Lives in Prague, visits Berlin very often\r\n* Communicative in Czech, English and can understand German\r\n* 170cm, thin\r\n* Working full time as a data-scientist\r\n* Pretty neurotypical\r\n* I would like to have kids\r\nHow I look\r\n2023\r\n  \r\n\r\n\r\n\r\nI don’t want to share more details openly, so please send me your dating doc first and I’ll share the rest of my doc (Alena's date me doc [long version]) with you afterwards. Thanks",
      "wordCount_fullText": 78
    },
    "scrapeTimestampDetail": "2025-11-26T20:07:00.534348+00:00",
    "id": "usr_693f6a2220",
    "docAccessible": true,
    "docPlatform": "google_docs"
  },
  {
    "name": "Zak Kallenborn",
    "age": 33,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "DC",
    "locationFlexibility": "Some",
    "profileUrl": "https://zkallenborn.com/dateme",
    "lastUpdated": "2023-10-18",
    "profileDetails": {
      "fullText": "Zak's Site",
      "wordCount_fullText": 3
    },
    "scrapeTimestampDetail": "2025-11-26T20:07:05.138811+00:00",
    "id": "usr_c94d1be648",
    "docAccessible": true,
    "docPlatform": "custom_site"
  },
  {
    "name": "quinn",
    "age": 31,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "San Francisco Bay Area Berkeley",
    "locationFlexibility": "Some",
    "profileUrl": "https://quinnd.net",
    "lastUpdated": "2023-09-28",
    "profileDetails": {
      "fullText": "Hello from Quinn Dougherty | Quinn Dougherty\nSkip to main content\nQuinn Dougherty\nCV\nDate me\nQuinn Dougherty\nSoftware etc. He/him. Berkeley.\nMy documentation\nMath and CS\nWorking on Guaranteed Safe AI\nSocials\nCan we secure AI via formal methods?\nLessWrong\nEffective Altruism Forum\nGitHub\nX\nManifold\nSite built at Fri Oct 31 2025 14:05:41 GMT+0000 (Coordinated Universal Time).",
      "wordCount_fullText": 62
    },
    "scrapeTimestampDetail": "2025-11-26T20:07:26.478011+00:00",
    "id": "usr_b555d28cec",
    "docAccessible": true,
    "docPlatform": "custom_site"
  },
  {
    "name": "Lauren",
    "age": 32,
    "gender": "F",
    "interestedIn": [
      "F",
      "M"
    ],
    "location": "London",
    "locationFlexibility": "Some",
    "profileUrl": "https://docs.google.com/document/d/1IdN1GFAlBzw0SxyxpngUPMjWohCumAz_Kkwd_Kkvj1I/edit",
    "lastUpdated": "2023-08-31",
    "profileDetails": {
      "fullText": "Lauren Gilbert Date Me Doc\nSaved to Drive\nRequest edit access\nShare\nSign in\nFileEditViewToolsHelp\nDocument tabs\nLauren Gilbert Date Me Doc\nHeadings you add to the document will appear here.\nTurn on screen reader support\nBanner hidden\nTo enable screen reader support, press ⌘+Option+Z To learn about keyboard shortcuts, press ⌘slash",
      "wordCount_fullText": 0
    },
    "scrapeTimestampDetail": "2025-11-26T20:08:18.137886+00:00",
    "id": "usr_25e4976fcd",
    "docAccessible": true,
    "docPlatform": "google_docs"
  },
  {
    "name": "Kevin",
    "age": 39,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "Austin",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://kevg.neocities.org/",
    "lastUpdated": "2023-08-24",
    "profileDetails": {
      "fullText": "kevg\nMoved to\nkevgrig.com",
      "wordCount_fullText": 5
    },
    "scrapeTimestampDetail": "2025-11-26T20:08:57.286786+00:00",
    "id": "usr_642f2b790f",
    "docAccessible": true,
    "docPlatform": "custom_site"
  },
  {
    "name": "J",
    "age": 35,
    "gender": "NB",
    "interestedIn": [
      "F",
      "M",
      "NB"
    ],
    "location": "Toronto",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://bit.ly/connection_quest",
    "lastUpdated": "2023-08-21",
    "profileDetails": {
      "fullText": "﻿Connection Quest\r\nI’m seeking a co-adventurer. Welcome to my modern day personal ad. \r\n Visual description of image: Radio City Music Hall in New York City serves as the backdrop, with people gathered around. In the foreground, I stand wearing a jumpsuit with a stripy gold sparkly top, and black pants. I am wearing a sheer cape with flowers on it, a black purse that looks like a large bowtie, and red satin heels. My hair is short, like a pixie cut, and I have gold dangly earrings and a gold necklace. I'm smiling broadly, radiating excitement. \r\n\r\nVideo: link\r\n\r\n\r\nHello there! I'm J, venturing into this digital realm to find a kindred spirit. While most love stories spark in unexpected places, why not create a chance for serendipity here?\r\n\r\n\r\nTo the tune of \"If You Like Pina Coladas”:\r\n♫ If you like green smoothies, or getting lost in a board game\r\nIf you're not into smoking, if you don’t think masks are lame\r\nIf you like making goals and dancing, or doing wind sports at the Cape\r\nI might be the one you've looked for, let's go on a fun date ♫\r\n\r\n\r\nAbout me: \r\nEntrepreneur, author, angel investor. Into mindfulness, outdoor adventures, reading, writing, songwriting, hiking with my friendly rescue dog, wind sports (wingfoiling and sailing), altruism, musicals, comedy, summer camp for adults, jazz, board games, dancing (salsa dancing, bachata, hustle), skiing, healthy living, offline time & personal growth. Core values: growth, impact, connection, integrity, fun. Looking for something serious. \r\nBasics: 35, she/they, 5\"5, Toronto-based, pan, monogamous, no kids, open to kids/adoption, vaccinated, have a dog, drink sometimes, non-smoker, don't do drugs, spiritual, active, ENTP.\r\n\r\n\r\nTogether We Could: Dance, meditate, go on outdoor adventures, hike, cook, learn and grow, make a positive impact, play board games, listen to jazz, travel, be silly and have fun. \r\n\r\n\r\nWhat I’m Looking For In A Partner:\r\nShared core values, a co-adventurer, making a positive impact, kind, emotionally and financially stable. Would love to learn and grow together, be there for each other, be playful, have fun, etc. \r\n\r\n\r\nIntrigued? \r\nIf this resonates, don't be a stranger! If you think we’d connect (whether romantically or as friends), I’d love to hear from you - I created a way for us to get to know each other here bit.ly/connection-quest - or write to me at mightbeyourmatch@gmail.com - so we don’t have to rely on chance or algorithms. Share what makes us similar or wonderfully different. A snapshot of you would be the cherry on top. \r\n\r\n\r\nOr, if cupid points elsewhere, share this with someone you feel I might connect with. If you connect me with someone I end up becoming life partners with, I’d happily give you $1K.\r\n\r\n\r\nLet the adventure begin!\r\n Visual description of image: A sunny cloudy sky serves as the backdrop, with the back of a sailboat visible. In the foreground, I sit steering the boat, wearing a silver jacket, light jeans, a black lifejacket, and aviator sunglasses. My hair is short, like a pixie cut, and a dog in a lifejacket can partially be seen beside me. I'm smiling broadly, radiating excitement. \r\n  \r\n\r\n  \r\n  \r\n\r\nBuilt with ♥ & Google Docs",
      "wordCount_fullText": 31
    },
    "scrapeTimestampDetail": "2025-11-26T20:09:09.195228+00:00",
    "id": "usr_aca50c1241",
    "docAccessible": true,
    "docPlatform": "shortener",
    "expandedUrl": "https://docs.google.com/document/d/1_IIP7m7wZR-sEZdr3E3NiLVc8qx0kG5ZHi_11zyMaRM/edit?usp=sharing"
  },
  {
    "name": "Gustavo Cunha",
    "age": 36,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "Brazil",
    "locationFlexibility": "None",
    "profileUrl": "https://sordid-jellyfish-935.notion.site/Perfil-8fba6a75bd894a90959953dae89882d1?pvs=4",
    "lastUpdated": "2023-08-21",
    "profileDetails": {
      "fullText": "Skip to content\nPerfil\nGet Notion free\nPerfil\nEm breve…",
      "wordCount_fullText": 10
    },
    "scrapeTimestampDetail": "2025-11-27T17:42:10.440184+00:00",
    "id": "usr_0546b515e7",
    "docAccessible": true,
    "docPlatform": "notion"
  },
  {
    "name": "Tamera",
    "age": 28,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "San Francisco Bay Area",
    "locationFlexibility": "",
    "profileUrl": "https://docs.google.com/document/d/1n_O2nBYJwsZDSXXrVCo9zZHVioeHyvjNWRk6TVCauS8/edit?usp=sharing",
    "lastUpdated": "2023-08-21",
    "profileDetails": {
      "fullText": "Tamera's dating doc\nSaved to Drive\nRequest edit access\nShare\nSign in\nFileEditViewToolsHelp\nDocument tabs\nTamera's dating doc\nHeadings you add to the document will appear here.\nTurn on screen reader support\nBanner hidden\nTo enable screen reader support, press ⌘+Option+Z To learn about keyboard shortcuts, press ⌘slash",
      "wordCount_fullText": 49
    },
    "scrapeTimestampDetail": "2025-11-26T20:09:37.565424+00:00",
    "id": "usr_a34ee9e7e9",
    "docAccessible": true,
    "docPlatform": "google_docs"
  },
  {
    "name": "Ryan",
    "age": 46,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "DC",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://twitter.com/ryanspahn",
    "lastUpdated": "2023-08-21",
    "profileDetails": {
      "fullText": "Don’t miss what’s happening\nPeople on X are the first to know.\nLog in\nSign up\nRyan Spahn\n2,525 posts\nSee new posts\nFollow\nRyan Spahn\n@ryanspahn\nDesign Coder & Inventor. My apps (Sleep.fm & SpeakerBlast) have brought FUN adventures i.e. meeting w/jerky Google,Justin Bieber, competing on reality TV & more\nBel Air, MDryanspahn.com\nJoined September 2007\n114 Following\n189 Followers\nPosts\nReplies\nMedia\n@ryanspahn hasn’t posted\nWhen they do, their posts will show up here.\nNew to X?\nSign up now to get your own personalized timeline!\nSign up with Apple\nCreate account\nBy signing up, you agree to the Terms of Service and Privacy Policy, including Cookie Use.\nTerms of Service\n |\nPrivacy Policy\n |\nCookie Policy\n |\nAccessibility\n |\nAds info\n |\nMore\n© 2025 X Corp.",
      "wordCount_fullText": 31
    },
    "scrapeTimestampDetail": "2025-11-26T20:09:53.590044+00:00",
    "id": "usr_bac751c66d",
    "docAccessible": true,
    "docPlatform": "twitter"
  },
  {
    "name": "Josh",
    "age": 34,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "Los Angeles",
    "locationFlexibility": "Some",
    "profileUrl": "https://datingjosh.carrd.co",
    "lastUpdated": "2023-08-21",
    "profileDetails": {
      "fullText": "Dating Josh",
      "wordCount_fullText": 2
    },
    "scrapeTimestampDetail": "2025-11-26T20:09:59.133943+00:00",
    "id": "usr_2754100706",
    "docAccessible": true,
    "docPlatform": "carrd"
  },
  {
    "name": "Eduardo",
    "age": 26,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "PA",
    "locationFlexibility": "Some",
    "profileUrl": "https://docs.google.com/document/d/1WC93VkTTABCCPsa-DCsi-4BrGqV52lkKFAw3kd44bjs/edit?usp=sharing",
    "lastUpdated": "2023-08-17",
    "profileDetails": {
      "fullText": "﻿Hi there, I'm Eduardo!\r\nI'm a 27-year-old man doing my PhD in Astrophysics. Yup, I love the stars, but don't worry, I won't bore you with space facts unless you're really into that. \r\n\r\n\r\n  \r\n\r\n  \r\n\r\n\r\n\r\nA few things about me:\r\n\r\n\r\n* I'm Latino, and stand at about 1.73 meters ( 5'8\").\r\n* I don't drink, smoke, or do drugs. I've got no issues if you like a drink now and then, though.\r\n* I'm mostly a pescatarian, but I also enjoy eating chicken occasionally; I cut out red meat a long time ago.\r\n* I’m looking for a genuine, monogamous connection with a woman.\r\n\r\n\r\nWhat I’m into:\r\n\r\n\r\n* I care about social and climate justice, and I’m especially passionate about helping students from underrepresented backgrounds in STEM.\r\n* Environmentally conscious: I do not own a car, so I always bike to places. I try to conserve water and electricity, and I've taken a recent liking to train travels.\r\n* Outdoors is my jam: hiking, kayaking, zip-lining—you name it!\r\n  \r\n\r\n\r\n\r\nHobbies:\r\n\r\n\r\n* Swimming—it's my go-to relaxation.\r\n* Playing the guitar.\r\n* Cooking and experimenting with recipes.\r\n* Hiking and exploring trails.\r\n* Always up to try different cuisines!\r\n  \r\n\r\n  \r\n\r\n\r\n\r\nWhat I appreciate in a partner:\r\nI value intelligence, kindness, and someone supportive. Not looking for academic accolades, just someone who's passionate about their work, has a good laugh, and genuinely enjoys helping others and making a positive impact on the planet.\r\n\r\n\r\nJust so you know:\r\nIf we hit it off and decide to meet, maybe we could have a fun story for how we met? Something other than \"online\" — like meeting at a crowded library while reaching for the same book on quantum mechanics. But hey, that's just a thought!\r\nFeel free to shoot me an email at elihumunguia7@gmail.com",
      "wordCount_fullText": 31
    },
    "scrapeTimestampDetail": "2025-11-26T19:41:44.167962+00:00",
    "id": "usr_b25bc47508",
    "docAccessible": true,
    "docPlatform": "google_docs"
  },
  {
    "name": "HERIK",
    "age": 31,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://twitter.com/pokarhrk?t=6txMmWBE_IrxOhC5sVsESw&s=09",
    "lastUpdated": "2023-08-13",
    "profileDetails": {
      "fullText": "Don’t miss what’s happening\nPeople on X are the first to know.\nLog in\nSign up\nPoker Herik\n27 posts\nSee new posts\nFollow\nPoker Herik\n@pokarhrk\nAeronautical Engineer\n# Stock Trader\nFinancial Plannerbaroda,indiapokar.co.in\nJoined August 2014\n273 Following\n40 Followers\nPosts\nReplies\nMedia\n@pokarhrk hasn’t posted\nWhen they do, their posts will show up here.\nNew to X?\nSign up now to get your own personalized timeline!\nSign up with Apple\nCreate account\nBy signing up, you agree to the Terms of Service and Privacy Policy, including Cookie Use.\nTerms of Service\n |\nPrivacy Policy\n |\nCookie Policy\n |\nAccessibility\n |\nAds info\n |\nMore\n© 2025 X Corp.",
      "wordCount_fullText": 31
    },
    "scrapeTimestampDetail": "2025-11-26T20:10:25.649969+00:00",
    "id": "usr_d8d708ea6b",
    "docAccessible": true,
    "docPlatform": "twitter"
  },
  {
    "name": "Shanni",
    "age": 30,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "Vancouver",
    "locationFlexibility": "Some",
    "profileUrl": "https://shanni-read.notion.site/shanni-read/Shanni-Dating-Profile-3129a32563484843a9711169fb5331cc",
    "lastUpdated": "2023-08-03",
    "profileDetails": {
      "fullText": "Skip to content\nShanni Dating Profile\nGet Notion free\nShanni Dating Profile\nInstagram (@shanni_daily_drawing)\nInstagram photos and videos\nhttps://www.instagram.com/shanni_daily_drawing/",
      "wordCount_fullText": 23
    },
    "scrapeTimestampDetail": "2025-11-27T17:50:37.434001+00:00",
    "id": "usr_7400c5048a",
    "docAccessible": true,
    "docPlatform": "notion"
  },
  {
    "name": "Nicole Kelner",
    "age": 29,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "NY NYC",
    "locationFlexibility": "Some",
    "profileUrl": "https://docs.google.com/document/d/1WAEo7P5mBDopK8Z4eBVh0bsoyZaCz3o8WBv-37XUYLA/edit?usp=sharing",
    "lastUpdated": "2023-08-03",
    "profileDetails": {
      "fullText": "Nicole Kelner Date Me Doc\nSaved to Drive\nRequest edit access\nShare\nSign in\nFileEditViewToolsHelp\nDocument tabs\nNicole Kelner Date Me Doc\nHeadings you add to the document will appear here.\nTurn on screen reader support\nBanner hidden\nTo enable screen reader support, press ⌘+Option+Z To learn about keyboard shortcuts, press ⌘slash",
      "wordCount_fullText": 21
    },
    "scrapeTimestampDetail": "2025-11-26T20:10:55.797470+00:00",
    "id": "usr_a46d2565ca",
    "docAccessible": true,
    "docPlatform": "google_docs"
  },
  {
    "name": "Ansh Radhakrishnan",
    "age": 23,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "San Francisco Bay Area",
    "locationFlexibility": "Some",
    "profileUrl": "https://www.notion.so/Ansh-s-Dating-Doc-a74d6d12f68646b29a6444bc6496ebbf?pvs=4",
    "lastUpdated": "2023-08-03",
    "profileDetails": {
      "fullText": "Skip to content\nAnsh’s Dating Doc!\nGet Notion free\nAnsh’s Dating Doc!\nHey! I’m Ansh. I’m always excited about meeting new people in NYC, but especially excited about meeting someone to date seriously. Consider this doc as my best current attempt at self-advertisement and feel free to click on any sections you’re interested in!\nContact Me!\nAbout Me\nBasics\nVerbose\nPhotos (of me and Autumn 🐶)!\nWhat I’m Looking For\nBasics\nVerbose",
      "wordCount_fullText": 78
    },
    "scrapeTimestampDetail": "2025-11-27T17:52:18.911683+00:00",
    "id": "usr_e540f7a375",
    "docAccessible": true,
    "docPlatform": "notion"
  },
  {
    "name": "Catherio",
    "age": 32,
    "gender": "F",
    "interestedIn": [],
    "location": "San Francisco Bay Area",
    "locationFlexibility": "",
    "profileUrl": "https://paper.dropbox.com/doc/catherios-dating-profile-Wt2wu19F4z1hUEKk8QXK4",
    "lastUpdated": "2023-08-03",
    "profileDetails": {
      "fullText": "Log in or sign up\nContinue with Apple\nor\nEmail\nContinue\nDropbox\nDesktop app\nMobile app\nIntegrations\nFeatures\nSolutions\nSecurity\nEarly access\nTemplates\nFree tools\nProducts\nPlus\nProfessional\nBusiness\nEnterprise\nDash\nReclaim.ai\nDropbox Sign\nDocSend\nPlans\nProduct updates\nFeatures\nSend large files\nSend long videos\nCloud photo storage\nSecure file transfer\nCloud backup\nEdit PDFs\nElectronic signatures\nConvert to PDF\nSupport\nHelp center\nContact us\nPrivacy & terms\nCookie policy\nCookies & CCPA preferences\nAI principles\nSitemap\nLearning resources\nResources\nBlog\nEvents\nCustomer stories\nResources library\nDevelopers\nCommunity forums\nReferrals\nReseller partners\nIntegration partners\nFind a partner\nCompany\nAbout us\nJobs\nInvestor relations\nOur impact\nEnglish (United States)",
      "wordCount_fullText": 5
    },
    "scrapeTimestampDetail": "2025-11-26T20:11:46.706815+00:00",
    "id": "usr_225ba0249f",
    "docAccessible": true,
    "docPlatform": "dropbox_paper"
  },
  {
    "name": "Quinn",
    "age": 29,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "PA Philadelphia",
    "locationFlexibility": "",
    "profileUrl": "https://www.dropbox.com/s/e2mceokf80df0d4/rat-dating-profile.odt?dl=0",
    "lastUpdated": "2023-08-03",
    "profileDetails": {
      "fullText": "Sign In\nThis item was deleted\nYou might be able to find it in your deleted files. If it's not there, try asking the person who shared it with you.\nCheck deleted files\nWe use cookies to provide, improve, protect and promote our services. Visit our Privacy Policy and Privacy Policy FAQs to learn more. You can manage your personal preferences, including your ‘Do not sell or share my personal data to third parties’ setting using the “Customize cookies” button below.\nCustomize cookies\nDecline\nAccept All",
      "wordCount_fullText": 1
    },
    "scrapeTimestampDetail": "2025-11-26T20:11:53.113366+00:00",
    "id": "usr_9a1dcde21c",
    "docAccessible": true,
    "docPlatform": "dropbox_file"
  },
  {
    "name": "Neil Thawani",
    "age": 34,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "Denver Colorado",
    "locationFlexibility": "",
    "profileUrl": "https://lioninawhat.com/love",
    "lastUpdated": "2023-08-03",
    "profileDetails": {
      "fullText": "About You\nAbout Me\nDealbreakers\nContact\nName: Neil Thawani\nBirth year: 1988\nDiet: Omnivore\nLocation of origin: Columbia, Missouri, USA\nPresent location: Denver, Colorado, USA\nPictures (click to expand)\nAll boxes are also expandable.\nPotential Dealbreakers\nTime\nSex\nKids\nMoney\nDesired Traits in a Partner\n+ Optimistic about the future.\n+ a partner in crime doing legal activities\n+ being sweet\n+ Body-mindful\n+ The willingness to do The Work.\n+ I want to meet someone who can teach me something.\n+ enjoys being present in society\n+ Self-actualized or self-actualizing.\n+ you should value having people you love close to you\n+ Familiar with hippie culture.\nThings I Noticed About Myself\n+ hungry for knowledge\n+ good memory\n+ an intuitive and sensory-oriented person\n+ What is randomness, anyway?\n+ therapy\n+ swagtastic\n+ I do not watch professional sports.\nBest way to contact:\nEmail neilthawani@gmail.com prepending the subject line with [Love Doc].\nAn ideal message is similar to the format of this doc with a list of desired traits/habits you want to see in your mate, some self-awareness with various implications, and potential dealbreakers. Some logistical information (age, sex, location, etc.) would be good too.\nAlternatively, you could just shoot your shot.",
      "wordCount_fullText": 53
    },
    "scrapeTimestampDetail": "2025-11-26T20:12:00.411171+00:00",
    "id": "usr_adef7c72b1",
    "docAccessible": true,
    "docPlatform": "custom_site"
  },
  {
    "name": "Dony",
    "age": 27,
    "gender": "M",
    "interestedIn": [
      "F",
      "M",
      "NB"
    ],
    "location": "San Francisco Bay Area",
    "locationFlexibility": "",
    "profileUrl": "https://docs.google.com/document/d/1PfWxS-Xl_KHtHhXfGB8n0IJmKL33MLpJlZNqBrVUPiA/edit",
    "lastUpdated": "2022-10-16",
    "profileDetails": {
      "fullText": "Dony Christie's Dating Doc\nSaved to Drive\nShare\nSign in\nFileEditViewInsertFormatToolsExtensionsHelp\n Heading 1\n Arial\nSuggesting\n9\n8\n7\n6\n5\n4\n3\n2\n1\n1\n2\n3\n4\n5\n6\n7\n8\nGC R\nSep 5, 2023\nAdd: “Lol that’s fair”\nAnonymous\n2:44 PM Jun 26\nAdd: “I too was here”\nAnonymous\n2:44 PM Jun 26\nFormat: bold, font\nAnonymous\n2:45 PM Jun 26\nFormat: text color\nAnonymous\n2:45 PM Jun 26\nFormat: bold, font\nAnonymous\n2:45 PM Jun 26\nFormat: bold, font\nAnonymous\n2:45 PM Jun 26\nFormat: bold, font\nAnonymous\n2:45 PM Jun 26\nFormat: bold, font\nAnonymous\n2:45 PM Jun 26\nFormat: bold, font\nRita Sabri\nAug 2, 2023\nAdd: “???”\nDeyan Liao\n8:23 AM Nov 6\nAdd: “Hi&good luck”\nYou're suggesting\n11\n10\n9\n8\n7\n6\n5\n4\n3\n2\n1\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\nDocument tabs\nDony Christie's Dating Doc\n12\nHeadings you add to the document will appear here.\nTurn on screen reader support\nTo enable screen reader support, press ⌘+Option+Z To learn about keyboard shortcuts, press ⌘slash\nBanner hidden",
      "wordCount_fullText": 0
    },
    "scrapeTimestampDetail": "2025-11-26T20:12:09.156760+00:00",
    "id": "usr_f12e7c6cb0",
    "docAccessible": true,
    "docPlatform": "google_docs"
  }
]