[
  {
    "name": "Monel Chang",
    "age": 36,
    "gender": "F",
    "interestedIn": [
      "M",
      "NB"
    ],
    "location": "North America Western US Portland Oregon",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://compassmeet.com/Monel?referrer=Monel",
    "lastUpdated": "2025-10-13",
    "profileDetails": {
      "fullText": "Compass\nAbout\nFAQ\nVote\nWhat's new\nSocial\nOrganization\nContact\nSign up\nSign in\nBack\nMonel, 36\nWoman\n5' 2\"\nShare\nInterested in men and other between 30 - 45 years old\nSeeking relationship\nPhD at National University of Natural Medicine\nMedical Resident at Amenda Clinic\nEnglish\nEast Asian\nDoesn't smoke\n2 drinks per month\nWants children\nLast online 24 days ago\nsomaticmedicine\nmonelc\nAbout Me\nMonel’s Compass Bio\n1. Introduction\nHi, I’m Monel, a 36-year-old Korean-American naturopathic doctor and performance artist living in the Pacific Northwest. I speak Korean, English, and conversational Spanish and German. My days flow between patient care, artistic exploration, and outdoor adventures in the forested trails nearby.\n2. Connection Goals\nI’m seeking a life partner—someone who shares the desire to build a biological family rooted in love, play, and shared growth. I’m in the PST timezone with a flexible schedule, and I most enjoy connecting through video calls and in-person meetups where energy and presence can be felt more fully.\n3. Core Values\nIntegrity: living in alignment with my words and actions.\nKindness: leading with compassion toward myself and others.\nCreativity: approaching life as an ongoing artistic and healing process.\n4. Interests & Activities\nI find joy in contact improvisation dance, hiking, and backpacking in nature. I love exploring somatics and interoception, and I often unwind by experimenting with new recipes and tasting unfamiliar flavors. Movement, sensory exploration, and curiosity are my gateways into connection—with myself and others.\n5. Personality & Thinking Style\nI think emotionally, creatively, and logically, often weaving all three into how I approach life. While I identify loosely as an ENFP, I see personality as fluid and context-dependent. My humor leans toward playful and introspective, and I value conversations that dance between depth and delight.\n6. Lifestyle & Preferences\nI live a healthy, balanced lifestyle—exercise daily, eat mostly whole foods, and rarely drink or smoke. I currently rent a home with two close friends, and I’m hoping to own a place next year. I work a hybrid 9-5 resident position at a clinic, blending structure with flexibility.\n7. Health & Self-Improvement\nI’ve been dedicated to therapy and self-growth since I was 16, exploring modalities like Internal Family Systems and deep self-inquiry. My current focus is cultivating self-love and integration—learning to meet each inner part with acceptance and curiosity.\n8. Romantic Relationships\nI’m pansexual, though I tend to lean toward the middle of the Kinsey scale (2.5). My love languages are quality time and physical touch, expressed through presence, playfulness, and care. I hope to co-create a partnership that supports mutual evolution, embodied intimacy, and a shared dream of family life.\n9. Ideal Connections\nI feel most at ease with embodied, grounded people who are self-aware, intuitive, and comfortable in their own skin. I’m drawn to those who value clear communication, vulnerability, and emotional honesty—people who meet life with both reverence and humor.\n10. Altruistic & Community Values\nI care deeply about environmental sustainability and holistic healthcare access. I aspire to contribute to communities that prioritize wellbeing, ecological awareness, and equitable systems of care.\n11. Conversation Starters\nWhat is your inner dialogue like?\nHow are you connected to your body?\nWhat creative endeavors help you feel most alive?\nEndorsements\nIf you know them, write something nice that adds to their profile."
    },
    "scrapeTimestampDetail": "2025-11-27T16:35:14.805546+00:00",
    "id": "usr_323f919897",
    "docAccessible": true
  },
  {
    "name": "Martin",
    "age": 28,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "San Francisco Bay Area NYC London Central Europe DC UK Los Angeles Berlin Barcelona, Spain North America Flexible Boston NY Western US Seattle Chicago Asia NJ Philadelphia Paris, France Colorado Toronto Austin PA Canada Brighton Southern US Vancouver TX Portland MA Denver Brazil Amsterdam WI South of France Cambridge Berkeley WA Vancouver Island South Bay Oxford Oregon North Carolina Dubai Somerville Seoul Sacramento Ohio Madison Madrid, Spain Ladysmith BC Indianapolis Georgia Asheville Sydney Australia Sweden Ribeirão Bonito ON New Haven Nebraska Monterey Lubbock Ewing Collingswood CT Rhode Island Miami Indonesia Norway Israel Spain",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://www.compassmeet.com/Martin",
    "lastUpdated": "2025-10-11",
    "profileDetails": {
      "fullText": "Compass\nAbout\nFAQ\nVote\nWhat's new\nSocial\nOrganization\nContact\nSign up\nSign in\nBack\nMartin, 28\nBrussels-Capital Region, Belgium\nMan\n6' 0\"\nShare\nSeeking collaboration, friendship and relationship (monogamous)\nSingle\nMasters at UT Austin\nSoftware Engineer\nEnglish • French\nLiberal • Moderate / Centrist • Pause AI / Tech Skeptic\nAtheist\nINTJ\nWhite/Caucasian\nDoesn't smoke\n6 drinks per month\nVegetarian • Vegan\nLeaning towards wanting children\nLast online in the past day\nmartinbraquet.com\nMartinBraquet\nMartinBraquet\nmartin-braquet\nConnection Doc\nAbout Me\nThoughtful, intellectually curious, and ethically driven, I value deep connections, emotional stability, and personal growth. I enjoy philosophy, science, nature, and mindful physical activity, living simply while prioritizing honesty and meaningful relationships.\nDetailed Description\nI  speak English and French fluently and I’m currently in Europe, but I have recently lived in the US (for 4 years) and India (for 6 months). I'm mostly looking for\nCollaborations: working together on a joint project that we enjoy. I started Compass, and I'm actively looking for ambassadors to volunteer together and share the platform with their network! We could have meetings and discuss how to reach the people who would benefit from it the most. Regardless, hit me up if you have anything to say about Compass! I'm also happy to work on any other project we find meaningful.\nFriendships: mostly to discuss online and share deeper things (see details below).\nLife partnership: with a woman who deeply resonates with what I wrote below.\nCore Values\nHighly stable and non-negotiable guiding principles that shape my worldview, decisions, and moral framework.\nIntellectual curiosity with rational integrity: I evaluate beliefs against evidence and enjoy conversations that challenge and expand my thinking.\nEthical responsibility / Utilitarian-leaning ethics: I consciously act to reduce suffering and improve outcomes on a large scale—through causes like animal welfare, climate change, AI safety, and global poverty.\nEmotional stability and resilience: I remain calm under stress, self-soothe effectively, and approach conflicts with reason rather than panic or overreaction.\nDeep, loving relationships: I thrive in profound 1-on-1 connections where accountability, honesty, and mutual growth are prioritized.\nGrowth-oriented conflict resolution: I engage in solution-focused dialogue, tolerate relational discomfort, and prioritize repair over avoidance.\nIntegrity & deliberateness: I aim to live according to my principles and consciously cultivate trust, depth, and clarity during relationships.\nTolerance for differences: I’m very willing to connect with people who fit more than 70% of these values, embracing trade-offs and growth together.\nLifestyle & Secondary Values\nTraits or principles that matter to me, but are negotiable or context-dependent. Mostly applying to life partnerships—not friendships.\nLife Vision & Practicalities:\nGeography: I enjoy living in Europe but am open to relocate if circumstances align.\nFamily: I’d like 1–2 children within roughly 5–10 years, depending on mutual readiness.\nCareer / lifestyle: I support a partner’s work and ambitions, as long as we can spend meaningful time together (2+ hours most days).\nFinancial approach: I live frugally, saving or donating the rest, but am comfortable if my partner spends more on things meaningful to her.\nAttachment & Intimacy Needs\nConflict & repair: I notice when someone is hurt, but I do not chase them if they withdraw. I prefer calm, constructive conversations when both sides are ready. Because I'll care about you, I'll express it when I think you may be wrong—at the same time, I'll always have your back.\nEmotional intelligence: I’m aware of my emotions and take time to process before responding, which helps me stay calm in tense moments. I try to express my feelings honestly, listen carefully to understand others, and take responsibility when I misstep. I believe that, with mutual effort, we can keep strengthening our emotional intelligence and connection as a healthy, securely attached couple.\nEmotional expressiveness: More through words, modest body language and thoughtful gifts than grand gestures.\nPreferred intimacy style: I enjoy direct and meaningful connections—long dedicated conversations over frequent, shallow texts. I seek a monogamous relationship.\nLifestyle Habits & Daily Rhythms:\nDietary choices: Mostly vegan; I strongly value sensitivity to animal well-being.\nSleep & energy patterns: Typically 11pm–8am; similar routines are a plus.\nExercise & health: Small-group activities several times per week. Open to mental health practices to improve relationships and wellbeing.\nSocial engagement: Few close friendships; comfortable connecting with more socially active or community-involved partners.\nFamily engagement: Average.\nMinimalism: I live a simple and non-performative life without clutter, in order to focus on what truly matters.\nEmotional & Cognitive Style:\nHumor: Mix of wit, playful absurdity, and sarcasm.\nTolerance for uncertainty: Comfortable with ambiguity, but appreciate clear plans when possible.\nRomantic philosophy: Love grows deliberately; romance and thoughtful gestures (e.g., poems) are enjoyable once fundamental compatibilities are aligned.\nRole expectations: Prefer equal partnership, but open to specialization if mutually desired.\nInterests & Activities\nActivities or pursuits I enjoy but that don’t define my ethics or essential lifestyle.\nIntellectual pursuits: Reading nonfiction, exploring philosophy, science, history, and practical wisdom; hands-on learning through building and fixing things.\nDeep conversation: Intense, thoughtful dialogue with like-minded people.\nOptimization & personal growth: Exploring methods to improve life, productivity, and learning practices.\nNature & mindfulness: Contemplative walks or time in natural landscapes; pausing to observe wildlife or scenery inspires awe.\nPhysical activities: Running, biking, swimming, weightlifting—often integrated with mindfulness.\nInfluences\nContents that majorly influenced my worldview.\nBooks:\nThinking, Fast and Slow - Daniel Kahneman\nThe Art of Living a Meaningless Existence - Robert Pantano\nLe Petit Prince - Antoine de Saint-Exupéry\nL’étranger - Albert Camus\nExistential Physics - Sabine Hossenfelder\nThe Big Picture - Sean Carroll\nDoing Good Better - William MacAskill\nEmotional Intelligence - Daniel Goleman\nWaking Up - Sam Harris\nDeep Work - Cal Newport\nSapiens - Yuval Noah Harari\nBeing the Change - Peter Kalmus\nYouTube channels:\nThe Pursuit of Wonder\nKurzgesagt\nFeel free to send recommendations or discuss any content you like!\nAbout You\nTo an imperfect extent, I like who I am and what I do, and would like to see it in the people around me. So, I’m mostly looking for people who identify—at least partially—with the description above and would enjoy the same activities. I believe in growth and potential; so I embrace people who are not there yet (so am I) but have, deep inside, the intention to reach it.\nAs long as you fit some of the description, relationships, to me, transcend gender, age, culture, financial situation, or any other socio-demographic factors; please reach out to me regardless of your situation if you relate to my personality traits. Locations should not be an issue either (a priori); I’ve had close long-distance friendships which worked beautifully for me.\nAbout Us\nI would love to form a close friendship with 3-5 people, and one life partnership with a woman. If you want a shallower connection, that’s also okay; maybe we can still contribute to each other’s lives.\nI'm also looking for collaboration, whether on Compass or any other project which I would be aligned with.\nWhile some key relationship values, such as depth and trust, grow over time, there is one value which, I believe, should be there from the start: honesty. In this regard, please be honest about your intentions—which may include different types of relationships depending on how it evolves, and that’s okay.\nThings I'm currently exploring and I'd like to discuss with whoever is interested:\nPopulation ethics in utilitarianism (total view vs neutral / person affective, longtermism, What we owe the future from MacAskill)\nMoral realism vs anti-realism, the different sub types of anti-realism, mostly constructivism and non-cognitivism (Bertrand Russell, Sean Carroll)\nConsciousness, and whether the hard problem is really a problem\nDo multidisciplinary research / PhD across science and philosophy\nIf emotional intelligence, unlike IQ, is context-dependent (one can have high EI with one type of person, and low EI with another), how important is it to have high EI across all contexts? What proportion of EI is objective (high across all contexts)?\nEffective altruism\nDisclaimers\nThis document desperately lacks elaboration, emotions, and personal information for privacy reasons. I have no issue sharing about my life story, what I look like, what I feel and think, vulnerability, intimacy, and other personal features in private.\nEndorsements\nIf you know them, write something nice that adds to their profile."
    },
    "scrapeTimestampDetail": "2025-11-27T16:35:27.041679+00:00",
    "id": "usr_9368a27fa1",
    "docAccessible": true
  },
  {
    "name": "Ruth",
    "age": 38,
    "gender": "F",
    "interestedIn": [
      "M",
      "NB"
    ],
    "location": "Central Europe",
    "locationFlexibility": "Some",
    "profileUrl": "https://www.compassmeet.com/RuthS",
    "lastUpdated": "2025-10-11",
    "profileDetails": {
      "fullText": "Compass\nAbout\nFAQ\nVote\nWhat's new\nSocial\nOrganization\nContact\nSign up\nSign in\nBack\nRuth S.\nMunich, Germany\nWoman\n5' 5\"\nShare\nInto ambitious and rational compassion (Effective Altruist, vegan, with focus on reducing/preventing suffering near- and long-term)\nMy lifestyle is work driven (=busy) and otherwise simple ~ with rather low budged recreational activities, such as outdoorsy stuff or games, and I love melancholic music to relax (e.g. Kin Soundtrack by Clann; In this shirt by the irrepressibles; Unter den masken by Buntspecht). :)\nLooking for someone who is self-reflective, tolerant about differences and challenges, manages a good balance of edginess and warm-heartedness and isn't too serious.\nRelationship preferences:\nSlight preference for non-monogamy (relationship anarchist). RA means to me exploring and developing frameworks together (while acknowledging the bigger relationship ecosystem of each other) over adhering to relationship norms.\nReciprocal balanced support for each other, nurturing each other's growth, and comfortable vibes over shared activities or sharing daily updates.\nSome shared sportive activities would be nice. I can't commit to very regular activities, though.\nLove language: physical affection - not necessarily on the soft end\nStrong in-person preference: Into physical company, ideally incl. co-working. Open to comet partnerships (an intermittent relationship style that is only active whenever travel plans (e.g. for EA related events) match.\nHappy to work on projects together (had good experiences with that in previous relationships)\nOpen to short-term-dating and long-term-dating, but secretly hoping to find a match that lasts.\nPlans:\nKeep working and advancing on my projects\nInterested in small intergenerational communal living together with some rescued animals, not too central but also not too far from a significant EA hub and close to various in-person working opportunities.\nNot too keen to relocate too far. But not too attached to any place, either.\nYou think we could be a match? Awesome! Let’s have ~10-min video call to check the vibes :)\nI am not much into writing each other but am looking for in-person contact. (I know my screening style is not very romantic, but I also don't want to waste each other's time and nerves too much)\nSign up to see profile"
    },
    "scrapeTimestampDetail": "2025-11-27T16:35:39.065602+00:00",
    "id": "usr_15f3bdcf80",
    "docAccessible": true
  },
  {
    "name": "Jackson",
    "age": 24,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "Philadelphia",
    "locationFlexibility": "Some",
    "profileUrl": "https://www.notion.so/Jackson-s-Date-Me-Doc-27dacb6c88e680daaf3fffae572fc12a?source=copy_link",
    "lastUpdated": "2025-09-29",
    "profileDetails": {
      "fullText": "Skip to content\nYou’re almost there — sign up to start building in Notion today.\nSign up or login\n💙\nJackson’s Date-Me Doc\nShare\n💙\nJackson’s Date-Me Doc\nLast updated Oct 18, 2025\nBasic Info\nName: Jackson\nAge: 24\nLocation: Philadelphia\nPersonality: INTJ\nWhat I do: I’m working right now and trying to get into nursing school\nOrientation: Hetero monogamous man (he/him/his)\nPolitical leaning: center-left\n(This pic is the very beginning of the Schulkyll River Trail)\nWhat do I like?\nI love learning new things. I have played 9 different instruments in my life (my main focus at this stage is guitar)\nI speak Spanish at an intermediate level, but I also just like learning to speak any new language :)\nTransportation: I ride my bike and take SEPTA everywhere (I moved to Philly so that I wouldn’t need a car)\nBesides biking, I exercise by doing judo at my university\nI am deeply compassionate, and care about my family and friends\nI’m pretty ambitious, but I need time to just enjoy basic things like cooking, reading, and going outside\nRight now I’m reading My Struggle by Karl Ove Knausgaard (It’s not what you think it is 😅 it’s a non-fascist autobiographical novel)\nPets: I love cats, I have lived with cats for my whole life (below: me and my roommate’s cat)\nWhat am I looking for?\nMonogamous long-term relationship\nSomeone who values the same things as me\nOptimism, joy in basic things, time offline, learning, compassion, quality time\nI’m undecided on having kids\nWho are you?\nHetero woman, around age 22-28\nLocation: Ideally Philadelphia area but I’m flexible (Especially if we can be connected by a train, ex. Amtrak)\nYou’re open to trying new things, exploring the world, and having fun :)\nIf you made it this far..\nEven if you think we don’t exactly meet each other’s requirements, don’t hesitate to send a message! Life is short.\nFeel free to share my page with anyone you think might be interested.\nReach me at datejackson@proton.me\nIf you have a date me doc, please link it to me as well!\nAlso, don’t forget to add your doc to the directory\nThanks for reading :)"
    },
    "scrapeTimestampDetail": "2025-11-27T16:37:20.442749+00:00",
    "id": "usr_5d1b9d55a6",
    "docAccessible": true
  },
  {
    "name": "Owen Murphy",
    "age": 24,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "Boston",
    "locationFlexibility": "None",
    "profileUrl": "https://comet-ironclad-32c.notion.site/Date-Me-Doc-27cf132b9a83808198dff313967f26c3",
    "lastUpdated": "2025-09-29",
    "profileDetails": {
      "fullText": "Skip to content\nDate Me Doc\nMade with\nDate Me Doc\nLast Updated Oct. 20, 2025\nBasic info\nName: Owen Murphy\nAge: 24\nPersonality: I usually get INTJ on Myers-Briggs, and I find descriptions like this one are fairly accurate to my impression of myself. I’m not socially anxious, but I can sometimes come across as a bit stoic and quiet since I don’t say much when I feel like I don’t have anything useful/interesting to contribute. Of course, if I’m with people I really click with, then I can quickly pick up speed with wordplay, puns, and general banter. Alternatively, if I get onto a topic I’m especially interested in, then I can also just go full lecture/professor mode and keep talking indefinitely (or as long as people are interested).\nAlso, as an aside: https://dynomight.net/in-defense-of-myers-briggs.html\nProfession: Software Developer\nLocation: Cambridge/Boston, MA\nOrientation: Hetero\nPolitics: Center-left\nPicture of me from the time I gave a presentation on Moral Uncertainty to the Berkeley Philosophy Forum\nALT\nI’m looking for a long-term relationship with a woman who\nShares my values, especially with respect to valuing honesty, truth-seeking, and compassion for others\nShares my interests, especially interest in self-improvement and in learning about ideas in philosophy, economics, math, computer science, and/or science in general from a somewhat skeptical/pragmatic perspective. Other shared interests in general nerd stuff would also be great\nIs someone I feel I can trust and be emotionally vulnerable with\nIs fun and funny enough to be my best friend\nIs in the approximate age range of 22-27\nIs nonreligious\nWould like to have kids in the future\nLess-basic info\nExercise\nFor exercise, I enjoy regularly working out (mostly calisthenics), going for runs in the local area, and playing pickleball with friends.\nHobbies\nMy most interesting hobby would probably be my blog/substack (https://ohmurphy.substack.com) where I write about ideas that I think are especially interesting and/or original. Topics tend to be economics-related, but occasionally I manage something math or computer science-related as well.\nIn addition to writing a blog, I also read a lot of blogs. I am currently subscribed to over 500 blogs on substack (only one paid though) and a few dozen more through RSS feeds. Obviously I don’t read most of them religiously (otherwise I would do little else), but I do still end up reading a fair number quite regularly. The content of the blogs varies, but they generally fit within the effective altruist/rationalist sphere or the academia/economics/statistics/math/software/data science/etc sphere.\nI occasionally manage to read a few academic nonfiction books. For example, see my semi-book review blog post on Who Gets What and Why: https://ohmurphy.substack.com/p/notes-on-reading-who-gets-what-and. However, these books tend to take a fair bit of focus and effort, so I don’t get through them very often.\nI love to read fiction, especially fantasy. The last few years, I have gotten somewhat hooked on reading webserials (often on royalroad.com). The result is that every few weeks I’ll end up spending a day or two just lying down and reading all the way through a new webserial I’ve come across until I reach the latest chapter. For example, on a recent weekend I started and reached the latest chapter of The Bell Tolls for Me. Since a few series I’ve read are still ongoing, I end up reading ~3-5 new chapters each week from webserials I’m caught up on. I also read non-webserial fantasy like the Stormlight Archive and the Dresden Files, but not as regularly.\nI like to play board games with friends, especially social deduction games. At the moment, I am a regular participant in local in-person games of Blood on the Clocktower (BotC), which is a game I particularly enjoy. In fact, I recently spent over ten hours straight playing BotC in-person and had a wonderful time.\nI used to listen to a lot of podcasts, but I’ve mostly replaced them with listening to substack posts. Now the main podcasts that I listen to are RPG ones like The Apocalypse Players, which is an extremely good Call of Cthulhu podcast. I do still listen to some others like The Studies Show though.\nRecently (in the last few months) I’ve joined the Fractal Boston community, where I have been attending weekly dinner parties and getting to regularly meet new and interesting people. I’m also hoping to join some of their community classes, once they start up again.\nThose are my more specific and consistent hobbies, but (of course) I also enjoy various other random activities, like watching videos and TV shows with others, playing through visual novels with friends while we voice the characters (I quite enjoy doing fun/silly voices), going out for a drink with friends, and just general walking/talking/hanging out.\nThere are also a few hobbies that I don’t currently engage in regularly, but that I’m looking to explore more in future. These include: dancing, singing, improv, and tabletop rpgs (I’ve played a few times, but not regularly).\nGeneral Media Interests\nA while ago I wrote up a list of entertainment that I enjoyed and posted it on my blog in case it would help me find new friends in Massachusetts (which I only recently moved to). I don’t think it is worth rewriting the whole thing here, so you can just look at it there instead: O.H. MurphyEntertainment/Media Recommendations​\nOne other item I did not include there, but which I have been quite enjoying are the ‘Seals are good’ channel’s youtube videos, which depict a hilarious alternate version of the star wars prequels that begins with “Anakin has a doctorate in Darth Plageius the Wise Studies” (playlist link) and quickly devolves from there in the best ways possible.\nContact Info\nIf, after reading this, you would like to get in touch, then please email me at ohmurphysf@gmail.com."
    },
    "scrapeTimestampDetail": "2025-11-27T16:39:01.754252+00:00",
    "id": "usr_db2dae94d0",
    "docAccessible": true
  },
  {
    "name": "Nathan Nguyen",
    "age": 32,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "NYC",
    "locationFlexibility": "Some",
    "profileUrl": "https://www.notion.so/Nathan-D-Nguyen-263ec25f8a5c80c58c96c643dfc621d8?source=copy_link",
    "lastUpdated": "2025-09-13",
    "profileDetails": {
      "fullText": "Skip to content\nYou’re almost there — sign up to start building in Notion today.\nSign up or login\nNathan D Nguyen\nShare\nNathan D Nguyen\nWho I am at the core: Intellectually curious, adventurous, deeply driven, and eager to make a positive difference in the world.\nLooking for a life-long partner to join me on the hunt for the answers to life’s biggest questions, like:\n\"What are the keys to a happy, fulfilling life?\"\n\"How can we do the most good in the world?\"\n\"Want to get coffee this weekend?\"\nIf you’re interested, the best way to contact me is to shoot me a DM on Instagram! (See link below)\nBio\nAge: 32 years old\nHeight: 5’4”\nLiving in Manhattan, NYC\n🏡\nMy hometown is St. Louis, MO.\nI moved to Rochester, NY for my undergraduate education and stayed for 11 years. I arrived in New York City in June 2024, and I’m loving it so far!\n🎓 Education:\nBA in Psychology (2016)\nBA in Philosophy (2016)\nBS in Brain & Cognitive Science (2016)\nMA in Psychology (2020)\nBS in Software Engineering (in progress)\n💼 Career\nResearch Analyst at Team Whistle\nI conduct research at a sports marketing company, helping businesses identify the videos that most resonate with audiences.\nwww.linkedin.com\nhttps://www.linkedin.com/in/nathan98000/\nI also plan to start a life-coaching business to help people build effective habits at work and at school.\n🌱 Family\n👨‍👩‍👧‍👦 I have one older sister, and I maintain a warm relationship with my parents.\nI don’t have any children. I love kids, but I don’t want any of my own. (Not necessarily a deal breaker though.)\nI’m ethnically Vietnamese, though culturally, I’m thoroughly Americanized.\n🫀 Relationship\nI’m looking for a serious long-term relationship, hopefully leading to marriage.\nI’m seeking a balanced partnership, where each person supports and pushes the other to grow and to become their best selves.\nThe person I’m searching for is probably: deeply curious about the world and passionate about something, is open-minded and tolerant of new ideas, has a playful, feminine energy and is ready to riff, is emotionally intelligent, and has a sense of direction in their life.\n💟\nLove Languages\nPhysical touch\nSharing fun facts about science and history\nPhysically, I’m most attracted to active, slender women who are shorter than me. But I’ll throw basically all my physical preferences out the window for someone with the right personality and character!\n🐦‍⬛ Values/Personality\nLove of learning\nAltruism\nMinimalism\nPlayfulness\n🧠 Big Five\nOpenness: 95\nConscientiousness: 80\nExtraversion: 77\nAgreeableness: 75\nNeuroticism: 3\n🌎 Religion/Politics\nI’m an atheist, not religious, and not spiritual. But open to dating anyone regardless of their religious beliefs.\nBooks that reflect my worldview\nI don’t identify with any political group, and I’m not politically active. My policy opinions cover a lot of different issues, but I tend to lean libertarian. Also open to dating anyone regardless of their political beliefs.\n🐕 Pets\nI have a 1.5-year-old Parson Russell Terrier named Scout. He’s the light of my life, and I spend the majority of my free time taking care of him in the mornings and evenings.\nIn the summers, he wakes me up as early as 6:00 am to go for a walk. I’m happy to continue taking care of Scout 100%, but it would be nice to have a partner who’s able to entertain him while I’m taking a nap in the afternoon sometimes!\n🧗 Interests/Talents\nRock climbing\nListening to podcasts, discussing, reading, and writing about philosophy and psychology\nWatching anime\nCooking\nPhotography\nJuggling\nFigure skating\n🎉 Fun Facts\nI’ve done the voice narration for three audiobooks:\nKnowledge, Reality, and Value\nUnderstanding Knowledge\nProgressive Myths\nI’m vegan-adjacent (it’s complicated)\nFreshman year of college, I won a cooking competition in my dorm by making Fettuccine Alfredo and muffins with Carolina Reaper powder. (That same year, I almost set the kitchen on fire while cooking some chicken.)\nSenior year of college, I won second place in a performance arts competition by performing magic\nI worked as a photographer for half a year, taking student yearbook photos. (A perk of dating me is that you’ll get lots of tasteful candids!)\nI once spent a month eating exclusively potatoes, for science!\n📱 Social Media\nNathan Nguyen (@NathanDNguyen) on X\nInterests in psychology and philosophy\nhttps://x.com/NathanDNguyen\nNathan Nguyen (@nathan98000)\nInstagram photos and videos\nhttps://www.instagram.com/nathan98000\n(Last updated: 9/2025)"
    },
    "scrapeTimestampDetail": "2025-11-27T16:40:43.072223+00:00",
    "id": "usr_a7a9bad78b",
    "docAccessible": true
  },
  {
    "name": "Roxanne Wiedemann",
    "age": 36,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "Canada ON",
    "locationFlexibility": "Some",
    "profileUrl": "https://www.notion.so/Hey-there-I-m-Roxanne-23f6d974e4b88022a65ce7130b8414b9?source=copy_link",
    "lastUpdated": "2025-07-29",
    "profileDetails": {
      "fullText": "Skip to content\nYou’re almost there — sign up to start building in Notion today.\nSign up or login\n☺️\nHey there! I’m Roxanne 👋\nShare\n☺️\nHey there! I’m Roxanne 👋\nImagine me in a bookstore or coffee shop, chatting with friends or next to a stack of books I want to read. That's me! You'll also see me line dancing, making this face (🥹♥️) at animals, spending time with my nieces, or planting seeds on my balcony to see what will grow.\n🔍 About me\nName: Roxanne\nAge: 36\nLocation: Niagara Falls, Ontario, Canada\nOccupation: Customer Support and Administration for Pro Church Tools\nWorldview/Beliefs: I’m a Christian and firmly have following the ways of Jesus Christ and attending church as foundations in my life.\nPersonality type: ENFJ/ENFP - depending on the day I take the online quiz 😅\n🔥 My passions\nMy Faith: I’m a passionate follower of Jesus Christ, and love talking about it! So much so that when I graduated high school I went to college for Christian Theology and graduated with a B.Th (graduated with honours).\nFamily: I’m a small town girl with a big family. I have four sisters, and a brother, and now have several nieces, with (I’m sure) more coming in the future. I’m close with my family and prioritize staying in touch and showing up for holidays and special events, as well as taking care of each other when we need it. It’s important to me that whoever I date recognizes and supports this priority, and I look forward to getting to know and love your family as well.\nLearning: I love learning new things - whether that’s through listening to podcasts, taking classes, or trying out new hobbies. (Some recent ones have been vocal lessons, figure skating, line dancing, and an acrylic painting class) 🤓\nReading: Give me a good story, a cozy corner, and a cup of coffee and I’m happy girl! Even better if it includes a rainy fall day, an oversized sweater, and a candle. 📚\nDancing: Catch me line dancing pretty much every week, and keeping wedding dance parties going long into the night. 💃🏻\nHaving A Good Sense of Humour (and being kind and generous) In All Circumstances : I get it - sometimes life sucks, things don’t go your way, and people can be the worst. But staying positive, kind, and having the ability to find the humour and laugh even in the midst of disappointment or frustration is important to me. If you’re able to balance taking serious things seriously with making jokes at the craziness of life, and facing each person you meet with generosity and kindness even when they’re frustrating you - then we’ll be a great fit. 😊\nNeed a wedding dance party date? I’m your girl!\n🕵️ What I am looking for\nSo far, Hermione is my ideal partner! (Look how cute she is 🥹😍)\nRelationship Goals: A husband 😋 I’m looking for someone who is looking for something serious. Someone who is wanting to build a relationship that will weather the highs and lows of life.\nIdeal Partner:\nSomeone who gives major golden retriever energy, who loves life, is outgoing (or at least doesn’t need to be babysat at social events) makes the best of every circumstance, and does so with thoughtfulness towards those around him.\nSomeone who loves God deeply and wants to reflect that love to the world around them.\nSomeone free spirited and adventurous with enough grounding to commit to a long term relationship with a toe-dipping girl like me. ♥️\n(Big bonus points if you smell nice and give life altering hugs)\nValues: Kindness, respectfulness, positivity, good sense of humour, ability to have fun, decorum, generosity, and passion for both loving God and loving the people around them. 🤗\n👀 Fun facts about me!\nFood: I, along with all of my biological siblings, have an autoimmune condition called Celiac Disease (a severe reaction to eating gluten). This means my life is strictly gluten free. Thankfully this can still be delicious, and I love trying out new gluten free recipes, and dream of mastering a gluten free loaf of bread. 🍞\nMusic: My music taste is wide ranging from musical scores (don’t even get me started on Titans Spirit from Remember the Titans!), pop country, jazz, alt rock, and 80s pop/retro pop. 🎶\nPets: two cats, Artemis and Hermione. I love them with my whole heart 😻\nHobbies: Reading, ice skating, line dancing, painting/sketching, neighbourhood strolls, and admiring a good sunset. (Oh, and going on passionate rants about how important in person relationships are, and how much being online has disrupted the goodness of life 😅)\n📱 Let’s connect\nInstagram: RoxyWiedemann\nTikTok: RoxyWiedemann\n💌 Rlwiedemann@live.ca"
    },
    "scrapeTimestampDetail": "2025-11-27T16:42:24.425601+00:00",
    "id": "usr_2d2e80e632",
    "docAccessible": true
  },
  {
    "name": "Panagiotis",
    "age": 24,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "Central Europe Norway",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://gorgeous-crown-b0b.notion.site/Hey-Panagiotis-here-21329cf3107080489687eeac53caf397?source=copy_link",
    "lastUpdated": "2025-06-16",
    "profileDetails": {
      "fullText": "Skip to content\n🧐\nHey! Panagiotis here\nGet Notion free\n🧐\nHey! Panagiotis here\nYes yes it is a weird name. It is the greek name for Saint Mary.(Fun fact my birthday and name day are on the same day). Currently on the last leg of my undergratuate journey. A year left to get my doctor licence! You might find me either with a book in hand and under trees and stars or you can hear my laugh while i am with friends\n🔍 About me\nName: Panagiotis\nAge: 24\nLocation: Athens(hopefully not for long)\nOccupation: Medical Professional,Poet\nBackground: Born Greek, yet I feel like a citizen of the world.\nPersonality type: ENFP,f unny, kind,t alkative and an idealist and a optimist person\nHow I am seen: The lifeline of the friend group, the most kind soul on earth, full of creativity and ideas.\n🔥 My passions\nReading and Writing: I live for literature and the deep conversations that it can create.\nVolunteering: Part of a handful of groups for helping the less fortunate with food or health.\nCooking: 🥦 Healthy, delicious meals are my thing.\nAdventure: 🦒 Life's an adventure, no? Whether it’s climbing mountains or diving deep into the ocean, I’m always ready for the next thrill\nMusic: I listen to music so much. Usually either poetry or rock.\nWeekend Getaways: 🛩️ Sometimes I open Skyscanner and book a random flight for the upcoming weekend. If you love this, we can be the best travel buddies!\nVenice,2024\nWhat I am looking for\nPresentation at a Medical Seminar! 😄\nRelationship Goals: Looking for the real deal. No one-night stands or short-term commitments.Someone who wants to share life’s big and small moments with me.\nIdeal Partner: An adventurous spirit, fun, kind, compassionate, open-minded with a passion for life\nValues: Integrity, honesty, and a big heart for personal growth and laughter. 🤗\n👀 Fun facts about me!\nLanguages: Fluent in Greek(ahhh), English. Learning Italian and Norwegian the past few years\nPoetry: I have already published some poems of mine and hopefully I can get my full collection published in my last year at uni.\nTravelling: I have travelled to all of Europe, with few exceptions, by train!\nHobbies: Cooking, Reading, Writing, Photography (😍), Teaching, Board Games\nFavourites: Winter, Chocolate,  My Personal Cookie Recipe, Hiking and mentally being a gentleman in the 1920s\n😎What is next?\nMore travelling and meeting new people\nFinishing medicine and starting a master's degree in the humanities or medicine\nMove to Northern Europe for a few years\n📱 Let’s connect\n💌 skyrimborn229@gmail.com(my non formal email…oppps..)"
    },
    "scrapeTimestampDetail": "2025-11-27T16:44:05.809720+00:00",
    "id": "usr_55a09b3eb6",
    "docAccessible": true
  },
  {
    "name": "Jarrett",
    "age": 35,
    "gender": "M",
    "interestedIn": [
      "F",
      "M",
      "NB"
    ],
    "location": "San Francisco Bay Area",
    "locationFlexibility": "None",
    "profileUrl": "https://datejarrett.notion.site/",
    "lastUpdated": "2025-05-26",
    "profileDetails": {
      "fullText": "Skip to content\nJarrett’s Date-me-doc\nGet Notion free\nJarrett’s Date-me-doc\nLast updated: June 2025\ntl;dr\n36 M, based in SF. Looking to build meaningful connections for polyamorous dating and community. Magnetic, warm, curious, playful, witty, and grounded.\nUsually wearing a smile.\nAbout me\nBasics\nAge: 36\nGender: Male\nLocation: San Francisco, CA\nHeight: 5’9”\nRelationship style: Polyamory/ENM\nOrientation: Bisexual\nWants kids: 85% no, has had a vasectomy\nClick here to contact me\nSummary\nI’m extroverted, energetic, and deeply curious—drawn to new ideas, intense conversations, and novel experiences. I believe you can decide what you want in life and take steps to create it.\nFor example, I once quit my job as an engineer, dropped out of a PhD, and bought a one-way ticket to Southeast Asia to build a business. Since then, I’ve settled in San Francisco and split my time between work, hobbies, and growing in weirdly wonderful communities.\nPeople tell me I’m someone they can call in a crisis. I stay grounded when things get messy and genuinely like helping others. If you care about personality types: I’m an ESTP, Enneagram 7w8, and Neutral Good.\nThanks for taking a look at my Date Me Doc. If you read this and feel a spark of curiosity, let’s talk!\nRelationships\nI’ve been in the ENM and kink scene since 2016. I am polyamorous and prefer kitchen table poly, where everyone can hang out together as they feel comfortable. I am currently dating a few people very casually.\nI’m looking for both primary and non-primary connections, where we can both be vulnerable, explore together, and collaborate on creating something unique between us. I love that every relationship brings something special to the table, and I don’t expect one person to meet every need.\nI have hesitations about dating someone who is brand new to polyamory and prefer that you have your own experiences to bring to the table, but I’m open to discussing this.\nKink\nI’m active in the Bay Area kink scene and regularly attend sex parties within my communities.\nI prefer partners with at least a baseline familiarity with kink or BDSM due to the level of communication it requires. I identify as a Dominant and connect best with partners who are submissive or switchy.\nHappy to talk more about this in person together.\nSomewhere in Sedona, AZ.\nFamily, Community, and Kids\nI grew up in rural South Carolina in a small family: parents and a brother who is 8 years older than me. I’m close with my parents and talk to them a few times a week. Despite growing up in SC, the Bay Area is my home. Any future moves would be to a similar or larger city.\nI’ve been in the Bay since 2021 and was lucky to find and grow with several amazing communities. In a group, I can equally enjoy being the person who inspires everyone into action or the one who quietly drives the car while everyone sleeps on a road trip.\nI’ve had a vasectomy and I am 85% certain I don’t want kids. I’d consider it under really unique circumstances, but if having kids is a core priority for you, I am probably not the right partner.\nTrying to keep my dad out of trouble while he tells the same joke to everyone in the grocery store.\nLifestyle, career, and hobbies\nI try to strike a balance between movement and rest (though I’m often not great at rest).\nWhen I’m active, I enjoy walking through the city, snowboarding, lifting weights, or training Brazilian Jiu-Jitsu. When I’m resting, I enjoy reading a Spanish novel in the park, journaling, creating music, or relaxing with friends.\nCareer-wise, I’ve built a really unusual path and enjoy aiming at something difficult or risky and finding ways to make it into a reality. I identify less with any one job and more with the idea that: hard work = way more options in life.\nI grew up playing guitar/bass in bands since age 16 and was once a professional touring musician. These days, I mostly lend my skills to campfires or house parties when requested. A few times a year, I get together with friends from across the country to go to electronic music festivals. If you have any interest, we’d love to have new people join us!\nYou can probably assume I haven’t seen a show or movie. I’ve got a few gems up my sleeve, and I’ll absolutely show up for your favorites—but I’ve been out of the loop since Game of Thrones ended.\nFind me just about anywhere: the city, the mountains, or the sea.\nAbout you\nWe might be a good fit if… (not all required)\nYou live in (or frequent) the Bay Area and are in the 25–45 range\nYou are non-monogamous and ideally have some experience with kink\nYou lean towards being warm, curious, and enjoy physical touch\nYou try to communicate well: express emotions, set boundaries, and handle conflict with care\nYou ski or snowboard\nYou lean towards being more of a morning person\nYou care deeply about something—your work, your hobbies, your community, etc\nYou try to take care of your body and mind in ways that feel good to you\nYou can be serious and silly\nSkydiving on my birthday, 10/10 would do again.\nTogether we could…\nBreak a sweat: hiking, a workout class, pilates, skiing, etc.\nBuild a playlist for our first road trip\nDiscuss the meaning of life or how to achieve world peace using memes\nSee who can make the other cry laughing first\nDance at a concert, then debrief over food and people-watching\nWander into an art gallery and pretend to be famous art critics\nSleep in, drink French press coffee, then compare our bucket list items\nCo-work across from each other and take strategic cuddle breaks\nLet’s volunteer together!\nThings that don’t work for me\nA monogamous relationship\nA communication style that takes several days to respond\nConsistently breaking plans without explanation\nYou’re deeply religious and want me to share in that\nConstantly avoiding hard or awkward conversations\nWhat’s it like to date me?\nHow I show up in relationships\nI’m a direct communicator who loves to learn and grow with others. I believe the best relationships are built intentionally–without shying away from hard conversations. I prefer regular check-ins so we can work through something early rather than let friction or resentment build in silence.\n💡\nFun facts: I run warm (great if you get cold), sleep like a rock, and have a strong grip for massages.\nI want to understand how you see the world or at least what you’re passionate about. I want us to co-create a relationship where we both feel chosen over and over again, and the cornerstone of our relationship will ideally be a strong friendship.\nIn addition, I value the fact that we both have our own lives. Whether we see each other all the time or once a month, you’ll have my full attention when we’re together.\nIt’s officially wedding and +1 season\nLove languages and romance\nThe ways I prefer to show and receive affection are very similar. I enjoy quality time, physical touch, and a steady stream of witty banter (plus the occasional bite). I love hyping up my partner and listening to your thoughts about the world.\nI’m not very big on traditional romantic gestures: giving or receiving fancy gifts, rose petals in a candlelit room, etc., but I’m working to broaden my horizons. For me, romance is about being intentional—learning what lights each other up and making sure we feel it.\nSocial settings\nYou should bring me as a +1 to your next event—I can blend in with friends, family, or coworkers and talk to anyone. I love getting into spontaneous conversations and seeing where we end up. You might think that’s from a decade of working in sales, but my parents will confirm that I’ve been a social butterfly since I was 6.\nI’m happy to stick by your side or let you do your thing while I explore the room. I don’t get separation anxiety. As long as we connect at some point, I’m good.\n🤝\nIf you get stuck in an awkward convo, I’m great at swooping in with a joke or a smooth exit.\nI am also aware that sometimes I can have too much energy for the situation. Just let me know and I am happy to regulate for the occasion.\nI don’t expect you to be big into sports, but they’re a great excuse to hang with (or make new) friends.\nHow I handle conflict and feedback\nI see conflict as an opportunity for growth, not a fight. We’re on the same team, trying to understand each other and figure out what needs to be seen. When things get tense, I stay calm and grounded so we can figure it out together.\nI don’t raise my voice during an argument. I’m not a stoic robot, but there are ways to express yourself while being respectful. I take feedback seriously, especially when it comes from a place of care. I want us to both feel comfortable sharing ways to grow.\nNaturally, I don’t weigh negative interactions as heavily as others might, so I won’t let a single bad moment define a person or a relationship. I default to assuming good intent and look at the whole picture rather than over-indexing on one issue.\nWhat are other people saying about me?\n❤️\n“Jarrett is magnetic, driven, and deeply curious! Someone who’s always reaching for more in life and invites you to do the same. Great fit for people who are ambitious, self-aware, and excited by growth and new experiences.\nIf you’re someone who coasts without much internal drive or avoids introspection, you’ll probably feel left behind. But if you love playful depth, thoughtful conversation, and someone who’s as invested in his own evolution as he is in yours, he’s an incredible person to share time with.”\n- Former primary partner\n⭐\n“Jarrett is like a golden retriever trapped in a man’s body. He is smart, kind, and gives slightly sadistic massages. If you’re kinky and/or a size queen, he’s got you covered. His worst feature is his insistence on living in SF instead of in Berkeley, but hey, nobody’s perfect.\nHe has multiple communities of friends, active hobbies, and also a great career. He has proven capable of excellent banter and custom memes. So many green flags!”\n- Regular play partner and friend\nMore reviews to come soon!\nLet’s get in touch\nIf you’ve read this far and are still curious, I’d love to hear from you.\nContact me by filling out this Google Form here."
    },
    "scrapeTimestampDetail": "2025-11-27T16:45:47.170881+00:00",
    "id": "usr_f1fa07879a",
    "docAccessible": true
  },
  {
    "name": "Pavitthra Pandurangan",
    "age": 26,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "NYC",
    "locationFlexibility": "Some",
    "profileUrl": "https://solid-helenium-175.notion.site/Date-me-Pavitthra-1fe42ee555c58027ad31ec162f4f7277?pvs=4",
    "lastUpdated": "2025-05-25",
    "profileDetails": {
      "fullText": "Skip to content\nDate me: Pav\nGet Notion free\nDate me: Pav\nI'm looking for a monogamous partner...\nYou are probably: curious about the world and passionate about something, ready to riff and quick to smile, kind, emotionally intelligent, reflective, and community-oriented ☀️\nAbout me\nI’m 26, 5’8”, based in Brooklyn, and I love living here. The city helps me indulge my (truly) endless interests, all while being surrounded by good people who inspire me. My next adventures (as of May 2025) include: hosting an AI hackathon, going to night court in Manhattan, and creating and hosting a multi-day retreat.\nHow I like to roll\nI looooove to learn new things. If I could create a clone of myself, my clone would spend all her days picking up new skills, reading (currently reading The Marvelous Clouds), and writing. I'm currently pretty fascinated by business and comedy.\nI like doing things that actively engage and energize me, or show me something new, like: reading in a park on a sunny day, watching a movie that I can discuss with people, cooking, learning dance choreo, or exploring a new neighborhood. I also enjoy my guilty pleasures: holiday movies on Netflix (lol) and iced lattes.\nI love my daily/weekly habits and I like to renew my mind, body, and soul regularly.\nI like to be challenged by travel: I want to live like the locals do, experience a radically different culture, and go on spontaneous excursions (but also I have nothing against beach vacays). I also just enjoy simple outings in new surroundings, like a local neighborhood I haven't seen yet.\nI love expressing myself through my style, and I think it's fun to develop my taste and aesthetics.\nYou can reach out to me at pavitthra.n.p@gmail.com! If you aren’t interested in me romantically but think we’d vibe as friends, feel free to shoot me a message 😊"
    },
    "scrapeTimestampDetail": "2025-11-27T16:47:28.471555+00:00",
    "id": "usr_2b3c84d078",
    "docAccessible": true
  },
  {
    "name": "Maria Marshakova",
    "age": 42,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "Dubai Georgia Norway Israel Spain",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://www.notion.so/My-page-for-DateMeDoc-1e384e493d9c80f587e3c37182b150f6",
    "lastUpdated": "2025-04-28",
    "profileDetails": {
      "fullText": "Skip to content\nAnyone with a Notion account can comment on this page.\nSign up or login to comment\nMasha’s DateMeDoc page\nShare\nMasha’s DateMeDoc page\n(is still edited. yes, “waterfall” is dead…)\nOk, guys, for the first, some pics, as we know “A man falls in love through his eyes”.\nIf you are still here after this act of vanity, lets turn to the writing part.\nMy friend Anya recommended me the DateMeDoc yesterday.\nI decided to follow the idea to find a life-partner from the proper audience.\nThats why I am here.\nI am Maria and my friends call me Masha.\nI love sports, travels, music, books and writing (asc). I absolutely adore computer science and technology, but I studied economics and accounting. I have another diploma in law (both from Russia) and I am thinking of getting MBA somewhere abroad.\nI have many other things I like (or liked) to do, like dancing, visiting theatre, walking and hiking, meeting friends and new people, deep talks, creating dj-sets, playing piano, making podcasts, writing stories and translation of lyrics (refer to Vladimir Mayakovsky “To Lilichka” and “Marusya took a poison”, there was something else in english) , planting flowers, studying, venture and startups meeting, etc.etc.\nI prefer not to say “I dream about” as I dont like to dream, I like to plan and do.\nMy favourite writers are: Amitav Ghosh, Tolstoy, Pushkin, Markes, Rushdi… I absolutely adore Amir Khusrau Dehlevi - this guy I would talk to (and I still hope to visit his memory place in Delhi). Non-fiction - Nikolay Gumilev with his theory of ethnogenesis.\nMusic is the sea, I love a lot from liquid funk to opera, its easier to say what I never listen: hard rock, simple pop-music, rap.\nFilms and TV-series: Troy, Polititian, Silicon Valley. No to thrillers and absolute no to horror movies.\nWhat else? I have never been married and dont have children (thats why), but I would like to create a family with a proper person, though its not my “do or die”. I support traditional values: children after marriage only and no divorce.\nReligion. I was born as an orthodox, but I studied all the religions trying to explore spirituality. I like 2 sayings of unnamed rebbaes:\nBorders of religions do not reach the God\nSome more facts about me:\nI have been living for about 6 months in Sri-Lanka in 2023. I would never stay there for so long as surfing did not work for me, but I started to study gemology there and I was thinking abount starting a gems business. Maybe I return to this idea, if I move to USA or Asia.\nI was involved in a start-ups (as a consultant) and venture activities during covid (I was an operational leader of Founders Institute in Moscow)\nI wrote my own podcasts talking to interesting people and discussing the ideas they follow and businesses they build\nI consulted people on their businesses development\nIf you ask me what is my astrology sign, I’ll ask you back which one you mean: the sun, the moon or stellium, etc. But I never read horoscopes as self-programming works better then them.\nI don’t like “transfer tourism” and banal routes. I prefer longer trips and immersion in local culture.\nI have never been to Americas  and China and some places of Europe.\nWhen I visit new cities, I go to museums, and historical sites, art galleries and try to see at least one movie with sublitles in the cinema.\nI don’t drive.\nBrief:\nCats or dogs - cats. Dogs are also nice, but I would prefer not to have animals at home.\nTea or coffe. Tea. I dont consider overcoffee healthy, but sometimes I use it as a treatment\nBack-end or Front-end. Back end. I prefer logic behind appearance.\nWhat I am waiting from my life partner:\nAppearance. I dont mind how exactly you look, I dont have any special appearance fetishes. But if you are sporty (I don’t mean a mountain of muscles - this is not what I want to hug) it increases the chances.\nСharacter traits. 3 features are  the must in my future man: he is generous, he is a family man, he loves me. Actually I cheated with generosity as it includes some other features like kindness and adulthood.\nIntelligence. Which is not just a diploma or PhD (I do not underestimate it, but I did not defend my own thesis after I wrote and pre-defended it, as I don’t mind papers, I mind knowledge).\nWhat is absolutely improper for me:\nAny kind of addiction. I can accept experiments, but I prefer wisdom and will\nTell me what book(s) or movie(s) or person/subject/idea  would you like to discuss, if  you decide to drop me a mail to profitometrika@gmail.com\nM\nMaria Marshakova\nApr 29 (edited)\nhere is me having fun being excited before my last vacation in March ‘25.\nAnd, for the beginning, I am:\n- INTP\n- russian\n- 42 y.o. Idk why I look younger. Maybe I am a witch.\n… more\nM\nMaria Marshakova\nApr 29 (edited)\nhere is me on a photoshoot some years ago during covid, exhausted and semi-dieing a month before\nM\nMaria Marshakova\nApr 29 (edited)\nSome old photoshoot for my designer friend who sewed this costume. I have got about 5-7 kilos in proper places since that. Maybe this is the root cause of the magic as now I feel happier.\nM\nMaria Marshakova\nApr 29 (edited)\nserious me for Linkedin. I used to work as an internal auditor for that time for Chubb and Societe Generale. I am a fullstack analyst in fintech for about 2 years already.\nM\nMaria Marshakova\nApr 29 (edited)\nfaraway trip to Tunisia and Sahara. Made in Carthage.\nM\nMaria Marshakova\nApr 29\nJust a nicey me and my favourite Paris sunglasses\nM\nMaria Marshakova\nApr 29 (edited)\nrollerblading pic. I dont do it anymore. Yet I felt down from a bicycle last week, still cant see any wheel.\nRebecca Turner\nJun 6\nPERIOD LADY!!!!!!\nM\nMaria Marshakova\nApr 29\nits a trips plan"
    },
    "scrapeTimestampDetail": "2025-11-27T16:49:09.875230+00:00",
    "id": "usr_2b2bbb68f8",
    "docAccessible": true
  },
  {
    "name": "Kendra",
    "age": 37,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "Paris, France",
    "locationFlexibility": "Some",
    "profileUrl": "https://kaput-cycle-add.notion.site/Dating-Kendra-1c6f39a9767880baa5b6ec5d07f0086d",
    "lastUpdated": "2025-03-30",
    "profileDetails": {
      "fullText": "Skip to content\nNew page\nGet Notion free\nI am no longer seeking a partner.\nWishing you all the best with your dating journey!"
    },
    "scrapeTimestampDetail": "2025-11-27T16:50:51.192697+00:00",
    "id": "usr_c83c3cd09e",
    "docAccessible": true
  },
  {
    "name": "Mairead",
    "age": 37,
    "gender": "F",
    "interestedIn": [
      "F",
      "M",
      "NB"
    ],
    "location": "North America",
    "locationFlexibility": "Some",
    "profileUrl": "https://scarce-gem-bd7.notion.site/Mairead-s-Date-Me-Doc-166935b3efb980c9847ef01eb4f3a54e",
    "lastUpdated": "2025-02-03",
    "profileDetails": {
      "fullText": "Skip to content\n🌻\nMairead’s Date Me Doc\nGet Notion free\n🌻\nMairead’s Date Me Doc\nWelcome! My name is Mairead (rhymes with “parade”), pronouns she/her.\nThe Basics\nI live in Vermont (northeastern USA); I travel a lot.\nI’m in my late 30s and do not have or intend to have children.\nI’m bisexual, polyamorous & married.\nMy spouse and I date separately & fully support each other’s autonomy in developing other relationships.\nI speak EN/中文/ES/FR\nWhat I Am Looking For & Open To:\nAnywhere in the world:\nComet-style connections  ☄️ where we meet up when our paths cross & simply enjoy our time together, keeping in touch periodically in between\nLocally (Vermont, Montreal, Boston):\nSerious or serious-ish non-exclusive relationship(s) off of the relationship escalator involving mutual sexual & romantic enthusiasm, consistent quality time together, commitment to working through challenges, and mutual emotional & logistical support\nWhat I’m Not Looking For\nFull-time cohabitation ✖️\nConnections mostly or entirely based on sex ✖️\nParenting or co-parenting children ✖️\nMarriage ✖️\nMonogamy ✖️\nAbout Me\nI’ve been described as “intense” by many people near and dear to me. I am extraverted — when I am feeling down, the main way I get back to baseline is seeking out social connection. In the past, I have been very organized and goal-driven, but since the pandemic and a couple of job changes, I’ve found this is not as important to me as it once was. I’m now learning to take more pleasure in the process of life rather than focusing on outcomes.\nFor people who are into such things, I’m an ENFJ, a Taurus 🐮, and was born in the year of the rabbit 🐰.\nThings I Like to Do\nEnjoying food & drink at a leisurely pace in the company of others\nBeing active: Running, biking, hiking, swimming, xc skiing, triathlons, dancing\nReading (Favorite book: The Paper Menagerie and Other Stories by Ken Liu)\nLearning (and teaching) languages\nTrying new things I’m bad at\nPlaying the bass guitar (see above)\nExploring somewhere new on foot\nOrganizing themed parties, weekend getaways, friend trips, etc.\nWasting time on Reddit rabbit holes and Wiki walks\nMy Favorite Places (besides my beloved Vermont)\nTaiwan\nThe Basque Country (Hegoalde aka Spain side)\nQuebec\nThings I Find Attractive\nIntellectual passions\nA high level of intensity about one or more hobbies\nPhysical fitness & enjoyment of physical activity\nFeeling at home in more than one language & culture\nFeminist values\nBeing in therapy\nGood communication skills & empathy for others\nDeal Breakers\nRegular tobacco / nicotine use\nLibertarian politics\nSocial conservatism\nCurrent employment in law enforcement or the military\nInterested in connecting?\nSend me an email at firstdate dot mairead at gmail dot com. :)\nPlease tell me where you live, why you choose non monogamy, why you chose to reach out, and anything else about yourself you want to share.\nFunky wine in Madrid\nPit stop on a 9-day bike tour around Taiwan\nNYE in Puerto Rico ft. Shorts tan"
    },
    "scrapeTimestampDetail": "2025-11-27T16:52:32.527356+00:00",
    "id": "usr_ad37c5c484",
    "docAccessible": true
  },
  {
    "name": "Tanner Godarzi",
    "age": 32,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "San Francisco Bay Area",
    "locationFlexibility": "None",
    "profileUrl": "https://tannergodarzi.notion.site/dating-tanner",
    "lastUpdated": "2025-01-28",
    "profileDetails": {
      "fullText": "Skip to content\n💘\nDating Tanner\nGet Notion free\n💘\nDating Tanner\nHi, I’m Tanner — a curious, beard-bearing San Franciscan who loves laughter and adventure. Hoping more cute than cutting edge in a virtual “we bumped into each other in an electronic version of a cafe” sort of way. I laugh a lot, am usually dressed for an afternoon of relaxing and focus on goals and personal growth.\n💘 Shoot Your Shot?\nMessage me your favorite fun fact and let’s compare notes\n😊\nLet's talk\nor tanner.godarzi@gmail.com\n🤠 Dating Me Is Like\nHave you ever thought “I wish I could find a man with a great beard who makes me laugh, is emotionally self aware, resilient, knows how to communicate, has a zest for life and adventure then very conveniently lives in a delightful neighborhood that’s iconic of San Francisco” Just your luck - it’s me!\nAlways laughing and having a hearty time. I’ve been described as the connective, gooey tissue that brings people together (thanks?). Carrying a camera (sometimes film) to document my life and occasionally bumping into friends along the way. Continuously discovering and rabbit holing from urban planning’s effect on social interaction and familial development to Arabian pirates of the 17th century.\nWhat I’m into:\nExploring The Bay through photo walks, new restaurants, and hikes\nStaying centered with meditation, yoga, and reading\nWriting short reflections (and sometimes long rabbit holes)\nSharing adventures outdoors with people who appreciate curiosity and play\nI’m thankful to have a prosperous career in tech making a positive impact of people’s lives while setting myself and my family for long term success. I care deeply about the direct my moral compass points aiming to do the most good for people possible. Currently I’m at Vercel, doing just that, on Brand Marketing with a crew of adventurous and humble folks.\nThe full history is at my LinkedIn should you care to indulge.\n🍟 What My Friends Would Say About Me\n⭐ Jack “Convivial with refined tastes, strong loyalty, and great taste in memes”\n⭐ Tymn “He can’t be described in one sentence”\n⭐ Ala \"He's a sincerely nice guy, very social, who loves travel, metal music, and going down the rabbit hole on niche topics like cults and city planning.”\n⭐ Wheels “Tanner is like a cosmic gumbo. Smooth, nutritious, surprising, and a real treat.”\nAsk me about my cool friends\nALT\n💘  Shoot Your Shot?\n😊\nLet's talk\nor tanner.godarzi@gmail.com\n🤔 Some Basics About Me\nName: Tanner Godarzi (you can also call me Tan)\nAge: 33\nLocation: San Francisco, CA 🌁\nBackground: Half Persian and the greatest hits of Europe mixed in with some Spanish zest\nPersonality type: Extroverted with friends, contemplative and meditative elsewhere\nWork: Currently at Vercel building vercel.com. Previously, Engineering for Brand and Marketing at Notion (how meta)\nMusical tastes? Anything poolside at the Ace Hotel in Palm Springs to driving industrial beats like Nine Inch Nails, cinematic and expansive scores from Godspeed You! Black Emperor to nostalgic hipster indulgences in Arcade Fire.\nInfluences? Many, but I consider Anthony Bourdain, Trent Reznor and Alex Calderwood as my heroes well. I’m huge fans of my friends and draw inspiration from the community I live in.\nAll things media? I prefer my news to come from strange visions in my dreams sandwiched between Ken Layne of Desert Oracle and financial news from Bloomberg. Otherwise, occasional art house film or 4 hour Youtube explainer on a mundane topic.\nWhat else? A mystery to continuously unravel over a glass of wine\n⭐ My Values\nI deeply value for myself and people I surround myself with a sense of community and curiosity about the world. Balancing sensitivity with durability. Finding moments of meditation for inner peace during the weird times we find ourselves in. Finding as much joy exploring far flung places like an out of the way cheese in Antibes as I would an unexpected run-in with a friend in the city.\nKindness carries the day. Let’s prove the doubters wrong.\n🔭 Who I’m Looking For\nSomeone intrigued to make it this far! I’m looking for someone to go on coffee dates and my soulmate — is that too much to ask?\nConcretely, I’m interested in women in my age group (Millenials) in San Francisco. But don’t let that dissuade you! I’d love to hear from you if you’re outside The Bay or on the cusp of the generation. I’m interested in a long term relationship and infinitely excited about the idea of kids with someone who’s health forward, ambitious and caring.\n💃🏻 Date Ideas\nFilm camera photo walk through San Francisco\nA deep game of We Are Not Really Strangers\nWine bar hopping\nHaha, what if we spent a weekend in Palm Springs\n🌐 Where I’m At On The Internet\nInstagram (@tannergodarzi)​\nTanner GodarziTanner Godarzi​\nTanner GodarziSo, You Want To Throw A Dinner Party​\nDinner With Friends​\nHowdy, I'm Tanner — a real person on the internet.​\nwww.linkedin.com​\n🏹\nShoot Your Shot\nName\nSocial Profile (Instagram etc)\nPhone\nEmail\nTell me a bit about you\nSubmit\nNever submit sensitive personal information, like passwords, through Notion Forms.\nReport abuse"
    },
    "scrapeTimestampDetail": "2025-11-27T16:54:13.843658+00:00",
    "id": "usr_dee75989a8",
    "docAccessible": true
  },
  {
    "name": "Emily",
    "age": 24,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "DC North America Flexible",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://island-hoof-257.notion.site/Emily-s-Connection-Doc-267de24c51dc803c98d9c7bb03406dce?source=copy_link",
    "lastUpdated": "2025-01-20",
    "profileDetails": {
      "fullText": "Skip to content\nemily’s date-me doc 💌\nGet Notion free\nemily’s date-me doc 💌\ncurious, intense, playful, do-gooder\nabout me\nHi! I’m Emily, a 24-year-old woman looking for a monogamous male life partner. I live near Philadelphia, but am not settled yet.\nI center my life around close relationships and doing good for the world. My brain works in optimizey ways, but I also trust intuition, feel deeply, and love being playful.\nWhat’s noticeable about me in relationships is that I’m an intense person! I naturally go all in and move fast when aligned with something. I feel profoundly grateful to be alive, so I try to live with maximum agency.\nMy lifestyle is minimalist and utility based (though not robotic-y!), and this leads me to be very open-minded about how to get things done. I adore unconventional ideas (e.g. I sleep in a sleeping bag on the floor with no pillow), and highly value authenticity and creativity.\nUltimately, my favorite moments are the mundane moments just being present, especially with close friends. And I love when the people in my life balance me to be more spontaneous, accepting, and joyful for the sake of being joyful.\nwhat i’m doing with my life\nI’m concerned about existential risks like climate change and potentially AI. I’m especially concerned the US is heading towards authoritarianism and won’t be able to address these problems. To help, I travel across the country to win key elections and protect democracy. I love my job, though it requires a nomadic lifestyle. I’d consider finding a different job to make logistics work with my life partner.\nWhen I’m not working, I spend time in nature (I thru-hiked the Appalachian Trail three years ago!), talk with friends and build community, read, journal, and experiment with life!\nwhat i’m looking for\nA transcendent kind of love. A best friend. Someone who feels warm and like home. I find my deepest friendships make me not fear death, so maybe something like that…\nOn a practical note, it’s challenging to know what makes people click! So err on the side of reaching out. :)\nsome logistics\nplease reach out!\nLife’s short, please take the chance! I made this because I want to be contacted! Let’s set up a low-stakes phone call and see if we vibe. :)\n💌\nMessage Me Here\nBounty: I’ll give $1,234 to the person who introduces me to my husband.\nBut- What if you’re my husband?\nhaha jk…\nunless…? 😳"
    },
    "scrapeTimestampDetail": "2025-11-27T16:55:55.249656+00:00",
    "id": "usr_3f5b9628fc",
    "docAccessible": true
  },
  {
    "name": "George",
    "age": 34,
    "gender": "M",
    "interestedIn": [
      "F",
      "NB"
    ],
    "location": "Flexible",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://shy-jam-24f.notion.site/George-s-Date-Me-Document-178b037fd79d807aac13e4144ea83eb7",
    "lastUpdated": "2025-01-12",
    "profileDetails": {
      "fullText": "Skip to content\n🧘‍♂️\nGeorge’s Date-Me Document\nGet Notion free\n🧘‍♂️\nGeorge’s Date-Me Document\nRetired future poker player, current nomadic uncle, aspiring intentional live-r.\nIn an even earlier lifetime, I was a data scientist and quit my corporate job to play poker. But then, I realized all I did was swap my corporate treadmill for a competitive-gaming exercise bike, and that I hadn't actually solved the incongruence of driving to the gym and taking the elevator to get on an exercise machine to work off all the processed foods I stress ate. So now, I’m walking outside instead, constantly checking how much longer it’ll be until I’ve reached my step goal for the day.\n(To be clear, this is all strictly a metaphor. I've never actually been motivated to consistently go to the gym; I have a very high metabolism that tricked me into thinking I was healthy when I wasn't. Also, my metaphors may need work. Help me please?)\n🔍 About Me\nName: George\nAge: 35\nHeight: 5’8\nLocation: Nomadic (with a temporary home base in the SF Bay Area)\nOccupation: Funemployed explorer (aka whatever I want)\nReligion: Agnostic but closer to spiritual\nI quit my corporate job in 2019 and spent the next few years studying (running programs / developing strategies / memorizing decision trees) and playing poker because I wanted to see how good I could be at something that more matched my skillsets. At the same time, after becoming aware to how much my achievement mindset had driven my life for so long and how I no longer wanted that, I’ve decided that poker will likely just be a way for me to offset costs going forward and not the primary focus of my life. So I've become interested in traveling (seeing the world, meeting cool people, having new experiences), and I was on an extended roadtrip for almost 2 years across the US (primarily through National Parks and secondarily through art museums—yes, my header picture is from Chihuli in Seattle). More recently, I was in Peru for a month and LOVED it, and I’m currently embarking on a Europe⇒Africa⇒SE Asia cruise.\nLonger term, I know that I'll likely want to be geographically flexible or nomadic. I'm not sure for how long I'll want to travel or if I eventually want to establish a more permanent home (forming a community of likeminded people does interest me intellectually). I'll very likely be interested in having children at some point, because I find children to be wonderful learning beings and I'd like to help with and be a part of that process, but as I've learned over the years, I never truly know what future George wants. No matter how convinced I am at any moment that past George was wrong but NOW present George is completely right, I know it's all a trick. I think.\n🕵️ What I Am Looking For\nRelationship Goals:\nOpen to both monogamy and nonmonogamy: I’ve traditionally only been in monogamous romantic relationships but I’ve grown to appreciate the nonduality of relationships (i.e. a spectrum from acquaintances to more platonic friendships to primary life partner) and realize that our love isn’t finite. Ultimately, I do expect to be monogamish (if not monogamous), as my energy and interests tend to hyperfixate more than those of most polyamorous people do\nChildren: Yes please! And hopefully more than 1 (I was an only child)! I ultimately would like to be a stay-at-home parent and would be thrilled if my partner would want to as well, especially for the early years of the children’s lives\nPlatonic connections: open and excited about connecting with people even if it doesn’t lead to “my one true soulmate” (/whatever the nonmonogamous version of that is)\nIdeal Partner:\nMore motivated by her own desires than those of other people and of society\nChaotic good: rules are only guidelines and I’d hope that kindness and care for other beings trumps all. But also, some such guidelines hopefully are more important than others (i.e. radical honesty with each other and with our children is near the top)\nAdventurous: more inspired by new experiences than by comfortable routines\nNeverending mutual teasing (including of ourselves). For example, my college application essay was about the tribulations of growing up short (I was robbed of a storied NBA career by these struggles)\nToni Stark (if she exists) is my ideal\nVery ADHD conversations: as you can probably already tell by my liberal use of parentheses, I get distracted easily in my writing, and I can confirm that conversing with me is a similarly disjointed experience\nValues:\nCuriosity and open-mindedness: relatedly, an understanding that the absence of evidence does not mean the evidence of absence\nAuthenticity and honesty (both with oneself and with other people)\nPlatinum Rule >>> Golden Rule: Treat others the way THEY would like to be treated. Abiding by the Golden Rule places your expectations onto other people, and that's a common source of conflict in society\n💭 I Spend a Lot of Time Thinking About\nThe balance between self-acceptance and self-improvement\nThe Dunning–Kruger effect and, in particular, how it applies to understanding myself\nParenting and education: I have extremely contrarian views on these topics, ranging from wanting many humans of varying ages contributing to childcare (so not just a nuclear family, and definitely not just a nanny while the parents are obsessing over their careers) to believing that traditional schooling is a huge misprioritization of what’s actually important for kids to learn\nEnergy work, spirituality, healing, plant medicine, and altered states of consciousness—and how they all are interconnected for me\nThe Midwit Meme: One of the most helpful developments growing up weird has been the realization that the modal (/most popular) opinion is by definition not the most informed one\nUnderstanding my edge: This isn't meant at all in a cut-throat competitive manner, but it's more like, if I have a disagreement with an opinion, I'll want to identify why my opinion has merit, what other people are missing, etc. Usually, this means I'll default to those who I think know more than me and not deviate much from these priors based on my own limited experiences, but sometimes, this means I'll have extremely contrarian opinions. (See my poorly executed exercise analogy as an example)\nMisaligned incentives: For example, the healthcare industry (and in particular, big pharma) doesn't get paid for treating diseases; they get paid for managing the symptoms. Understanding this is essential to understanding the difference between lifespan and healthspan\nThe many different ways society perpetuates the status of the American aristocracy and how money in politics takes power away from the people\nHow oftentimes (especially after thinking about the prior two points), I just want to leave society and live on a farm with the important people in my life\nThe teachings of Thomas Bayes, William of Ockham, and Robert J. Hanlon: For example, it's extremely probable Epstein didn't kill himself\n🔥 Favorites\nHobbies 🛶:  deep conversations about anything; being out in nature (especially activities that involves boat-like apparatuses because I don't exactly float in the water); basketball; board/card games\nBooks 📚:  Anxious People; My Grandmother Asked Me to Tell You She's Sorry; Civilized to Death; Sex at Dawn; Antifragile; The Black Swan; The Scout Mindset; The Biggest Bluff; The Untethered Soul; The Highly Sensitive Person; Nonviolent Communication\nTV Shows 📺:  The Good Place; Crazy Ex-Girlfriend; Sex Education; Unbreakable Kimmy Schmidt; Atypical; As We See It; Modern Love; Ted Lasso; Strange Planet (basically anything that makes me both laugh and cry, although it's not difficult to do either)\nFood 😋: All of it but especially sushi. One of my in-progress goals is to eat less meat (and probably animal products in general), but giving up seafood would be the most difficult part\nBoard/card games 🃏: Codenames. It's accessible for non board-game-fanatics and quick enough to not be a multi-hour ordeal. Historically, I've been extremely into more complex strategy games (i.e. Agricola), but my enthusiasm for repetitively grinding these games to try to perfect a strategy has definitely waned. Besides, is there a hunter-gatherer version of Agricola? Accumulating resources in an attempt to grow indefinitely just doesn't get me going like it used to…\nI love all water activities\nBest show ever!\nFind someone who looks at you like…\n👀 Fun (no, really!) Facts About Me!\nI'm passionate about learning in general (especially about how/what/why people think) but am even more passionate about sharing everything I learn with other people (but having to tone it down because no, my friends don't always want to read 500-word essays on obscure niche topics, since no one is as excited about the brain's default mode network, the viability of gift economies, or basketball analytics as me. But in the one-in-a-million chance that you are... you know what to do...)\nI both practice time-restricted eating (usually a 6-7 hour window) and eat 60+ pieces of sushi at AYCE sushi. I’m looking to do a longer fast at some point, but that calling hasn't arrived just yet\nI love sharing stories, but I'm also an especially confusing story-teller. There's often really no logical/linear order to my tales. In addition, my sentences will often have way too many clauses, because I get distracted way too easily while simultaneously maintaining the desire to finish my original thought\nI once memorized 75 digits of Pi in 1 week during a high school math class simply because I was bored (and the 75 digits were taped to the wall), and I could probably still do it now if I were given an hour to prepare. On the other hand, if I get introduced to more than 1 person at a time at a social gathering, I won't be able to remember a single name. I've been known to refer to people by descriptors until it becomes too cumbersome to say \"my friend's sister's boyfriend\" repeatedly in a story. Especially if he also has a sister.\nOne could probably play bingo with the catch phrases I routinely utilize. Some of the words one might include on said bingo card: “incentivized”, “societal”, “status goals”, “evolved”, “midwit”, “right-tailed”/”left-tailed”, “zero-sum”, “subconsciously”, “threshold”, “confidence-level”, “update [one's] priors”.\n📱 Let’s Connect\n💌 georgesdatemedoc@gmail.com"
    },
    "scrapeTimestampDetail": "2025-11-27T16:57:36.608280+00:00",
    "id": "usr_7bea345c09",
    "docAccessible": true
  },
  {
    "name": "swyx",
    "age": 38,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "San Francisco Bay Area NYC Los Angeles Flexible Asia",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://swyx.notion.site/dateme",
    "lastUpdated": "2025-01-02",
    "profileDetails": {
      "fullText": "Skip to content\nswyx’s Dateme\nGet Notion free\nswyx’s Dateme\nlast update: Jan 2025!\nHi! I’m Shawn and I dislike dating apps but want to take relationships seriously… so here’s my attempt at opting out of the system! Here’s the basic “what everyone asks” from dating apps:\n38yo Singaporean Chinese, 5’ 7.5’’ (171cm)\nLive in San Francisco/often in Singapore (but open to travel/moving to other major cities)\nnever married/no kids (want 26-40yo woman to marry and have kids)\ntechie (but not 100% techbro tho I was an engineer and do have a podcast and do some angel investing, don’t worry none of my exes have ever cared about that stuff haha)\nsinger (I’ve been in musicals, acapella, tiktok, teeny bit of guitar and violin. When I’m home there should always be something playing on the speakers, no exceptions!)\nwriter (people like my blog and book and short stories and newsletter and communities)\nfriendly, ambitious nerd (I sometimes run giant meetups and conferences)\nObsessions: Dropout.tv, Coupling, bouldering, runs with friends, Deep Work, Discworld, Powerful movies, good podcasts. Have had both dogs and cats but don’t currently have any, would love to\nMottos: Intentionality, Intensity, Integrity. Learning in Public. Playing Long Term Games.\nNot very religious but raised in Buddhist tradition, generally think souls and karma are real\nSocial drinker, never smoked, regular exercise\nObligatory Photo Wall\nAbout\nThe basic non-professional about page/linkedin gist is that I’ve grown up constantly straddling two worlds:\nspending half my life in Singapore and the other half in the US;\nspending half my career in finance (Wharton→UChicago→options trader→hedge fund) and then pivoting to tech for the second half (Two Sigma, AWS, 3 unicorn startups)\nbeing both very online and yet loving building IRL community.\nThe plus is I adapt/fit in easily, the downside is I have switched countries, cities, and social circles so much that my personal/social life isn’t where I want it to be — 3 serious relationships but always cut short basically by long distance due to work stuff. I think those days are done and I’ve “found my thing”, and am in a place where I want to seriously work towards being a life partner to someone who’s also ready for that!\nI get shy writing about myself but I’m forcing myself to in this new year so here are some other dating profile notes:\nValues: Commitment, Connection, Honesty, Vulnerability, Communication\nPersonality: Authentic, Empathetic, Passionate, Smart, Sociable\nInterests: Climbing, Running, Tennis, Music, Podcasts, Karaoke, traveling for friends instead of museums, Great TV/movie writing\nOther fun facts:\nI cut my own hair! Have done since Covid\nI used to make mixtapes that probably reveal way too much about my random interests\nsuper random but I won a contest for #1 Joss Stone fan in 2006 haha\nthe Cuba thing on my GitHub is real\nWhat I’m looking for\nI’m a very open minded person so this section is hard to write, because to some extent I believe that life has a way of challenging what you think you know about yourself. But literally every female friend insisted I write this down so here you go. Just know that basically none of these are hard requirements.\nDo I have a type?\nPhysically: Genuinely attracted to all races, and a wide range of body types, but yes historically have mostly dated Asian girls\nPersonality: Trustworthy, Funny, Low drama, Easy going, Spontaneous, Responsible. Smart-but-it’s-not-your-entire-identity. Tenacity, Grittiness, Creativity is hot as hell!\nGiant pluses:\nMusician - Singer, Pianist, Arranger/Composer, anything. We will make all the music!\nCareer in Healthcare/Law/traditional businesses - I gotchu on finance/tech (but finance/tech is cool too of course) but it’d be nice to balance that out\nzero issues with you making more than me if thats still a thing people get hung up on\nbut i’ll give you a run for your money :)\nWriter - the easiest tell of a beautiful mind. could fall in love just with good writing.\nCooking - I would LOVE to be your sous chef\nDancer - Mama said I was a dancer before I was born. I used to once, I don’t anymore; would love to get back into it without doing the creepy do-dance-classes-to-find-dates thing that so many guys seem to do?\nDog/Cat mom - I have lived with both, don’t currently have my own, pets are great\nBetter memory/aesthetic sense than me? :)\nProbable no’s:\nVery actively religious/political - I don’t mind it but you’ll be unhappy w my disinterest\nDefault sarcastic/cynical - I lean earnestcringe\nAuthoritarian/Statist - I value individual freedom/liberty with limits, dislike govt overreach\nCrypto/web3 - I’m not anti-crypto, but have been quite turned off by vapid vibey crypto girls. iykyk.\nOpen to living at least part time in Singapore - I do want spend time with my parents and amazing incredible sister who someday I hope you have the fortune to know as well as I do.\nhit me up!\nif you’re pickin’ up what i’m puttin’ down, find me on text or twitter or email! I like “can’t lose” first dates - a walk/hike, farmer’s market, dog rescue cuddles! Coffee is good tho I’m 99% a tea guy.\nSw yx\nJan 1\npreloved kids very welcome\nShow 1 reply\nSw yx\nJan 1\nplural kids: I waited 12 years for my sister and she is one of the best things in my life and everyone should have a sister, sisters are the best\n… more\nSw yx\nJan 1 (edited)\ndefinitely some % techbro but also have more writerbro/musicbro/community builder/financebro in me than traditional techbro\nSw yx\nJan 2 (edited)\nat least one endgame relationship has resulted from this and some day it’d be nice if it were my turn?\nSw yx\nJan 1\nI’ll be upfront that I value this but am not great at it and want to be better\nSw yx\nJan 1\naka “vibes” - the cliche is that we can be “alone together”\nSw yx\nJan 1\nyes, i’m a Taurus, people do ask so"
    },
    "scrapeTimestampDetail": "2025-11-27T16:59:18.011533+00:00",
    "id": "usr_23903e6cac",
    "docAccessible": true
  },
  {
    "name": "Jose Luis Ricon",
    "age": 32,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "San Francisco Bay Area",
    "locationFlexibility": "None",
    "profileUrl": "https://jlricon.notion.site/Date-Jos-152b4a20459b8066ac87e3ec08a17dd8?pvs=4",
    "lastUpdated": "2024-12-26",
    "profileDetails": {
      "fullText": "Skip to content\n❤️\nDate José\nGet Notion free\n❤️\nDate José\nI am looking for someone to date and eventually marry!\nUltimately finding someone is very simple: It’s just about being mutually attracted and excited about the possibility of building a life together (though you can also reach out for a less intense relationship!). The core requirements for that are:\nWe must be good communicators (Which in turn requires emotional competency, self-awareness, kindness, curiosity, and intelligence)\nWe must be mutually attracted (I’m straight)\nAnd we must vibe\nI hope you can judge communication from my writings and the kinds of things I do; attraction from my pictures. The vibe has to be experienced but unlike pictures, that doesn’t scale. So this document tries to convey my vibe through an explanation of my values, my life, and some anecdotes.\nMe on the internet\nShow; don’t tell, as they say:\nTwitterJosé Luis Ricón Fernández de la Puente (@ArtirKel) on X​\nInstagram (@jlriconf)​\nJose Luis RiconNintil​\nAbout me\nI was born in Spain (Madrid) in 1992, then grew up in the Canary Islands to a height of 5’10’’. Eventually I went to college for too long, earning two masters degrees in mechanical engineering and aerospace dynamics.\nMy early career ambitions of doing actual rocket science got derailed by Life, and ended up in a series of jobs that started in the shop floor of an electric car company, an ended up in my current role as Head of Theory at Retro Biosciences. In between I worked at an AI startup that got acquired by Twitter and was offered a job to blog on the internet for 2 years by a bay area benefactor, which also got me my first O1 visa to come to the US. I’ve been a resident of San Francisco for 4 years and intend to continue residing in the Bay Area for the foreseeable future.\nThis is indeed my official pic from work, see it at retro.bio/team\nALT\nTo some people I’m most known as the blogger behind nintil.com, where I’ve written about all sorts of things for over a decade, from the economic history of the USSR to Alzheimer’s Disease to technological progress and metascience to AI risk. If my current life arc goes well, my next proudest achievement will be to have made a meaningful dent on human aging.\nValues\nWhat makes a person them? One could gesture at memories, the way they look, the things they like. Maybe people don’t really exist, if one has ripped deep from the Parfitian bong. I find some truth to the idea that people are to some extent their values. I definitely think so for myself: I identify with my values, the most stable part of who I am. What do you care about? How do you behave in the world? Here are my own\nTruth-seeking: I want to understand the world and those around me, including myself. This is probably the first value I ever consciously endorsed. My first answer to “what is the point of it all” was this, perhaps oddly as many people tend to reach for ‘happiness’, ‘understanding’.\nHonesty and transparency: I really try to only speak truths and to not decline questions about myself, my motivations, or my thoughts (unless there are concerns about other people’s privacy, promises I’ve made, NDAs, etc). I once stood in front of an audience exposed to arbitrary questions about what most would consider very personal matters and I answered them all.\nReliability: I do what I say. I keep my promises, am not late to things. I keep most of my tasks in my calendar and have good awareness of what’s happening and what has to happen next.\nIntegrity: I strive to be consistent in my actions across contexts. No matter what I’m doing, the same principles apply. If I’m being hypocritical I appreciate if I’m called out on it so I can be better aligned with what deep down I value.\nSelf-improvement: Though I’m pretty great, I believe I can be even better and I appreciate when others help me, even when I don’t ask for it. Unsolicited advice is hereby declared solicited!\nBenevolent perspective: Sometimes people make other people feel bad for a variety of reasons. I think people are, deep down, good. When they are not, they are mistaken in some or another way. This leads me to react with curiosity, pity, and sadness (accordingly, case by case) instead of anger and hate. I don’t always act like this for I too am a fallible human but I try! This doesn’t mean I’m naive about people. Some people can’t be trusted, they say one thing and do anther or are manipulative!\nPolitics: though I don’t think about politics that much in my day to day life, the labels libertarian, classical libertarian, or even anarchist of some flavor would fit me; you can read more in my blog about my views.\nWhat my life looks like\nI live in San Francisco and I really like the Bay Area. I don’t envision moving anywhere else, particularly as long as I work at my current job. If forced to choose another place (other than the Bay Area), that would be New York.\nI’m the Head of Theory at Retro Biosciences, a company that aims to extend healthy human lifespan by 10 years. I work on strategy and vision-setting for the whole company.\nSometimes after work I have time for some social occasions but I try to have those happening on the weekends. I have a car so nowhere in the bay feels too far.\nI go to sauna+cold plunge for ~2 hours every week to unwind and reset for the next week\nI go dancing often, either solo (ecstatic dance) or partnered (fusion dance typically). From time to time it is the case that I’m the first person starting a dance floor. I do contact improv from time to time and I wouldn’t be surprised if I get into tango at some point.\nFood remains a passion of mine, it truly is one of the existential joys in life! I like going for dinners and fine dining and occasionally cook. I started hosting dinners for friends this year and would want to host social gatherings in the future\nI am very social. There are people out there that probably think of me as their local Partiful dealer.\nI go to festivals sometimes; in 2024 I went to vibeclipse, vibecamp, and burning man\nBut I’m still an introvert at heart. I like staying in cozymaxxing, drinking tea and reading\nThis year I picked up meditation and circling and various attempts at embodiment practices. I haven’t jhana’d yet but trying!\nI do less travel than I used to but I could imagine getting back into it in the future. There is a world out there to explore!\nI work out at home. I started building a minigym in my room and would like to expand it if I had more space. Sometimes I go to more class-type workouts like Barry’s.\nI still read and write in my blog, but less than I used to. Now I do a lot of reading and writing at work so that need gets met there.\nIf I were to write a section like this 5 years ago I’d say that my life looks like working, going to nice restaurants, occasionally visiting European countries on the weekends, playing videogames, watching anime, reading, and writing in my blog and not feature much in terms of in person social activities. Maybe 5 years from now I’ll be making art, practicing BJJ, and starting my own company.\nPotential incompatibilities\nSome things that could lead to disagreements or conflicts\nI like order. Though I have gotten better at this, a space that’s messy and unkempt makes me feel bad and slightly judgmental towards whoever is responsible for that space in a “sigh ,don’t you like nice things, why are you letting entropy win, make things nice”.\nRelated to the above, as I want to keep my promises and commitments, sometimes I can’t be fully present if I know there’s something happening after the current activity. This comes handy at work (making sure a meeting doesn’t rabbithole pointlessly nor it skips agenda items) but it’s annoying when eg. cuddling (not having to think ‘have we cuddled for long enough?’ is nice). My solution to this is using timers.\nI can be stubborn sometimes. Often my view of the world is that I am right and everything I do is the correct action, with high confidence. But I also change my mind quickly. Truly strong beliefs, weakly held. I strive to not be too annoying about this. Fighting me is worth it though, as it will refine my understanding of a topic and eventually I do change my mind on things.\nMy curiosity about people can come across as judgmental. Whether you do something unusual or like vanilla ice cream, I might be asking questions of the type “why do you like that?” which can feel like I’m rejecting your experience or I’m wishing you to change. I know why I ask these questions and there is indeed a mixture of genuine curiosity and “I want you to change”\nSometimes I’m told I’m very “in my head” and “disembodied”. Trying to understand better what that means and be more of a being in the world at the moment.\nI get overwhelmed if I’m in a room with lots of conversations around me for long enough. “Wait but how are you in the top 0.1% of SF party enjoyers, you might ask” My current reconciliation of social events and this is to arrive exactly on time and leave once the noise is unbearable. So for me the peak forms of social hangouts are either small group conversations or ragers where there’s only dancing and music but not much talking.\nWhat I’m looking for\nThis is not a job description, take these as a broad direction, you don’t have to be perfect along all of these dimensions!\nAesthetics: I like nice things (art, fine dining, nicely decorated rooms, etc) and ideally you should too. But I don’t have enough taste as others do to make this happen for me. Help me make our lives beautiful, or let’s hire an interior designer to help us lol.\nGood self-aware communication. Someone that understands themselves deeply and is willing to extend that deep understanding to me. Let’s build little models of each other in our minds :)\nA growth partner: I see a relationship as something where we grow together. I’ll help you grow but won’t try to fix you and I expect you will do the same with me.\nA balanced way of being: You see the appeal of both cold and warm cultures, you can zoom into narrow problems and also take the high level view. Same for guess and ask cultures: you see the point of asking directly for what you want as well as looking out for what others might need.\nSomeone to do things together with: Anything in my list above, plus maybe something from your own list? Ultimately, with the right person, many activities can become enjoyable, from drinking tea and reading, assembling lego flowers together to going to burning man.\nMonogamish-to-poly: Reading Esther Perel left me convinced that pure monogamy is not for me (or people like me). When I think “will one person even be enough” part of me says yeah if they are the right person! Another part says probably not! But people change, and if I commit all-in to monogamy now (even with the right person) I see myself with a high enough risk of being unhappy in the future, tied by my values of honesty and commitment, so I want to leave that door open. You could be asymmetrically monogamous or you could be very poly, as long as we still are transparent with each other (per values above)\nKids. I am not yet sure if I want them. I am open to that, but not in the next 2 years. I expect I’ll end up wanting kids though.\nAssorted José facts\nI’m funny sometimes. I also say strange things that make sense at least to me. José Luis Ricón Fernández de la PuenteJosé Luis Ricón Fernández de la Puente on Twitter / X​\nThere are a couple of podcasts where I yap about various topics of interest\nThe previous iteration of this date-me doc was featured in the NYT!\nI’m surprisingly good at table football (but I rarely have the chance to play)\nFor my 30th birthday I ran a small art exhibition of my greatest tweets at the SF Commons. Great cakes were procured. People don’t maxx out on good cakes enough.\nI was once invited to a conference in the US. As a visitor the TSA office asked me what brought me to the US. I said “to make science great again”. The officer lol’d and let me into the country.\nI might be the person about whom the most Manifold Markets have been made ManifoldHome​\nDiet: I eat animals sometimes (you don’t have to agree on this). That said, I don’t think one has to eat animals to be healthy, so I’m happy with being mostly vegetarian or vegan-ish at home, and spending my animal points on nicely cooked steak.\nPictures\nJose’s paella, known as SF’s best paella\nALT\nMe & my roommate Angie at the launch of Scout Dixon West’s perfumes. Angie is really based and she’ll assess your culture fit during the onsite.\nALT\nThat night I had two parties to attend; one was a Disney x 50 shades of grey, the other one a regular halloween party. I opted for a Spanish Inquisitor costume that could morph (with the hat and the mask) into Masquerade Jaffar for the second party.\nALT\nI will look at you with the same loving intensity I'm giving this teacup\nALT\nThis one could illustrate the dictionary entry for cozymaxxing couldn’t it\nALT\nBonus: pictures me pointing at things\nNext steps\nThree options await you:\nIf I’m not for you, then you you can go on with your life!\nIf you do like me and perhaps would like to date me but you are like not fully convinced or think I should be the one making the first move, then you can opt to show interest under the usual plausible deniability rules. Fine. But it may take me a while to notice!\nApply here: Google DocsGo on a date with José​"
    },
    "scrapeTimestampDetail": "2025-11-27T17:01:04.536248+00:00",
    "id": "usr_64aaeab250",
    "docAccessible": true
  },
  {
    "name": "Kaushik Donthi",
    "age": 27,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "San Francisco Bay Area",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://www.notion.so/Date-Kaushik-Donthi-Me-11d723154a764520a5e900daa6db6f4d?pvs=4",
    "lastUpdated": "2024-10-05",
    "profileDetails": {
      "fullText": "Skip to content\nYou’re almost there — sign up to start building in Notion today.\nSign up or login\n🦆\nDate Kaushik Donthi (Me)\nShare\n🦆\nDate Kaushik Donthi (Me)\nTable of contents\nProblem statement\nGoals\nNon-goals\nProposed solution\nInterests and Hobbies\nValues\nPictures\nSuccess Criteria\nImplementation and rollout plan\nProblem statement\nI decided to use one of the Engineering solution templates from Notion, so my problem is figuring out how to use this without making people think I need a group of overpaid college graduates to fix me.\nBut really, my goal is to find a loving, rewarding relationship with a female I am interested in and for whom I am willing to sacrifice the time necessary to build a relationship. Someone who is kind, intelligent, silly, curious, courageous, and empathetic. And very importantly, someone who is emotionally mature enough to realize the kind of work and sacrifices that a relationship entails.\nI am pretty flexible about the actual location, since my job is usually remote. Buttt I am a sucker for good weather - I’ve lived in the Bay Area for most of my life and in Malaga, Spain for a little bit so I am not going to pretend that living in Norway would be perfect for me. But love transcends all, right? 😛 I’ll try to use some of the existing fields in this template that I find are surprisingly appropriate or just funny.\nGoals\nIdeally - find someone who is compatible with me in a relationship sense by showing them this document and some pictures of me, at which point they will fall hopelessly in love.\nNon-goals\nMeeting more guys. Just kidding! If you think we would be two cubes in an ice tray, regardless of what your gender is, then totally message me and we can haaanggg. See “Implementation and Rollout Plan” for contact details.\nProposed solution\nMeet a lot more girls with the openness to a relationship or just a friendship depending on how we feel about each other. I see either as a win, but I want to be clear that my intention going into a meeting is 80% to date and 20% to be friends. To be clear, I love having a relationship that has the foundation of a friendship. But I am not sure how this is possible unless we read this doc, signed a binding contract to be friends, erased our memories, and then one day felt that we could be more.\nI think it’s easier going from “Ah I don’t see this working out as a relationship, but we can totally drink boba like every 5 weeks” rather than “Hey we drink boba like every 5 weeks, but I want to see you again tomorrow.”\nInterests and Hobbies\nProgramming - I am a software engineer who has worked for blockchain companies (trading and gaming-related) and I am extremely grateful that I truly enjoy my work! I love building things with an end customer in mind and I find it awesome that solving cool problems can make peoples’ lives better. Somehow, I think the universe was beautifully designed that way.\nMath/Physics\nI kind of have this weird liking for math competition problems and I think it is so beautiful how we can create abstractions to describe the physical world\nI have explored ML, but I frankly don’t really like things that are that much of a black box to the point where we are just working backwards to find the motivation from the implementation\nI used to be really bad at physics in high school and kind of hated it, but in college I decided to try to do my best and I actually ended up really liking it and I was a teaching assistant for a couple of physics classes\nStrategy Games\nReally Like\nCatan (I love the 1v1 version of Colonist, I was ranked Diamond two seasons ago and btw the username is from Looking for Alaska by John Green haha)\nSecret Hitler\nSoccer\nLove/Hate\nChess\nTennis (love watching it though)\nHate\nUno (is this even strategy?)\nLosing (in honesty, I can get pretty competitive sometimes haha)\nBeing active\nRunning\nSwimming Way Too Deep in the Ocean (SWTDO)\nRowing\nComedy\nImprov (for me, humor compatibility in a relationship is huge and if I can do a bit with you, that is a huge plus)\nConan O’Brien <3\nValues\nHonesty\nI am the kind of person who tries to say what is on his mind in a compassionate, caring way towards myself and others\nI think short-term discomfort is worth long-term growth\nI really resonate with the quote from the Kite Runner, “That's the thing about people who mean everything they say. They think everyone else does too.” It just means to me that if we both trust ourselves to be honest, we can assume good intention and it just makes things soooooo much easier (and we can also move much faster haha!)\nGentleness/Kindness\nI don’t feel like a man needs to be “assertive” or “dominant”; I think being gentle and kind is strong in it’s own way\nI think being kind and loving and holding someone’s heart with care are so much more important and I want to be with someone who values the care I give to them\nFighting Well\nI think in a relationship fights are inevitable, but I think healthy relationships fight well\nPhysical violence is not okay, as are demeaning comments\nWe try to argue our points to the best of our knowledge and acknowledge good points from the other side\nWe are both mentally healthy enough that we do our best to make it work but have the power to walk away at any time\nHealth\nI have become much healthier over the last 7 or 8 years and I would love to meet someone who also cares about what they put in their body\nI love to exercise on a regular basis, whether it is swimming, running, rowing, or playing soccer\nI don’t expect my partner to be interested in the same activities (I guess this goes for really everything I’ve said so far haha)\nAlso pretty into meditation, although my view on its importance has changed a lot over the past few years\nSelfish Altruism with a Mix of Loving Without Expectation\nI think it is important to figure out what brings you joy and how you can use that to bring joy to others\nBare altruism is rarely a good long-term goal - how many vegetarians/vegans have you met who did it for the sake of the world but gave up because of how futile they felt their attempts were in making a dent in the animal consumption problem?\nFor me, becoming almost fully vegetarian/vegan was a decision inspired by my getting healthier and looking better\nBut I think loving yourself allows you to love others best :); and loving without expectation is the best way to show up in life and in a relationship - that love doesn’t have any promises; you just have to be grateful for every moment, and enjoy every single moment\nCuriosity/Playfulness\nI love being just fun and silly and weird and my humor can be dirty sometimes with people I feel comfortable with, and I hope to find someone I can play with for the rest of my life\nI think that the universe is somehow inherently playful - it does without any purpose and it rewards joy and spreading happiness\nI think everything is connected from chess to physics to swimming to flowers and I love to find and think about these connections\nBelief/Confidence/Ambition\nI truly believe that the universe works with you on goals you really believe in and that the universe responds when you ask it for something and put a full-hearted effort into it\nI think working towards goals that ignite us is what we live for and it’s important to me that my partner is decently ambitious as well\nPhysical Connection\nPhysical touch is one of my love languages, so I would ideally like to be with someone who also likes that :)\nI think sex to me is a part of expressing love in a relationship, and while it shouldn’t be at the forefront of what’s going on, I think it’s important that there is good physical compatibility\nI don’t think about sex that much at all, unfortunately, so I can tend to be bad at initiating; however, this is something I am happy to work on\nPictures\nAnd here are some (silly) pictures of me! I guess if I had to describe myself, I am a 5’ 10.5’’ guy who tends to be kind of skinnier/toned side. A lot of these are in Europe (I lived in Spain for a bit last year!) and I switch a lot between having and not having a beard, so I’ll include pictures of both 🙂\nI didn’t even get to go to the top :,) But maybe we can?\nALT\nYeah I guess you could say I get a lot of kudos\nALT\nWhat’s up with my posture lmao\nALT\nDon’t show this to my mom (I’m a momma’s boy if you couldn’t tell)\nALT\nJust for balance, a picture my mom probably likes\nALT\nSuccess Criteria\nHow will you validate the solution is working correctly?\nHopefully, we can be very open with each other if we think things are working out. I am sometimes really good but otherwise hopelessly lost in reading signs from girls.\nI also don’t want to waste either of our time - I think a relationship is an opportunity cost and I hope that we are both gaining something from our time together to make up for it.\nWhat monitoring and alerting will you do to ensure this project doesn’t decrease performance and reliability?\nI will constantly ask ChatGPT 4.5 to tell me what I am doing wrong\nImplementation and rollout plan\nIf you read all that and you think you still want to meet me, I guess maybe you’re pretty cool yourself.\nHaha, did you actually fall for this big pile of steaming …? Okay sorry, like I said my humor can be a bit strange sometimes. Hopefully, you didn’t actually stop reading. Or if everyone stopped reading, would anyone ever read this? I wonder if I could just write whatever I wanted down here. Like YO MAMMA IS SO FAT, THAT SHE GOES THROUGH A LUNAR CYCLE EVERY TIME SHE PIROUETTES. Who said my jokes were good?\nJeez, okay… I will try to be serious for like 20 seconds. If you think we would be a good fit, text me at (plus one) five one zero, seven seven one, four nine one four. Or email me at kaushikdr@gmail.com. Or do both?"
    },
    "scrapeTimestampDetail": "2025-11-27T17:02:45.959263+00:00",
    "id": "usr_0e7b7af163",
    "docAccessible": true
  },
  {
    "name": "Robi Rahman",
    "age": 30,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "NYC DC",
    "locationFlexibility": "Some",
    "profileUrl": "https://fortunate-dragon-241.notion.site/Robi-Rahman-18dc6efe060a43f08163d67832f13719",
    "lastUpdated": "2024-09-27",
    "profileDetails": {
      "fullText": "Skip to content\nRobi Rahman\nGet Notion free\nRobi Rahman\nDating Robi is an experience filled with thoughtfulness and consideration. He’s a utilitarian at heart and enjoys philosophy, always striving to ensure his partner’s happiness. Robi goes out of his way to find out what you like and makes it happen—whether it’s having your favorite tea at home or planning a perfect camping trip. His meticulous planning and execution make him a reliable and enjoyable partner.\nBio\n30 years old\n5’8”\nLives in Brooklyn, NYC\n🌎\nBorn in Washington, DC, Robi spent his formative years in Arlington, Virginia, and later lived in Williamsburg, Fairfax, and Cambridge, Massachusetts, before settling in New York City in 2023.\nI’d be open to settling anywhere when I’m married, with slight preference for somewhere on the east coast like DC or Boston.\nEducation\nMA in Data Science from Harvard\nBS in Chemistry from William and Mary\n📝\nCareer\nTeam\nMeet the team behind Epoch AI and learn about the values we are committed to.\nhttps://epochai.org/team\nData Scientist at Epoch\nI’m a data scientist at Epoch, a nonprofit researching the future of artificial intelligence. I love having smart coworkers and doing intellectually engaging work that a lot of influential people rely on.\n🏦\nIncome: $90,000\nNet Worth: $200,000\nI’ve taken the Giving What We Can pledge, where members promise to donate 10% of their income for the rest of their lives towards helping other people.\n💼\nRobi deliberately chose a path that allows him to tackle some of the world’s biggest problems and make a significant impact. His love for his job is evident, as he finds fulfillment in helping others and creating positive change. Currently, he is deeply involved in groundbreaking projects, including a follow-up to the study \"Are Emergent Abilities of Large Language Models a Mirage?\" where he explores the future of AI technologies.\nwww.linkedin.com\nhttps://www.linkedin.com/in/robirahman/\nFamily\n🌱\nRobi has one younger brother. He maintains a close relationship with everyone in his family.\nWants children\nI hope my kids grow up to feel fulfilled and like they have opportunities to do whatever they want. If they’re interested in music, I’ll buy them whatever instrument they want to play. If they want to be athletes, I’ll take them to practice.\nReligion/Politics\nRobi is not religious. He identifies as moderately left wing, but does not consider himself strongly political.\nOther Facts\nSense of Humor\nI like to make funny comparisons between things or that are related in surprising ways. I like to say ridiculous things in deadpan, or poke fun at things that are obviously wrong by pretending to agree with them.\nSpeaks Spanish\nLikes pets but doesn’t have any\nHas been to over 20 countries\n📝\nGRE: 340 (2017)\nSAT: 1570 (2011)\nPersonality\nRobi is a firm believer in continuous self-improvement. He approaches self-betterment by focusing on one aspect of himself each year, aiming to become the best version of himself. Currently, he’s dedicated to getting back in shape, having recently joined a gym and setting a goal to lose five pounds.\n🧠\nBig 5:\nOpenness: 88\nConscientiousness: 75\nExtraversion: 46\nAgreeableness: 92\nNeuroticism: 1\nIn 2021, I started a New Year’s resolution accountability group with ten of my friends where we set goals and met each week to talk about our progress. The accountability was a superpower, because if you tell someone you’ll do something, you don’t want to let them down by not doing it. I set goals to run a 10k in under an hour, learn the flags and capitals of every country, and to exercise and practice Spanish every day.\nRelationship Dynamics\n💘\nLove Languages:\nQuality Time\nWords of Affirmation\nWhen it comes to family dynamics, Robi seeks a balanced 50/50 partnership. His job offers generous paternity leave, and he is open to discussions about family roles, emphasizing flexibility and mutual support. He envisions a future where both partners contribute equally, in various ways, to the relationship’s success.\nCore Values\nMy greatest passion is making the world a better place. I’ve done thousands of hours volunteering for effective altruism. EA is a small group of people that has an outsized impact, like preventing millions of cases of malaria and helping develop several vaccines. Besides global health, we work on other important issues such as climate change and preventing nuclear war.\nI think you must treat everyone fairly, and you should consider the well-being of other people, not just yourself, when deciding what to do.\nInterests\nRock Climbing\nUltimate Frisbee\nBallroom Dancing\nReading\nWriting\nFoodie\nCooking\nPhilosophy\nPhilanthropy\nRobi is a skilled cook and once won a food photography contest.\nALT\nSocial Media\nRobi Rahman (@robi_rahman) on X\nData scientist @EpochAIResearch Alum @williamandmary and @harvard Likes: books, nature, science, cooking, current events Dislikes: social media\nhttps://twitter.com/robi_rahman\nInstagram (@robirahman94)\nInstagram photos and videos\nhttps://www.instagram.com/robirahman94/"
    },
    "scrapeTimestampDetail": "2025-11-27T17:08:22.393917+00:00",
    "id": "usr_175108006f",
    "docAccessible": true
  },
  {
    "name": "Campbell Hutcheson",
    "age": 33,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "San Francisco Bay Area NYC",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://sudden-tulip-407.notion.site/Campbell-Hutcheson-6b27424d83ef409cb4610fc31b2cc3df?pvs=4",
    "lastUpdated": "2024-07-09",
    "profileDetails": {
      "fullText": "Skip to content\nCampbell Hutcheson\nGet Notion free\nCampbell Hutcheson\nIntroduction\nIdeas\nLove Style\nCareer etc…\nPhilosophy\nIntroduction\nHi! I’m Campbell. I’m 33. I'm from Connecticut. I’m adventurous. I like to travel - but I like to travel for ideas. I don’t care that much about money - but I do like to make money? I’m not sure about that one way or the other.\nI think I’m kind, interesting and thoughtful. I’m 5’9” or 5’10”? I like to keep my hair messy. And I wear a lot of interesting hoodies.  I have a law degree from Oxford. An undergraduate classics degree from UConn. I spend most of my time programming or doing law or walking.\n(Oh looking to date  - then see if you are interested in getting married - and I want to have children)\nIdeas\nI’m atheist, but I think in another time period, I would have been religious. I have had a number of different periods in my life when I was gripped by ideas. First, it was classics. Then, it was law (especially contract law). Then, it was computers. Now, it’s AI and machine learning. I talk about the ideas that I like pretty constantly. I tell a lot of jokes.\nWhat I really want to know are your interests! And, I want you to share them with me. I want to be with someone that wants to share their observations with me.\nLove Style\nI really like physical touch and to hold hands. I want someone that I can spend a lot of my time with as the relationship progresses. I really have very few demands. I like to let me partner live out their goals. But, I like my partner to let me live out mine. I’m small “c” conservative (so, monogamous). I’m thoughtful - but low key. I also try my best.\nPrevious partners have described me as “kind”, “thoughtful”, “gentle”, “honest” and “adventurous”. My most successful relationships have been with girls that were like me (not in a background sense but in a love style and ideas and career sense).\nI’ve also been described as “playful”.\nCareer etc…\nI’ve never had trouble with career but my career has been super unusual. I went from legal assistant to Chief Compliance Officer at a 2k person company. There is a whole story there. The company went public. I then took 2 years off. Then was first employee as Chief Product Officer at a Regulatory AI company. I just quit.\nI think about my career a lot - but I min-max for ideas. I don’t think anyone should worry about whether I have a provider mindset - I don’t - but I make up the difference by being highly performant and knowing what I want - and the things I want have always been highly remunerated.\nPhilosophy\nI’m not a rationalist. I honestly feel like I missed the boat on that; but the rationalists I’ve met are super interesting. I have a developed thought about what it means to be a good person, but I’m pretty tempered on all of this. I feel like that’s the benefit of getting older.\nI end up with friends across a very wide age bracket (my oldest friends are in their early 50s and my youngest friends are early 20s).\n(Oh, I’m straight as well)\nFeel free to reach out at nchutcheson@gmail.com"
    },
    "scrapeTimestampDetail": "2025-11-27T17:10:03.849609+00:00",
    "id": "usr_0595390b2a",
    "docAccessible": true
  },
  {
    "name": "Greg Rosenthal",
    "age": 28,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "UK Cambridge",
    "locationFlexibility": "Some",
    "profileUrl": "https://freckle-botany-7b8.notion.site/Greg-s-dating-doc-5574d7f17d6e49be86513dab9e971f3e",
    "lastUpdated": "2024-04-29",
    "profileDetails": {
      "fullText": "Skip to content\nGreg’s date-me doc\nGet Notion free\nGreg’s date-me doc\nBasic info\nPhotos\nCareer\nPersonality and values\nLifestyle preferences\nHobbies"
    },
    "scrapeTimestampDetail": "2025-11-27T17:11:45.312884+00:00",
    "id": "usr_0949dff098",
    "docAccessible": true
  },
  {
    "name": "Omar",
    "age": 31,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "Central Europe",
    "locationFlexibility": "None",
    "profileUrl": "https://jerid616.notion.site/Date-Me-8a31b572fca1472eadd0a0493a4c597d",
    "lastUpdated": "2024-04-12",
    "profileDetails": {
      "fullText": "Skip to content\n🇬🇧\nDate Me\nGet Notion free\n🇬🇧\nDate Me\n👉\nTL;DR\nA nerd boy looking for a girl to date.\nCreated on 10th April 2024\nLast updated on 12th April 2024\n🇮🇹\nQuesta è la versione in inglese. Se vuoi la versione in italiano, clicca qui\n📷 Pics\n✅ Let’s start from the basics\nName: Omar\nAge: 31 (I may look younger, but I’m not lying about my age, I swear 😁)\nGender: M\nHeight: 174 cm\nOrientation: hetero-romantic is the right word, for the rest…\nLocation: Northern Italy 🇮🇹 (quite close to Bologna)\nLanguages: Italian, English, a bit of French\nLooking for: dates, then who knows\nRelationship style: monogamous, I guess\nZodiac sign: Pisces, Libra Rising, Scorpio Moon\nMBTI Type: INFJ\nEnneagram: 4w5\nReligion: giving you a hint at the bottom of this doc\nPolitics: apolitical, there’s never anything good to say\nJob: currently unemployed\n🧡 Favourites\nSeason: spring\nTV series:\nBand: HIM (guarda sotto)\nMovie: Nightmare Before Christmas\nVideogame: Final Fantasy X\nManga: Berserk\n🎸 Hobbies\nplaying videogames\nreading mangas\nhaving a love-hate relationship with coding (or at least, trying to treat it as a hobby)\nlistening to music (mostly rock/metal); here are some of my favourite songs\nplaying the guitar and the bass\ncomposing music; here’s my solo musical project Cavaliere della Rosa Rossa ( = Italian for “Knight of the Red Rose”)\n⭕ What I find valuable\nDisplays of affection: I’m a huggy person 👉👈 (be careful: I’m not a teddy bear haha)\nDedication: you could tell me anything about “passion yada-yada-yada”, but think about it: what is a relationship — ANY kind of relationship — without proper dedication?\nHaving things in common: not necessary but surely won’t hurt, actually they might be chances to spend some time together 😄\n“Little gestures”: even a simple “I’m happy with you” can really mean more to me than its apparent simplicity\nSpontaneity: last (but not least), I like texting but if we’re happy together even strolling together listening to music with an earphone each is somehing wonderful; on the other hand, even the most apparently chic date without that “je-ne-sais-quoi” isn’t something I’d go on with\n❌ My big “no-no”s\nJealousy. I’m not a jealous person myself (which doesn’t mean I don’t care about the other person, but that I’m not the “WhereUAtWhatchaDoinWhoUWith???” guy) and I can’t stand jealousy at all. I expect back the same trust I give.\nLack of respect. Should be self-explanatory, but I need to add a point: I may not be the smartest or wittiest person in the world, but this doesn’t give you the right to talk me as I’m a complete dumb.\nGhosting. I can understand if you change your mind (you absolutely have the right to) and don’t want to date me / know me any more, but being left in a limbo outta nowhere is a horrible sensation, so PLEASE. PLEASE. PLEASE. TELL ME IF YOU WANNA STEP OUT. I’ll be doing the same should I be the one who wants to step out.\n“Always-on-men”. I’m not a friggin’ ATM, so don’t expect me to pay every single time.\nDiet. I’m open to dating veg* people as long as they respect the fact that I’m not. So if it’s a problem to you, sorry but I’m definitely the wrong person for you.\nKids. Sorry, but if you already have kids or want them in the future, I’m definitely the wrong person for you.\nMarriage. Same speech.\n📱 Contact\n👉\nTelegram\nInstagram\nE-mail (don’t expect an immediate reply here tho)\nJust make sure you use the hashtag #JustReadYourDateMeDoc (on the subject if you e-mail me) on your message so I understand 😉\nOh, and link me / send me your “Date-me doc”, if you have one! 😊\nThe reality is that ideal love is only possible between two independent, mature and sincere people. Therefore, it is essential that you first decide to improve yourselves. If you feel from the bottom of your heart in your relationship that you are not regarded as you should be, I hope you have the courage and dignity to break off such an unhappy relationship. True love does not come between two people who smother each other; it can only come between two strong people who are sure of their individuality. A superficial person will only have superficial relationships. If you want to experience true love, it is important first to sincerely develop a strong identity. True love is certainly not doing what the other person wants, or trying to be what you are not. If someone loves you deeply, he or she will never push you to act against your will or involve you in anything dangerous for you.\nDaisaku Ikeda"
    },
    "scrapeTimestampDetail": "2025-11-27T17:13:26.645847+00:00",
    "id": "usr_a5a2e6db18",
    "docAccessible": true
  },
  {
    "name": "Lilith",
    "age": 32,
    "gender": "F",
    "interestedIn": [
      "M",
      "NB"
    ],
    "location": "NYC NY",
    "locationFlexibility": "Some",
    "profileUrl": "https://elixander.notion.site/Hi-hi-hello-d69bfcec34d248aa85dc804a29e48143?pvs=4",
    "lastUpdated": "2024-04-11",
    "profileDetails": {
      "fullText": "Skip to content\n💘\nHi hi hello\nGet Notion free\n💘\nHi hi hello\nLast updated: Jan 1, 2025\n⏸️\nCurrently taking a break from dating. I’ve archived the contents of this page for now. Wishing everyone luck in their searches!\n💡\nIf you didn’t land here from a Date Me directory, you might be wondering what this is and/or think this is Very Weird (fair). Here’s the NYT Article that first introduced me to the idea—I just think of it as a more custom profile that’s not tied to a specific app."
    },
    "scrapeTimestampDetail": "2025-11-27T17:15:08.109202+00:00",
    "id": "usr_2a12586f88",
    "docAccessible": true
  },
  {
    "name": "Jonathan B",
    "age": 38,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "NYC",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://glimmer-cod-b43.notion.site/Date-Me-Jonathan-B-d08452adae1e46b49b6e075553c37015",
    "lastUpdated": "2024-04-09",
    "profileDetails": {
      "fullText": "Skip to content\nDate Me: Jonathan B.\nGet Notion free\nDate Me: Jonathan B.\n💡\nHello! I’m Jon, and I’m looking for a wife! I’d love to find a nuanced thinker to have adventures, create and raise a kid or two, and conduct a 50 year conversation that never stops being interesting. If that might be you, and the description below sounds intriguing, get in touch!\n🎂\n39 📏 6’2”📍LES/NYC 👶 No kids yet but excited to have some with the right woman!\nTable of Contents\nQuestions I’m likely to ask you on a first date\nThings I’ve accomplished (roughly chronologically)\nInterests\nAttributes/Things that I am\nValues\nWhat I’d like to bring to/create in a relationship\nGet in touch!\nGallery\nQuestions I’m likely to ask you on a first date\nI’m not much for small talk; here’s a sampling of the kind of thing I’ll want to talk about if we go on a date.\nWhat’s your heresy? Or put differently, what’s an opinion you hold that a community you consider yourself a member of would consider anathema?\nWhen’s the last time you changed your mind about something important?\nWhat’s something you’re an expert in? Like top 1% globally?\nIf you were empress of NYC for a day, what change or policy would you enact to make it a better city for the next 100 years? Think about actual policy levers, not magic-wand sorts of things.\nTell me a story about a trip you took that taught you most about yourself (or reality)\nWho are your heroes? Who do you routinely read/pay attention to?\nWhat do you aspire to?\nThings I’ve accomplished (roughly chronologically)\nIn 7th grade I won the City of Madison spelling bee. I still resent  “pica”, the word I lost on at the state competition, as well as “pika” - the adorable animal homonym - out of spite.\nMe (second from right) coordinating with local counterparts.\nALT\nIn my final year of undergrad, I redesigned a water supply system in Ecuador. After graduation, I flew down with my team and built it! We organized ~400 volunteers over a week and a half to enlarge sections of pipe, install valves and meters, and restore equitable access to a water supply system that served 5 villages in the hills above Otovalo. I also managed a sewer project in El Salvador through Engineers Without Borders.\nI spent 2 years living and working in Uganda as a Peace Corps Volunteer. While there, I started this company, still operating - some of my proudest work!\nStarted a machine-learning startup (now defunct) with my best friend\nOne of my favorite economists, Arnold Kling, ran a Fantasy Intellectual Teams competition. I am the undefeated champion\nWhen I went to Azerbaijan in 2023, I enjoyed their national dish (Shakh Plov) so much, I taught myself how to make it when I came home.\nInterests\nReading See below for my “holy canon”, but I’m constantly reading great sci-fi or history related to an upcoming trip\nTravel I’m in an informal competition with my dad to visit the most countries. My current count is 50. This year (2024) I’m planning trips to Peru, Bolivia, Brazil, Taiwan, China, Poland, Germany, Czechia, Austria and maybe Pakistan. In 2023 I visited Senegal, Norway, Turkey, Georgia, Armenia, Azerbaijan, Sweden, Hungary, and Slovakia.\nUncle-ing It’s my great honor to be “Uncle Jon” to 3 kids of my close friends. I can’t wait to be a dad of my own, but in the meantime I take great delight in being the funcle.\nBoard games  Every August I buy (and get mildly obsessed with) that year’s board game of the year, and I host a monthly-ish gathering of friends for food and games.\nRoad trips/camping/hiking My trusty steed (above) is named Dawn Treader, and she is the finest roadtripmobile in all the land. We have ~50,000 miles together. I’ll never say no to a new national park, though I indulged that hobby a bit more when I lived in Seattle.\nBeauty I try to bring something beautiful back from every country I visit, and infuse a small bit of what caught my eye there into some part of my daily life. Sometimes it’s a painting, or a knicknack for my shelf, or a recipe I learn. Very often, my aesthetic taste inclines toward the hexagonal.\nAttributes/Things that I am\nEngineer. I hold a masters degree in Civil Engineering, and though I’ve long since turned my career to IT Product Leadership, I still think of myself fundamentally as a problem-solver and builder.\nEmotionally Stable I’m reliable and steadfast - even on my crappiest of days, I stick to my values and show up for my important relationships.\nAdventurous  …but not an adrenaline junky. I haven’t jumped out of any perfectly good airplanes, but I’m 70% sure I could land one in an emergency. Exploring the unknown (in a city, in a country, in a woman, in the past) lights me up. These words from Tennyson resonate with me:\n“I am a part of all that I have met;\nYet all experience is an arch wherethro'\nGleams that untravell'd world whose margin fades\nFor ever and forever when I move.\nHow dull it is to pause, to make an end,\nTo rust unburnish'd, not to shine in use!”\nMinimalist Twice I’ve shrunk my possessions down to what could fit in my car. I also take enormous joy in finding the perfect object of any kind - be it travel shoe, backpack, or camping equipment. I can comfortably travel for 5 weeks with only a 10lb backpack.\nValues\nCuriosity - There is very little that disinterests me. I particularly love encountering new phenomenon and learning all I can about it. One of my favorites is to pair reading with my travel - brushing up on the last thousand years or so of that place, trying to figure out what makes it special.\nLoyalty  - My 5 oldest friendships are an average of 20 years old. When I find people I Iike, I do all I can to build durable relationships.\nPragmatic Incrementalism - If I have an overriding philosophy, it’s this. A little bit better today is better than a lot better maybe never. Move at the margin, the perfect is the enemy of the good, get 80% of returns from 20% of inputs, compounding returns are your friend.\nEnlightenment Values - Steven Pinker’s “Enlightenment Now” is on my holy books list because it’s been profoundly influential to my thought. I’d like a partner who shares (or at least enthusiastically tolerates) my belief in the idea of an abundant future. My desired political outcomes skew to the neo-liberal. In the US, I’m politically homeless but especially tribeless, and I proudly identify as a heretic.\nNuance - I strive to be an independent, first-principles thinker. I split hairs with wild abandon. I pay attention to dozens of writers, podcasters, youtubers, and academics - none of whom I agree with on all topics. I’m much more interested in a thriving intellectual atmosphere where outstanding participants can debate in good faith. The GMU economics department is my favorite idea lab.\nWhat I’d like to bring to/create in a relationship\nPermanence - I’m looking for a partner for the rest of my life. I was married before (happy to talk about what happened, but not on the internet), but I’m serious about finding one person to grow old with. I’m a believer in the committed, monogamous relationship both for raising kids as well as building a relationship that works for us both.\nGoodness - One of my fundamental relationship values/aspirations is that partners should be as good to each other as they can possibly manage. I’d like us to be one of those couples that amasses such a wealth of good will aimed at each other that it becomes contagious, a beautiful bubble of relationship somewhat insulated from reality but still embedded in it such that we bend the universe around us. I don’t need or desire that relationship to be all-consuming, but I want it to be strong and stable enough to survive (and even thrive in) the demand of our future toddler(s) that the universe revolve around them.  I think few people would openly disagree with this sentiment, but I mean it in the deepest possible sense. I’m looking for a relationship where we are both seriously committed to co-creating a life full of joy for each other, and that means taking our differences seriously, and getting really good at negotiating shared and separate spaces that meet our needs.\nPartnership - I’m open to most manifestations of roles in child rearing/household management and income generation. I’m actively looking forward to being a father and supportive partner. Ideally we’d have a 30-70% overlap in shared interests such that its enjoyable to be together “by default”.\nGet in touch!\nIf this sounds interesting to you, get in touch! I’m not looking for a long distance relationship (i.e. it’d be great if you’re in NYC) but maybe you’re the one to convince me otherwise.\nGallery\nAdd an image"
    },
    "scrapeTimestampDetail": "2025-11-27T17:16:49.476622+00:00",
    "id": "usr_043cba3ae0",
    "docAccessible": true
  },
  {
    "name": "Sebastian Schmidt",
    "age": 31,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "London Oxford San Francisco Bay Area Amsterdam Berlin",
    "locationFlexibility": "Some",
    "profileUrl": "https://www.notion.so/Sebastian-as-a-romantic-partner-5ad229607f724cb28decc525cd450da7?pvs=4",
    "lastUpdated": "2024-03-09",
    "profileDetails": {
      "fullText": "Skip to content\nSebastian as a romantic partner\nGet Notion free\nSebastian as a romantic partner\nHi - I’m Seb\nWelcome to my dating doc!\nMe in Tokyo (2023)\nALT\nSummary\nI am looking for someone who could be a \"romantic co-founder\" or soulmate. Someone who wants to co-create a beautiful partnership where we can support and inspire each other in our missions to create a better world while overcoming life’s inevitable challenges, building relationships/communities, and enjoying life.\nAge: Born 1992\nKids: 65% yes but 95% that I won’t get kids in the next two years (until end of 2026).\nGender/Sexuality: Straight man.\nRelationship structure: Monogamish.\nLocation:\nLondon: ~ 6 months/year until at least mid-2026.\nUS/Bay area: ~2 months/year.\nAnywhere in the world (but preference for strategically relevant places): ~4 months/year\nKindly don’t share this publicly!\nTable of content\nAbout me\nMy journey\nMy decade vision\nFacts\nAbout you\nQualities and tendencies\nImportant stuff\nFacts and nice-to stuff\nAbout us\nNext steps\nAppendix\nBig-5 personality\nAbout me\nMe with some of my friends in London. (2023)\nALT\nI’m a co-founder of Impact Academy - a non-profit that runs ambitious educational programs to enable young people to use their careers to solve some of the most pressing problems and contribute to a better future. I also work as a coach for impact-driven people. I enjoy communal living and have lived in multiple group houses -  including one with a six-month-old baby, but am also open to other forms of communal living.\nBefore that, I did a bunch of different things throughout my life. I trained as a medical doctor, did biosecurity research at Stanford that might have contributed a tiny bit to the prevention of pandemics, co-founded Effective Altruism Denmark, co-authored a book during my undergrad, and created a course for 1000+ students.\nI’m also a mediocre salsa dancer and a non-terrible singer (who loves to sing Alicia Keys songs). On the more adventurous side, I've spent four months in Nepal and hitchhiked from Copenhagen to Budapest.\nMy journey\nDue to luck and a great teacher, I had a wake-up call when I was 16 and I realized that I was on a bad trajectory. I started to work on forming my values, character, and lifestyle to take care of myself and lead a more meaningful and altruistic life (such as supporting refugees). As I was deciding on my degree, I considered many different options (from social science to philosophy) as I’m very curious (and still am! 🙂). However, I narrowed it down to medicine and psychology and eventually decided on medicine as I thought it was the most promising way of understanding the human condition and thus help others the most. Especially those who needed it the most. This was mainly driven by altruism, curiosity, and unnoticed guilt.\nDuring the first years of my undergrad, I co-authored a book with a Norwegian author who had inspired me when I was younger. The book we wrote together was on how to study effectively and I was later hired to create and teach a course for all medical students at my university. I eventually decided to pivot away from this because I believed effective altruism and global health were more important (not an easy decision!). I had several existential crises and almost dropped out to join Effective Giving when it was starting out. However, I decided to finish the degree and build the EA community in Denmark (which I did for three years next to med school). During these later years, I also started finding “my people,” with whom I built deep friendships that last to this day, frequently bringing me joy and gratitude.\nTowards the end of med school, I ran a career experiment in biosecurity at Stanford University, SSI, and the US CDC for two years. My research was on mortality monitoring using EuroMOMO because I predicted it’d be useful in pandemics (pre-covid). This included living in an incredible group house with entrepreneurs in Palo Alto and trying coaching. These experiences introduced me more seriously to entrepreneurship and coaching - both of which I’ve been pursuing since 2020. In 2022, I had the fortune of meeting some awesome and like-minded people who had a similar vision so we co-founded Impact Academy.\nMe facilitating a workshop at a conference. (2019)\nALT\nMy decade vision\nI have three main ambitions for this decade (until December 31st, 2030):\nMake Impact Academy a world-class organization that runs ambitious educational programs to enable people to use their careers to solve some of the most pressing problems and contribute to a better future.\nFind the other half of an altruistic couple - a \"romantic co-founder\". Someone who wants to co-create a beautiful relationship where we can support each other in our missions to create a better world, grow, and create beautiful experiences. This could involve starting a family.\nBe a coach for some of the most impactful individuals and enable them to enhance their lifetime impact, become their best selves, and care for themselves and their loved ones.\nFacts\nHeight:\n183 cm\nAge:\n31 (1992)\nKids:\n65% yes: I’ll give it 65% that I will get kids at some point and 95% that I won’t get kids in the next two years (until 2026). Since I was 18, I’ve felt that the world is my family and haven’t had a need or drive to have my own kids. For several years, I wanted to adopt, but now I think that isn’t the best way to improve the world. Recently, that shifted for me and if I find a partner, I’m open to it (but not in the next two years) if it doesn’t significantly detract from our ability to serve the world.\nGender/Sexuality:\nStraight: I identify as a man, and I’m attracted to women.\nRelationship structure:\nMonogamish: Historically, I’ve found it difficult to find enough time for one partner and don’t have a need for multiple partners. I’m open to my partner seeing others if that makes her happy.\nLocation:\nOxford/London until at least mid-2026: 10-30% remote work is possible for that period. Open to moving after that (e.g., to the US) but I hope to set up a base (including a group house) with a partner in London.\nReligion/spirituality:\nAgnostic/atheist: I’m deeply grateful for the scientific method and the Scout Mindset. You might be somewhat religious or spiritual, but you’re more likely to identify as Atheist or Agnostic. That said, I have some sense of spirituality and have benefitted from some aspects of religion (especially secular Buddhism), and I hope you have too.\nMe at a salsa camp - almost feels like a different life now (2019).\nALT\nLinks\nHere are some of the books I’ve read throughout my life Goodreads (only a small subset of the books).\nHere’s my website.\nMe finishing a Spartan race with one of my best friends, Paul. (2021)\nALT\nAbout you\nBelow is my current hypothesis for what I’m looking for in a partner. If most of this resonates, then we might be a great match, though (in all honesty) you may be too good for me. 😊 Don’t worry about “ticking all of the boxes” - the most important thing is that most of these resonate with you. I’d much rather that you err in favor of reaching out (you’re probably awesome) than think that you “don’t tick enough boxes”.\nQualities and tendencies\nImportant stuff\nWe will likely be a good match if most of the following qualities are important to you.\nEthical and on an ambitious mission to make the world better.\nYou have a drive to make the world a better place and have used this as your guiding star during most of your important life decisions. You have engaged with several moral theories, and you likely find some form of consequentialism the most plausible, though you appreciate other theories. You might be particularly devoted to the betterment of future generations or think that the alleviation of suffering is more important than the promotion of happiness. You’ve probably been inspired by Effective Altruism (though may have significant reservations), but you’re at least positive about the core principles of wanting to improve the world and using reason and evidence.\nIntellectual and curious.\nYou find great joy in understanding things by using a scientific mindset. Holding accurate beliefs is much more important than being right to you. You’ve changed your mind on important issues, which led to you taking action, too. Even though it was weird or unconventional. You enjoy trying new things, are likely an avid reader, and find long (3 hours+) conversations enjoyable.\nGrowth-oriented and perhaps even a bit wise.\nGrowing as a person and becoming wiser is important to you. For many years, you’ve probably done things such as i) reflecting on your values, strengths, and weaknesses, ii) trying to optimize/systematize your life, and iii) cultivating virtues such as humility and kindness. You may have read books like Man’s Search For Meaning, The Seven Habits of Highly Effective People, and Peak and have habits like meditation, journaling, and tracking. You probably also love facilitating this for others.\nGlobally-minded (Cosmopolitan)\nYou’re globally minded and care about global affairs - from the more substantive and difficult to the lighthearted. For example, you’ll happily engage in a discussion on the relationship between the US and China and appreciate cultivating friendships with people from different cultures.\nLoving and affectionate yet strong and emotionally stable\nYou’re caring and attentive to the needs of others. You’d sense whether I’m happy or sad and make me feel cared for via your words and actions (and emojis ☺️). Bonus points if one of your love languages is physical touch. That being said, you have a fairly deep sense of who you are and some level of self-compassion. Consequently, you don’t let others’ perspectives and needs crowd out yours so you can set boundaries and express disagreements when you think it’s right.\nProfessionally, you’re likely to have tried many different things that involved bringing out the best in people and were deeply guided by the things above. You’re passionate and (at least mildly) obsessive about what you do. Perhaps you are (or have been):\nA social entrepreneur\nCoach\nEducator\nBuilder of communities.\nKids: You’re not in a hurry to get kids (definitely not before 2026).\nFacts and nice-to stuff\nPerhaps some of the following hold true for you, too.\nAge:\nIdeal: 25-35. Acceptable: 22-40\nHeight:\nIdeal: 163-180 cm. 160-185 cm.\nDiet:\nVegetarian/vegan unless you have good arguments not to be.\nOther things that are less important\nAbout us\nAt the highest level, I want us to co-create a beautiful partnership where we can support and inspire each other in our missions to create a better world while learning, building relationships/communities, and enjoying life. This will require experimentation, work, and direct communication.\nBased on my previous relationships, I’d love to do some of these things together:\n💓 Supporting each other through the most important ups and downs in life. Be it celebrating big and small wins or holding compassionate space for each other's imperfections.\n🖥️ Co-working. I expect both of us to be at least moderately obsessed with what we do, which makes co-working very valuable and deeply meaningful - this also works remotely.\n🫂 Getting to know each other deeply and creating a “shared language”. From having long conversations about the books we’ve enjoyed the most and what we’re doing professionally to coming up with cute idiosyncratic words and knowing each other’s journeys intimately.\n📕 Co-reading a book. I really enjoy sitting closely while reading a book. This also works remotely. Perhaps we’ll co-author a book one day.\n🤗 Cuddling and being close when we’re together (perhaps one of your love languages is physical touch).\n🎤 Singing songs (as mentioned, I’m a sucker for Alicia Keys but very happy to sing other songs) and improvised dancing 💃🏽.\n📝 Writing blog posts together, learning about important concepts or skills (I’m upskilling on AI these days), or co-hosting events such as intentional reading, lighting talks, yearly goal-setting, or world-building.\nThis is a picture from an intentional reading event I co-hosted. (2023)\nALT\nPast relationships\nI’m grateful for the previous romantic relationships I’ve been part of, and I think all of them are wonderful people. However, they didn’t work for some important reasons, and it’s valuable to learn from them. Here are some reasons why it didn’t work (work in progress).\nWhat I felt was missing (in some or all of the relationships):\nNot enough altruism and/or dedication.\nFelt I was the one who was taking the initiative and helping us grow\nNot being into intense intellectual conversations.\nWhat they felt was off (across some or all previous partners):\nI worked too much, didn’t prioritize them enough, and tended to talk too much about our work instead of their feelings.\nFelt I had too high expectations of them, which caused some anxiety.\nThem not liking long distance and/or us moving for professional reasons. I don’t love long-distance, but I can be happy while being apart if the initial base is there.\nNext steps\nIf this resonates deeply with you, please reach out to me on email (sebastian@sebastianschmidt.world). I appreciate directness! 😊\nAppendix\nBig-5 personality\nOpenness: 90%\nConscientiousness: 93%\nExtraversion: 75%\nAgreeableness: 80%\nNeuroticism: 20%"
    },
    "scrapeTimestampDetail": "2025-11-27T17:18:31.021535+00:00",
    "id": "usr_91520afa39",
    "docAccessible": true
  },
  {
    "name": "Neissa",
    "age": 26,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "San Francisco Bay Area",
    "locationFlexibility": "Some",
    "profileUrl": "https://bevel-atmosphere-4cc.notion.site/Ne-ssa-s-Date-Me-Doc-6f62593734914c5b9b57d482070205e9",
    "lastUpdated": "2024-03-02",
    "profileDetails": {
      "fullText": "Skip to content\n💘\nNeïssa’s Date Me Doc\nGet Notion free\n💘\nNeïssa’s Date Me Doc\nNeissa Dorsinville\n03/04/2024\nHi, my name is Neïssa (nay-ee-ssuh), read along and if you think we might be a good match, contact me.\n☺️ About Me\n26 years old, 5’2, Black Latina\nSingle, Monogamous and Cishet woman\nReligious,  Liberal\nOn a ferry to an island in Seattle\nALT\nAttending an art expo organized by a friend\nALT\nDragon Teeth in Hawaii\nALT\nMe as a cat for last Halloween\nALT\nOn a SF beach, overjoyed by the view behind me\nALT\nI am actively looking for a long term partner with whom I can reach goals, laugh, and start a family with.\nI’d love to connect with a man who, shares some of my values, has goals, is open minded, empathetic, considerate, is a good friend, son/brother/cousin etc, retains his individuality in the midst of chaos.\nIn Brief,\nI am a 26 years old Haitian living in California. I immigrated from Haiti in 2018. I have lived and went to college in New York and have been living in the South Bay for over 2 years. I am a sister, a cousin, a godmother, and a friend to many. I value family and friendships a lot and a continuous goal of mine is to maintain and nurture these relationships. I consider myself an introvert but can be outgoing in the right settings and with the right people.\nHobbies\nI like cooking and love trying new recipes, at least every month. They don’t always turn out how I want to but it’s always a good time and a fun experience (see my failed attempt at baking croissants and eclairs below)\nI lived on island for most of my life so I love the beach and feeling the warm sand in between my toes. I am also a sucker for a beautiful sunset and will always stop to admire and snap a few pictures (see below).\nI have tried many sports such as basketball, tennis, boxing, swimming, muay thai, and kickboxing. I’m currently doing the latter. My mantra is to try some things at least once. This applies to sports and other aspects of my life.\nWork, Volunteering\nI am software engineer now (I studied CS and Accounting) and I have dreams/goals to venture into other careers that are fulfilling and meaningful to me.\nI have mostly volunteered within the tech industry either as a mentor or a website developer for non-profit organizations in the Bay Area.\n💃🏾Things that excite me:\nFinding the solution to an implementation\nBoard Games (social deception are my favorites)\nVolunteering\nSpending time with loved ones\nTraveling\nFostering and Mentoring\nThings that make me laugh:\nBad jokes\nPuns\nDad jokes\nA bit of vulnerability here:\nHonestly this Date Me Doc alone is a huge step out of my comfort zone. If we were to meet on a dating app or out in the wild, I wouldn’t be the type to talk a lot so sharing this much is already a a huge step. Writing this was hard because I don’t think I have ever thought about myself to that extent. BUT writing this has also been nice. I love the person I am and am becoming.\n💘 Love compatibility\nMarriage is ultimately the end goal and would love to have children, with the right person.\nI show love through words of affirmation and act of service. I can be an overthinker so reassurance is greatly appreciated.\nIdeally, you are 26-42, with no children, but want some day. You, share some of my values, can be vulnerable, kind to others, caring, curious and open minded, enjoy deep talk, fun and playful to be around. You have goals and are actively working on them. You’ve seen or are seeing a therapist. You are aware of things that needs to be worked on. You get my weird humor.\n🚫 Non Negotiables\nNon LGBTQ+ Ally\nRacist\nConforms to patriarchal views of women in the workforce/home\nPromised Pictures:\nBeautiful sunset from SF (photo refuses to stay upright :’)\nALT\nFailed attempt at baking croissants (1)\nALT\nFailed attempt at baking croissants (2)\nALT\n☺️ Interested?\nIf this resonates with you at all or know a friend, contact me at neissa@dorsinville.com"
    },
    "scrapeTimestampDetail": "2025-11-27T17:20:12.421256+00:00",
    "id": "usr_eeb1bca3df",
    "docAccessible": true
  },
  {
    "name": "Sophie",
    "age": 31,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "London Flexible Asia",
    "locationFlexibility": "Some",
    "profileUrl": "https://www.notion.so/Sophie-s-Date-Me-doc-e372195429af4f5483c0142fd46cd660?pvs=4",
    "lastUpdated": "2024-03-02",
    "profileDetails": {
      "fullText": "Skip to content\nAnyone with a Notion account can comment on this page.\nSign up or login to comment\n💖\nSophie’s Date Me doc\nShare\n💖\nSophie’s Date Me doc\n💫\nHello stranger! My name is Sophie. I am an optimistic and cheerful girl with strong passion to explore the world. I am sincerely hope I can find an interesting soul to explore our beautiful life together.\nABOUT ME\nAge：31\nHeight：5‘9“ or 1.73m\nWeight：53kg\nZodiac sign：Capricornus\nRelationship style：Mono and heterosexual(looking for Male)\nNationality：China\nMy email address：shsph6@gmail.com\nMy pictures：(I am a product manager in risk management field who care about privacy. Apology for the mark of my photos.)\nWhat I am looking for\nLOVE MYSELF： I am an asian girl who love myself and love my life. I am independent and mature person who sincerely want a mutual soul that we can explore our beautiful life together. I take relationship seriously and i know what i want clearly. So let us ‘date’ each other on the premise of a kind heart and mutual respect.\nLOVE LIFE： I think that Life is a process of experience. I know myself better by experiencing the world. I have traveled many countries, like the UK, France, Italy ,South Korean, Thailand, Japan etc.  I can see there’re variety of ways to live in the world. Different people in different countries live in their own ways. I can figure out what kind of life i want exactly through traveling. I want my life to be：with a man i love, with some achievement in my work, with the expectation in my day.\nLOVE THE ONE：In my imagination, I think you should be also a mutual person who know what you want clearly. You should be kind, and responsible enough to start a relationship. Our relationship will be simple and happy. We will get together only because of LOVE, but no other reality factors, such as money, the needs of having kids or a spousal visa…\nThings I like:\nNate Okhuysen\n08/12/2024\nAdd: block\n… more\n1 comment\n08/22/2024"
    },
    "scrapeTimestampDetail": "2025-11-27T17:21:53.891484+00:00",
    "id": "usr_720699db56",
    "docAccessible": true
  },
  {
    "name": "Nurdaulet",
    "age": 20,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "Asia",
    "locationFlexibility": "None",
    "profileUrl": "https://www.notion.so/invite/2ad42cdc7a96d6580cc209da189adb166eff3fd4",
    "lastUpdated": "2024-01-12",
    "profileDetails": {
      "fullText": "English (US)\nYour AI workspace.\nCreate your Notion account\nContinue with Google\nContinue with Apple\nContinue with Microsoft\nLog in with passkey\nSingle sign-on (SSO)\nWork email\nUse an organization email to easily collaborate with teammates\nContinue\nBy continuing, you acknowledge that you understand and agree to the Terms & Conditions and Privacy Policy"
    },
    "scrapeTimestampDetail": "2025-11-27T17:23:35.127729+00:00",
    "id": "usr_b4980f011e",
    "docAccessible": true
  },
  {
    "name": "Harrison",
    "age": 23,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "Madison",
    "locationFlexibility": "Some",
    "profileUrl": "https://bolder-throat-20d.notion.site/Planting-Seeds-8ede85b1c0d445d0916e9810c2fb7a2b?pvs=4",
    "lastUpdated": "2023-12-28",
    "profileDetails": {
      "fullText": "Skip to content\nPlanting Seeds\nGet Notion free\nPlanting Seeds\nwinter 2023, committed to putting more cover crop on the dinner table (rye, turnips op cit.)\nBasics\nHarrison\nI want a place for my thoughts to hang out,\n— and I want to know what you think about them little ones\n🦙 send me things!\nI think this is really cool opportunity to develop a personal statement.\nMy desire to document growth motivated me to write this.\nI guess in a more personal and complex way than I have historically,\nWhat I have done historically\nMost of all though, to leverage the power of the internet to meet you. The world is so big, and we are so immense. If I have the tools, it feels like a waste not to put myself out there.\nGoals\nin order of priority\nConnect with people I wouldn’t normally get to in my daily recourse\nGet feedback, ideas, and constructive criticism on my thoughts on my own terms, i.e. no social media competing for my attention\nFind a life partner\nwha..?\nValues\nnot in order of priority, because they are all equally wild and important\nActive compassion for all living things\nalways give a mouse a cookie, despite the conclusion of Numeroff, Bond et al.\nEmpathy, and by default assuming positive intent\nin contrast to the belief system I was raised with, I believe people are fundamentally good and need help finding that in this cosmic gumbo we find ourselves in\nShare a laugh at least once a day.\nfreakin frack.\nThings I Do\nregularities:\nirregularities:\n🍍odds and ends:\nstuff I like\nstuff I like less\nNext Steps\nClick above llama ^\nor below llama\n🦙 send me things!\nxo,\nHarrison"
    },
    "scrapeTimestampDetail": "2025-11-27T17:25:16.796968+00:00",
    "id": "usr_a316ad1ed3",
    "docAccessible": true
  },
  {
    "name": "Nancy R",
    "age": 64,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "PA",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://second-capricorn-6c0.notion.site/Nancy-fb6ce581497a40e983fd353185d151fb?pvs=4",
    "lastUpdated": "2023-11-06",
    "profileDetails": {
      "fullText": "Skip to content\n🌲\nNancy\nGet Notion free\n🌲\nNancy\nTrue love includes a feeling of deep joy that we are alive. Thich Nhat Hanh\nBIO\nBorn 1959 in Niagara Falls, NY\nB.S. Forestry from University of Montana\nLive in Pittsburgh, PA\nStraight female\nNever married\nRetired since 2016\nAdult son (35)\nLibertarian\nUnited Methodist\nHow I spend my time\nI’m very active in my church\nCommunity\nI love to walk, hike, bike\nTravel\nI enjoy Pittsburgh sports\nFriends\nSelf-Improvement\nLooking For\nLong-term monogamous relationship\n60-70 year old man\nComfortable with yourself and your own interests.\nWilling to give us each our space\nLikes to have fun and travel\nSomeone to grow old with"
    },
    "scrapeTimestampDetail": "2025-11-27T17:26:58.082453+00:00",
    "id": "usr_8d798f2ac8",
    "docAccessible": true
  },
  {
    "name": "Furqan",
    "age": 24,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "Los Angeles Dubai",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://www.notion.so/anmolnetwork/Who-is-Furqan-7759f82564184a4b9d6b9966440d1fbe",
    "lastUpdated": "2023-11-06",
    "profileDetails": {
      "fullText": "Skip to content\n🌟\nWho is Furqan?\nGet Notion free\n🌟\nWho is Furqan?\nHello there!!\nWelcome to my date-me-doc! Hopefully you find what you are looking for, if while reading this you feel a connection I encourage you to reach out to me at nblogist1 @ gmail.com .\nRemember you don’t need to meet the “requirements” 100% and  you hopefully think that I do not need to meet yours by 100% either, I truly believe in getting to know each other, being flexible with one another, growing together and making some changes to adapt for the best :)\nAsk me: how I traveled internationally without a passport. 🛂\nPICTURES!\nWho am I?\n1 Word edition:\nPassionate\nDriven\nTraveler\nAdventurer\nSwiftie (just a little :) , not the friendship bracelet level)\nTraditional\nDetails:\nI am 24 years old living in Dubai; While also technically living nowhere due to being a global citizen. I grew up in Karachi, Pakistan 🇵🇰, so you know I have got those good genes ;), moved to Dubai very well into my nomad journey; Been to over 10 countries yet! Have lived for an extended period of time in 4 countries. 🇹🇷 (Turkey) has a very special place in my heart (Guess how many times I have been, make sure to add this in the email for a chance to win a prize!)\nPassionate / Driven: Although I have been in love with computers since grade 1 and literally graduated in (Software Engineering). I have always have had love for business, starting my first serious venture at the age of 17.\nOne of my recent adventure lead me to start a natural stone, mining, fabricating and import/export of Natural Stones like Marble, Onyx, & Granite.\nTraveler /Adventurer: I love hearing, learning and understanding people from different backgrounds, this usually takes me to far edges and deep inside the countries I visit. I love to understand different cultures religions and love to learn about people’s lives. I also LOVE seeing different landscapes, I love history and have an imagination, a longing to know answers.\nSwiftie: Haven’t been to the Eras Tour but done the movie and might attend the Singapore tour next year. My friend pointed out that I have an abnormal number of TS songs and that I am a swiftie. Although I have seen how passionate swifties are, I am not as much. I just like the songs, some of my favorites being: August, Back to December, Shake it off, Love Story, Anti Hero, Paper Rings, and getaway car. Country Roads is also one of my fav ones! (Do mention some of your fav songs in the email! Excited to hear from you!)\nTraditional: Growing up in Karachi with my diverse family has instilled traditional values in me. I grew up in a very accepting, diverse, loving environment and that reflects in the way I carry myself, and how I interact with people around me.\nWho am I looking for? - I wrote an article earlier about this here."
    },
    "scrapeTimestampDetail": "2025-11-27T17:28:39.608876+00:00",
    "id": "usr_36af460751",
    "docAccessible": true
  },
  {
    "name": "Marta",
    "age": 35,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "Central Europe",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://martakrzeminska.notion.site/Date-Me-17435416720c439b8d6725d690808f55?pvs=4",
    "lastUpdated": "2023-10-11",
    "profileDetails": {
      "fullText": "Skip to content\nDate Me\nGet Notion free\nDate Me\ntl;dr A curious and adventure-seeking EA/rat-adjacent woman with a passion for personal growth and effective communication looking for strong connections. Currently not open to new romantic or sexual partners. Want to reach out for other reasons? See options here.\nCreated on: @September 28, 2023\nLast updated on: @October 9, 2025\n✅ Basics\nName: Marta\nLocation: Currently in Bremen, Germany for the foreseeable future\n(when dates) is looking to date: men\nRelationship style: currently monogamous\nCurrently: partnered\nDoesn’t want kids.\nPersonality summarised in a meme\nSolving the world’s most squeaking problems.\nALT\n🧭 Navigation aka ToC\n💁‍♀️ What you’d be getting into\n💡\nSome labels I identify with*: vegan, atheist, effective altruist, aspiring rationalist, eating disorder, digital nomad (now ex).\n*with a caveat “keep your identity small” (PG)\nOn a good day my autocomplete is like the old, GPT-2 with high temperature. Random, but not always appropriate. It shows in thought jumps, abstract (sometimes not very PC) humour, and high openness to new experiences.\nOn a bad day, my world view becomes narrow and negative. There are in me parts that are self-critical and sometimes won’t shut up, especially about intellectual performance and body shape.\nSelected thinkers & media that influence(d) me: Sam Harris, Finite and Infinite Games (James P. Carse), Kurzgesagt, Spencer Greenberg, Y.N. Harrari, Tim Ferriss, Tsurezuregusa (Kenkō).\n😆 Laughing. Examples of things I find funny\n⭐ Amazing. Top features to be aware of\nClick the arrows for examples\n🙃 Adventure seeker (but also a badger). I enjoy new experiences, especially if they involve new/body sensations and comfort zone expansion. At the same time, I need a lot of time for myself, or just hiding from everything. It’s sometimes challenging to discern whether it’s adequate boundary preservation or a way to excuse avoiding challenges.\n🤩 Projects, plans, excitement! I usually have side-projects and self-development goals that I work on alongside work. Organising events or outings for groups of friends is something I gravitate towards. In the best of moods I like to break or play with social conventions.\n😺 Curious communicator. Several people have remarked that I have good communication skills, which makes it easy to talk to me. I aspire to be more comfortable with tell culture, try to practice NVC, and enjoy exploring different ways of understanding relations between people (authentic relating, circling).\n⏰ Organised. Being tied to my schedule gives me a sense of comfort. In extreme cases I become quite anxious when my schedule faces a danger of being disrupted. When I spot this tendency, it’s a sign to deliberately disrupt it, typically by travelling somewhere.\nBONUS! Want to see results of some personality tests?\n😠 Challenging. What others can find difficult about me\naka previous dealbreakers or just things that were somewhat hard for others, these are basically the other side of the coin of the top features above!\nI sometimes work a lot. I like to talk about my work, because I also try to work on projects that feel meaningful and interesting. Together with personal projects, it means my time is limited. It can be hard to incorporate into it a relationship with someone who doesn’t share many of my interests or goals, or doesn’t want to participate in the events I organise.\nI often need to spend time by myself/keep a lot of bandwidth for myself. This is aside from work time, relationship time, and previously organised social time. This can be a dealbreaker for people who need a lot of attention from their partner.\nI ask many questions and often need many clarifications about what others mean. People who are not used to this style of communication can see it as antagonistic, or motivated by a specific capital-A Agenda. In reality, I deliberately try to avoid Agendas.\nOut-of-norm way of dressing or behaving in public places—some find this uncomfortable. Are you one to play along?\nI have eating habits and food-related behaviours that can be seen as strange. E.g. My main sustenance for days on end can be potatoes with mustard, or buckwheat with broccoli. I also have irrational aversions towards specific food items (e.g. will not eat pizza), so cooking for me can be hard. For people who love sharing three meals a day, or for whom food is a central point of focus, this can be challenging.\n✌️ Doing. Hobbies, interests, goals\n7 years of trying\nALT\nI treat my plushies to a lavish life.\nALT\nCrafts of all kinds!\nALT\nCanoeing!\nALT\nMaking gifs of myself is among the things I do\nALT\nI have some distance to myself, and am not ashamed of wearing this bucket on my head in a Russian banya.\nALT\nWork-wise see LinkedIn.\nExercise. I do sports everyday, admittedly somewhat compulsively. Usually strength or running. I’m always up for trying more sports. Recently embraced my millennial girl destiny ✌️and got into yoga (power and aerial hammock).\nProjects. I like to make things, virtual (e.g. no code apps) or real (e.g. collages, objects). I’d like to make more. Examples.\nWoo-adjacent and “weird” activities. I’m curious to explore what strikes me as weird, mystical, or new. You’ll see me attending ecstatic dancing events, cacao ceremonies, non-verbal communication workshops. My epistemological foundations should be sound enough to protect me from adopting any aura-based worldviews that are often prevalent among the crowd that attends these events.\nThings I like to, or find easy to talk about: language learning, start-ups, product development, productivity tips, sleep optimisation, relationships, anki.\nA (definitely non-exhaustive) list of things that I want to try, do more of, or learn:\na museum visit\nALT\n🙅‍♀️ What I’d not be getting into\naka. my dealbreakers\nLack of self-awareness or ability to take responsibility and work through one’s own issues. We all have problems. I expect a partner to be aware of theirs and actively work on them.\nLack of acceptance for the idea of reducing the consumption of animal-based products. If not vegan, I’d like a partner to be at least open to eating less meat. Being a judgemental prick about vegans is a dealbreaker.\nBeing tied to living in one place. Travelling is an important part of my life, and I’d like my partner to travel with me at least some of the time. In the long-term (ok, even mid-term) I’d like to have “a base”—one city that I feel bound to. But, even then I envision spending 3-6 months a year somewhere else.\nAversion to sexual exploration. I’m kinky enough to have a FetLife profile and occasionally attend fetish parties and sex/body-positivity workshops. You don’t have to always join me, but a total lack of interest would be a dealbreaker.\n🫶 Togethering. Relationship views & preferences\nHow I’d like for both of us to feel when we’re together.\nI’m looking for a stable partnership/companionship where we protect and prioritise each other, while staying separate individuals. It’s important to me that we inspire and support each other in becoming better versions of ourselves, whatever it means to each of us.\nThey say: you’re an average of the five people who you spend most of your time with [citation needed]. I want to share—and make an honest attempt to live by—the same values.\nWhat are these? Some ways of thinking about it:\nMy intrinsic values: Freedom, Truth, Learning, Virtue, Non-Suffering [1]\n12 virtues of rationality\n5 secular values*: truth, compassion, freedom, courage, responsibility. (*which I believe I got from Y.N.Harari, but Google’s not helpful finding the quote)\nHow do we do it?\nPffff, you tell me! We talk (a lot), we question each other’s views, we try new ways of learning about ourselves, read poems, write code, dance, take psychedelics, whatever’s necessary.\nIn short, we try to work on it.\nBecause relationships are work.\n(I realise, I’m making this a hard sell. 🙃)\nIn reality, we’ll probably first vomit on each other our childhood and relationship traumas and see how they interact. We’ll have to deal with it—it’s healthier to do it consciously and and openly.\nThe status quo of relationships seems to be that you become emotionally entangled to some degree. It’s fun to be all about each other for like 3-5 months, but is suboptimal in the long term. Enmeshment is the Moloch of relationships, and fighting it requires some effort. Answering the timeless question “where do I end, and where do you start?” will likely be an ongoing project for us to work on (but that’s not a bad thing!).\nI also see us living as a part of a community or a group of friends, not as an isolated unit that exists against the whole world.\nI’m very conflict averse. I prefer to keep a “low-threshold”—bring up every small thing that I find bothersome, discuss every minor interaction that seemed awkward. I believe that this approach—based on radical honesty, mindfulness, and authentic relating practices—helps prevent resentment and larger disagreements from arising. Generally speaking, good communication is good!\nI realise this^ can sound a bit heartless or bitter.\nSo.\n🌊 ………….. To put it more poetically …………….. 🌊\nI’d like us both to feel comfortable sharing silence.\nBut, also to sometimes go out to party together until 4 am [2].\nI’d like us both to give each other freedom to explore the world separately to then recount stories about what we discovered.\nBut, to also have a shared goal, worldview, an idea or project we aim towards or build together.\nI’d like us to write poems and read Less Wrong, build sand castles and destroy false beliefs [3].\nAnd, if we decide to not be together anymore, I’d like us to not regret the time we shared.\n💌 What now? Contact\nIf you got to here (thanks for reading!) and think that:\ndating Marta sounds like it could be your game 👉 write to me at SoYouWantToDateMarta [at] gmail [dot] com\n→ ❗As mentioned above, I’m not currently emotionally available for dating. I’ll take your email as expressions of interest for the future.\n→ send me your dating doc if you have one!\nit’d be cool to be friends (or just found this an entertaining read) please write! Getting even just two sentences of positive vibes/feedback will make my day.\n“omg, her and my friend [NAME] would really get along!”, feel free to forward this doc to your friend [NAME]!\nyou’d rather love to hire Marta as a marketing pro (not an unlikely result), add me (but write a note too) on LinkedIn\nWhat if you already know me?\nI recognise it might feel awkward to bring up the dating topic in a regular conversation. To open the topic of a potential more-than-friends interest, feel free to contact me through the regular channels (WS, Telegram).\nI know it requires a lot of vulnerability to do that, because: What if I’m not interested? If I’m not, I’ll gently tell you that, and we’ll stay friends.\nIf you think you’ve already signalled romantic interest in a regular conversation and I didn’t respond (e.g. you tried flirting and I didn’t flirt back), I’d still encourage you to write to me. I can really be blind to these signals. Unless I’m explicitly told “hey, I like you. Do you wanna go out with me for like a date-date?”, I might not get the message.\nFootnotes:\n[1] Based on Clearer Thinking Intrinsic Values Test. [⤴️ back up]\n[2] Alternatively: Create art, Read Less Wrong, Update beliefs, Delete boundaries to happiness. ← not as poetic as I’d like, to but I couldn’t not make a CRUD reference. [⤴️ back up]\n[3] On those rare days when my inner party raccoon decides to be up past 10 pm. [⤴️ back up]\n🍭\nYou clicked it!"
    },
    "scrapeTimestampDetail": "2025-11-27T17:30:20.934624+00:00",
    "id": "usr_8ab426951e",
    "docAccessible": true
  },
  {
    "name": "Kaushik Donthi",
    "age": 26,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "San Francisco Bay Area NYC",
    "locationFlexibility": "Some",
    "profileUrl": "https://www.notion.so/Kaushik-Donthi-11d723154a764520a5e900daa6db6f4d#8b65a4bdce3f4dbaa441f8848aab0c74",
    "lastUpdated": "2023-09-30",
    "profileDetails": {
      "fullText": "Skip to content\nYou’re almost there — sign up to start building in Notion today.\nSign up or login\n🦆\nDate Kaushik Donthi (Me)\nShare\n🦆\nDate Kaushik Donthi (Me)\nTable of contents\nProblem statement\nGoals\nNon-goals\nProposed solution\nInterests and Hobbies\nValues\nPictures\nSuccess Criteria\nImplementation and rollout plan\nProblem statement\nI decided to use one of the Engineering solution templates from Notion, so my problem is figuring out how to use this without making people think I need a group of overpaid college graduates to fix me.\nBut really, my goal is to find a loving, rewarding relationship with a female I am interested in and for whom I am willing to sacrifice the time necessary to build a relationship. Someone who is kind, intelligent, silly, curious, courageous, and empathetic. And very importantly, someone who is emotionally mature enough to realize the kind of work and sacrifices that a relationship entails.\nI am pretty flexible about the actual location, since my job is usually remote. Buttt I am a sucker for good weather - I’ve lived in the Bay Area for most of my life and in Malaga, Spain for a little bit so I am not going to pretend that living in Norway would be perfect for me. But love transcends all, right? 😛 I’ll try to use some of the existing fields in this template that I find are surprisingly appropriate or just funny.\nGoals\nIdeally - find someone who is compatible with me in a relationship sense by showing them this document and some pictures of me, at which point they will fall hopelessly in love.\nNon-goals\nMeeting more guys. Just kidding! If you think we would be two cubes in an ice tray, regardless of what your gender is, then totally message me and we can haaanggg. See “Implementation and Rollout Plan” for contact details.\nProposed solution\nMeet a lot more girls with the openness to a relationship or just a friendship depending on how we feel about each other. I see either as a win, but I want to be clear that my intention going into a meeting is 80% to date and 20% to be friends. To be clear, I love having a relationship that has the foundation of a friendship. But I am not sure how this is possible unless we read this doc, signed a binding contract to be friends, erased our memories, and then one day felt that we could be more.\nI think it’s easier going from “Ah I don’t see this working out as a relationship, but we can totally drink boba like every 5 weeks” rather than “Hey we drink boba like every 5 weeks, but I want to see you again tomorrow.”\nInterests and Hobbies\nProgramming - I am a software engineer who has worked for blockchain companies (trading and gaming-related) and I am extremely grateful that I truly enjoy my work! I love building things with an end customer in mind and I find it awesome that solving cool problems can make peoples’ lives better. Somehow, I think the universe was beautifully designed that way.\nMath/Physics\nI kind of have this weird liking for math competition problems and I think it is so beautiful how we can create abstractions to describe the physical world\nI have explored ML, but I frankly don’t really like things that are that much of a black box to the point where we are just working backwards to find the motivation from the implementation\nI used to be really bad at physics in high school and kind of hated it, but in college I decided to try to do my best and I actually ended up really liking it and I was a teaching assistant for a couple of physics classes\nStrategy Games\nReally Like\nCatan (I love the 1v1 version of Colonist, I was ranked Diamond two seasons ago and btw the username is from Looking for Alaska by John Green haha)\nSecret Hitler\nSoccer\nLove/Hate\nChess\nTennis (love watching it though)\nHate\nUno (is this even strategy?)\nLosing (in honesty, I can get pretty competitive sometimes haha)\nBeing active\nRunning\nSwimming Way Too Deep in the Ocean (SWTDO)\nRowing\nComedy\nImprov (for me, humor compatibility in a relationship is huge and if I can do a bit with you, that is a huge plus)\nConan O’Brien <3\nValues\nHonesty\nI am the kind of person who tries to say what is on his mind in a compassionate, caring way towards myself and others\nI think short-term discomfort is worth long-term growth\nI really resonate with the quote from the Kite Runner, “That's the thing about people who mean everything they say. They think everyone else does too.” It just means to me that if we both trust ourselves to be honest, we can assume good intention and it just makes things soooooo much easier (and we can also move much faster haha!)\nGentleness/Kindness\nI don’t feel like a man needs to be “assertive” or “dominant”; I think being gentle and kind is strong in it’s own way\nI think being kind and loving and holding someone’s heart with care are so much more important and I want to be with someone who values the care I give to them\nFighting Well\nI think in a relationship fights are inevitable, but I think healthy relationships fight well\nPhysical violence is not okay, as are demeaning comments\nWe try to argue our points to the best of our knowledge and acknowledge good points from the other side\nWe are both mentally healthy enough that we do our best to make it work but have the power to walk away at any time\nHealth\nI have become much healthier over the last 7 or 8 years and I would love to meet someone who also cares about what they put in their body\nI love to exercise on a regular basis, whether it is swimming, running, rowing, or playing soccer\nI don’t expect my partner to be interested in the same activities (I guess this goes for really everything I’ve said so far haha)\nAlso pretty into meditation, although my view on its importance has changed a lot over the past few years\nSelfish Altruism with a Mix of Loving Without Expectation\nI think it is important to figure out what brings you joy and how you can use that to bring joy to others\nBare altruism is rarely a good long-term goal - how many vegetarians/vegans have you met who did it for the sake of the world but gave up because of how futile they felt their attempts were in making a dent in the animal consumption problem?\nFor me, becoming almost fully vegetarian/vegan was a decision inspired by my getting healthier and looking better\nBut I think loving yourself allows you to love others best :); and loving without expectation is the best way to show up in life and in a relationship - that love doesn’t have any promises; you just have to be grateful for every moment, and enjoy every single moment\nCuriosity/Playfulness\nI love being just fun and silly and weird and my humor can be dirty sometimes with people I feel comfortable with, and I hope to find someone I can play with for the rest of my life\nI think that the universe is somehow inherently playful - it does without any purpose and it rewards joy and spreading happiness\nI think everything is connected from chess to physics to swimming to flowers and I love to find and think about these connections\nBelief/Confidence/Ambition\nI truly believe that the universe works with you on goals you really believe in and that the universe responds when you ask it for something and put a full-hearted effort into it\nI think working towards goals that ignite us is what we live for and it’s important to me that my partner is decently ambitious as well\nPhysical Connection\nPhysical touch is one of my love languages, so I would ideally like to be with someone who also likes that :)\nI think sex to me is a part of expressing love in a relationship, and while it shouldn’t be at the forefront of what’s going on, I think it’s important that there is good physical compatibility\nI don’t think about sex that much at all, unfortunately, so I can tend to be bad at initiating; however, this is something I am happy to work on\nPictures\nAnd here are some (silly) pictures of me! I guess if I had to describe myself, I am a 5’ 10.5’’ guy who tends to be kind of skinnier/toned side. A lot of these are in Europe (I lived in Spain for a bit last year!) and I switch a lot between having and not having a beard, so I’ll include pictures of both 🙂\nI didn’t even get to go to the top :,) But maybe we can?\nALT\nYeah I guess you could say I get a lot of kudos\nALT\nWhat’s up with my posture lmao\nALT\nDon’t show this to my mom (I’m a momma’s boy if you couldn’t tell)\nALT\nJust for balance, a picture my mom probably likes\nALT\nSuccess Criteria\nHow will you validate the solution is working correctly?\nHopefully, we can be very open with each other if we think things are working out. I am sometimes really good but otherwise hopelessly lost in reading signs from girls.\nI also don’t want to waste either of our time - I think a relationship is an opportunity cost and I hope that we are both gaining something from our time together to make up for it.\nWhat monitoring and alerting will you do to ensure this project doesn’t decrease performance and reliability?\nI will constantly ask ChatGPT 4.5 to tell me what I am doing wrong\nImplementation and rollout plan\nIf you read all that and you think you still want to meet me, I guess maybe you’re pretty cool yourself.\nHaha, did you actually fall for this big pile of steaming …? Okay sorry, like I said my humor can be a bit strange sometimes. Hopefully, you didn’t actually stop reading. Or if everyone stopped reading, would anyone ever read this? I wonder if I could just write whatever I wanted down here. Like YO MAMMA IS SO FAT, THAT SHE GOES THROUGH A LUNAR CYCLE EVERY TIME SHE PIROUETTES. Who said my jokes were good?\nJeez, okay… I will try to be serious for like 20 seconds. If you think we would be a good fit, text me at (plus one) five one zero, seven seven one, four nine one four. Or email me at kaushikdr@gmail.com. Or do both?"
    },
    "scrapeTimestampDetail": "2025-11-27T17:32:02.367657+00:00",
    "id": "usr_b1185a9599",
    "docAccessible": true
  },
  {
    "name": "Mahir Jayswal",
    "age": 24,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "Oregon",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://www.notion.so/Mahir-ec780fc3880e4a149a4969ad9137705c?pvs=4",
    "lastUpdated": "2023-09-14",
    "profileDetails": {
      "fullText": "Skip to content\nMahir\nGet Notion free\nMahir\nEmbracing the Journey of Technology, Travel, and Taste 🚀🌍🍽️\nGreetings, fellow explorer of the digital cosmos! I am Mahir Jayswal a dedicated Software Engineer at the esteemed Capgemini IT Company. 🖥️ Hailing from the vibrant state of Gujarat, India, I currently find myself immersed in the dynamic tech landscape of Bangalore.\nA Tech Explorer with a Taste for Adventure:\nBeyond the lines of code and the realm of debugging, I find solace and inspiration in the world of literature. 📚 A bona fide bibliophile at heart, my free moments are often consumed by the written word. From captivating novels to insightful tech manuals, each page turned is a step closer to expanding my horizons.\nTraversing the Uncharted Territories:\nVenturing far beyond the confines of my workspace, I've embarked on numerous journeys that have taken me through the mesmerizing landscapes of South India. 🌄 From Kolkata to the historic ruins of Mysore, every destination is a canvas upon which I paint memories. My YouTube channel serves as a testament to these exploits, offering a glimpse into the harmonious marriage of technology and travel. Through my videos, I strive not only to capture the essence of the places I visit but also to shed light on the technical facets that make these explorations possible.\nA Symphony of Knowledge:\nFueling my quest for learning, I've carved out a niche in the digital domain with a blog channel that delves into the depths of technology, programming, and beyond. 💡 My writing is a manifestation of my unquenchable thirst for knowledge, delivering valuable insights to those who seek them.\nA Culinary Odyssey and the Call of the Wild:\nWhile my fingers dance across the keyboard to craft code and captivating content, they are equally at home in the realm of cooking. The culinary arts have captured my fascination, leading me to experiment with a myriad of flavors and cuisines. 🍳 This mirrors my approach to life itself – a constant experimentation and blending of diverse elements.\nTrekking through nature's wonders and hitchhiking along the road less traveled are pursuits that invigorate my spirit. The thrill of the unknown and the allure of discovery guide my steps, both in the wilderness and in the world of tech. 🏞️🚗\nSeeking a Like-Minded  Adventurer:\nAs I continue to traverse the intersections of technology, travel, and taste, I am on the lookout for a kindred spirit. An individual who, like me, revels in the sensory pleasures of gourmet delights, craves the thrill of uncharted destinations, and finds solace in the pages of a well-worn book.\nSo, if your heart beats to the rhythm of exploration, if your taste buds tingle at the mere mention of exotic flavors, and if your mind eagerly absorbs knowledge like a sponge, then perhaps we are destined to embark on a shared journey through the digital and physical landscapes that lie before us.\nMy love languages are quality time and personal touch! I’m pretty independent and self-sufficient, but I love hanging out and spending downtime with my loved ones. I also would love for someone to encourage my more spontaneous side!\nLet's connect and embrace the adventure together! 🤝\n‼️ More about me!\nThe things I do in my free time…\nThe things I can’t get over…\nDon't see this is secret 🙈\n2024 RECAP  : Click here\nContact Information:\nYouTube Channel :  click here\nBlog Channel: click here\nInstagram : click here\nLocation: Bangalore, India\nThings I like\nthese all are 0.001%  of my collection\nBooks 📖\nThe Almanack Of Naval Ravikant\nWise and Otherwise by Sudha Murthy\nTuesday with Morrie\nAtomic Habits\nAnimal Farm by Gorge Orwell\nstay hungry stay foolish\nMovies 🎬\nThe Shawshank Redemption\nthe founder\nwhiplash\nking Richard\ndead poet society\ngood will hunting\nEnola Holmes\nSound of Metal\nInto the wild\nSchindler’s List\ncast away\nMitty\nDocumentaries 📽️\nChernobyl\nThe Last Dance\nThe Social Dilemma\nPodcast 🎧\njoe rogan\nhuberman labs\nHabit coach\nMusafir stories\npaisa paisa\nankur warikoo\npostcards from nowhere\nTake a pause with Varun Duggirala\nTed Talks\nMahabharat by Dhruv Rathi\n💬 Subscriber Reviews\n(AKA: What my friends think about me!)\n“ He’s charming, intelligent , and super ambitious.”\n“ Any time up for travelling or any trip!”\n“ Give lot of good reccos… about anything in world & encourage you to do things which makes u happy ”\nPhoto Gallery\nMarine beach, Chennai\nALT\nHyderabad\nALT\nPondicherry\nALT\nMehrangarh, Jodhpur\nALT\nMadikeri,Coorg\nALT\nTriveni Sangam, Kanyakumari\nALT\nRameshwaram The End of India\nALT\nKollam, Kerala\nALT\nVarkala\nALT\nAlleppey\nALT\nKochi\nALT\nHampi\nALT\nDussehra in Mysore\nALT\nCoffee woods Chikkmanglur\nALT\nIIM BENGALURU\nALT\nAdiyogi, Coimbatore\nALT\n2024 RECAP :\nM\nMahir Jayswal\n12/28/2023\nTriveni Sangam, Kanyakumari\nM\nMahir Jayswal\n03/16/2024\nIIM BENGALURU"
    },
    "scrapeTimestampDetail": "2025-11-27T17:33:43.886362+00:00",
    "id": "usr_6604a51053",
    "docAccessible": true
  },
  {
    "name": "Laurence",
    "age": 31,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "NYC NJ",
    "locationFlexibility": "None",
    "profileUrl": "https://sneaky-pull-671.notion.site/Date-Me-Laurence-647c3bfdc34240418822cfe333077927?pvs=4",
    "lastUpdated": "2023-09-08",
    "profileDetails": {
      "fullText": "Skip to content\nDate Me: Laurence\nGet Notion free\nDate Me: Laurence\n👉\nAbout Me:  Hi, I’m Laurence and you found my Date Me Doc! (which i found out via this article people do this lol) I’m an Asian American raised in NJ, currently works in NYC, and after meeting so many emotionally unavailable people via dating apps, here i am to find someone who is available. I like sharing random things so i’ll try not to scare you off here, but check out my profile (fyi this really reminds me of myspace iykyk).\n🎂 31    📏 5’6 (167cm)   📍NJ/NYC    ♌️ Leo    ❤️‍🔥 Monogamy    ❤️ Straight    🍷 Yes\nTable of contents\nPhotos\nValues\nWhat I Value and look for…\nLifestyle\nLove Languages?\nInterests\n🎶 Music\n📚 Books\n🎬 TV/Movies\nFood\n🍗 Places I enjoy going\n🍣 Places I want to try (please take me lol)\nHot Takes\nFood\nHobbies/Activities\nMisc\nWhat I Find Funny/Amusing\nWhat Others Have to Say…\nQ&A\n📮 Have any random questions for me? Submit here\n📧 How to contact me?\n📌\nReminders\nIf possible, please turn on your video camera\nWe’ll do live Q&A at the end\nWe're keeping the programs light today, so there's more time for FAQ\nPlease add your questions in the Zoom chat during the all-hands\nIs this here intentionally…\nPhotos\nI swear I look better in person\nValues\nWhat I Value and look for…\nLifestyle\nLove Languages?\nInterests\n🎶 Music\n📚 Books\n🎬 TV/Movies\nFood\nobvi this needed its own section\n🍗 Places I enjoy going\n🍣 Places I want to try (please take me lol)\nHot Takes\nFood\nHobbies/Activities\nMisc\nWhat I Find Funny/Amusing\nWhat Others Have to Say…\nTO BE FINISHED SOON\nQ&A\nI will gladly answer questions I find funny or interesting with answers here.\n📮 Have any random questions for me? Submit here\n📧 How to contact me?"
    },
    "scrapeTimestampDetail": "2025-11-27T17:35:25.209558+00:00",
    "id": "usr_da31a54b44",
    "docAccessible": true
  },
  {
    "name": "Cher Hu",
    "age": 24,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "San Francisco Bay Area NYC",
    "locationFlexibility": "Some",
    "profileUrl": "https://ritzy-aura-6c9.notion.site/Cher-s-Date-me-doc-5ae9cbebd5c64804a0f91675ae2cbc3d?pvs=4",
    "lastUpdated": "2023-09-05",
    "profileDetails": {
      "fullText": "Skip to content\nCher’s Date-Me-Doc\nGet Notion free\nCher’s Date-Me-Doc\nUpdate: I’ve found my person. I think there are some cool people on the directory, so feel free to reach out to me if you want to be friends. All the best :)\n👋 I am a 25-year-old female living in San Francisco.\nWho am I at the core: A humanist, thinker, and a free agent in this world; someone who believes in beauty as my primary value and what makes life worth living; an empathetic person; a human seeking truth of the world as much as the lived experience (or “phenomenology”) of other humans; a moral nihilist (in that I don’t believe in objective moral values) who spends a lot of time inquiring about personal values guiding my decisions, and how those decisions impact the lived experience of other people and structural inequalities.\nWhat I want\nPersonality\nValues\nOn Partnership\nInterests\nMy past and future\nReading and writing\nYou"
    },
    "scrapeTimestampDetail": "2025-11-27T17:37:06.530258+00:00",
    "id": "usr_91f5407cf3",
    "docAccessible": true
  },
  {
    "name": "Jake Gloudemans",
    "age": 25,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "DC Philadelphia",
    "locationFlexibility": "Some",
    "profileUrl": "https://jakegloudemans.notion.site/Jake-Gloudemans-Dating-Doc-cedc3162e02a498384749c8fd699569a",
    "lastUpdated": "2023-09-05",
    "profileDetails": {
      "fullText": "Skip to content\nJake Gloudemans\nGet Notion free\nJake Gloudemans\nI'm looking for\nWomen / Monogamous Relationship / D.C. area (or close enough where we could see each other a lot)\nInterests & Hobbies\nTechnical/nerdy\nEngineering / making stuff - robotics, electronics, 3D printing, computer programming, etc. I do some of this kind of stuff for my job, but I also enjoy it as a hobby, for both practical and impractical purposes. I’m currently trying to figure out how to convert part of my apartment into a robotics lab!\nBlogging - I started this a few months ago. So far I’ve mostly been writing about forecasting / prediction markets, but there’s a bunch of other random stuff I’d eventually like to write about\nI’m interested in pretty much anything adjacent to science, technology, politics, economics, progress, “ideas”, philosophy, … I have more of a problem sticking to any particular project because I’m interested in too much stuff versus not having enough ideas for interesting things to do\nNon-technical/nerdy\nWatching sports, especially NFL, NBA, and Golf (but really anything). Go Packers!\nWatching TV shows and movies\nExercise - I lift weights and/or run most days\nPlaying sports - I enjoy pretty much anything, but especially basketball\nOutdoors stuff - camping, hiking, biking, etc. My family has done a bunch of road trips to different parts of the country, mostly visiting national parks / outdoors places and I definitely want to do more of that in the future. I’ve been to 46/50 states!\nExploring different cities\nCooking - I got really interested in cooking a few years ago and I really enjoy it (and I’m pretty good at it now!)\nPersonality\nRelaxed, low-stress person. Rarely get really high/low emotionally\nGoofy, although it takes a bit for me to get comfortable enough around people to let this side of my personality out\nFairly quiet / introverted,  especially around people I don’t know well. Once I’m with a group of people I know well I’m pretty lively though\nOkay being on my own much of the time, but also really value social time in low-to-moderate doses\nCompetitive - but only in a fun way, not in a “takes-it-too-far” way\nAnalytical - I mean I do programming and prediction markets for fun, lol\nValues\nI want to help as many people as possible be happier, healthier, and more fulfilled. This is a guiding principle when making big life decisions\nI agree with the basic ideas behind effective altruism, i.e. that we should try to be strategic about how we “do good” in order to maximize impact and that people far away matter as much as people close by\nI also want to be happy myself! Lately I’ve been trying to get better at building and maintaining relationships with friends and family. I’ve become increasingly convinced that strong social connections are the key to happiness\nReligion: Agnostic. I was raised Catholic, but stopped believing sometime during high school. I miss the community and ritual that went along with being religious though. (I would be okay dating someone religious if my agnosticism wouldn’t be a problem to them)\nPolitics: liberal - I agree with most of the ideas outlined here\nGoals/Ambitions\nI think I can accomplish a lot and feel compelled to try and have a big positive impact on the world. I’m not totally sure of what the best way is for me to do this, but it’s my main overarching life goal\nI really like to make things and think I’d be good at doing some kind of startup. I’m currently planning to try this in the next couple years\nI want to have a really great group of friends that’s mutually supportive and that I hang out with a lot. I neglected this for a few years after college, but it’s something I’m actively working on right now, as I think it’s pretty crucial to long term happiness.\nI really want to run a marathon! I was good at running in high school but then started having foot problems that have plagued me ever since. It would be very symbolically meaningful for me to complete a marathon, since that’s what I was training for when the foot problems started! I’ve made some good progress this year, but there’s still a long way to go…\nWhat I’m looking for in a partner:\nI don’t really know!  I can imagine things working out with a wide variety of different types of people\nProbably it would be good if your values align at least reasonably well with mine and we have at least some shared interests!\nSome other vague things that are important to me: you’re a kind person, you have things you care about / ambitions, and you are generally open-minded and tolerant of different people and ideas\nWhy dating me will be awesome:\nI’m a nice, thoughtful person and really want to build an awesome relationship with someone!\nI will cook delicious food for you!\nI will make cool / silly computer programs, contraptions, robots, etc. for you!\nI will travel and explore the world with you!\nI’m an optimistic & upbeat person and maybe that will transfer to you!\nMy family is awesome and if you like me, you’ll definitely get along with them!\nPictures:\nMore pictures in this Google photos album\nIf you’re interested, you can email me at jake.gloudemans@gmail.com!"
    },
    "scrapeTimestampDetail": "2025-11-27T17:38:47.840475+00:00",
    "id": "usr_91a4ee8192",
    "docAccessible": true
  },
  {
    "name": "Anastasia",
    "age": 50,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "Central Europe",
    "locationFlexibility": "Some",
    "profileUrl": "https://date-me-page.notion.site/Date-Anastasia-4e802a8f08b64cbf8606cae089554aab?pvs=4",
    "lastUpdated": "2023-08-21",
    "profileDetails": {
      "fullText": "Skip to content\n🌞\nDate Anastasia\nGet Notion free\n🌞\nDate Anastasia\nFind\nlove\nwhen\nyou’re\nhalfway\nthrough\nwith\nlive\nFind love when you’re halfway through with live﻿​\nFacts\nborn 1973\nfemale, interested in men\n170cm, blond, green eyes\nmonogamous\nLive in Switzerland\nBorn in Switzerland, had a Austrian passport and now a Swiss one, grew-up in Libya and have a Russian name.\nAnastasia isn’t my real name, it’s a precaution.\nStill own my first computer, an Apple IIe\nI speak 5 languages: Swiss-German, German, English, Spanish, French and a wee bit of Italian. I can conjure  decent accents with those.\nNo university degree, life is my school. Everything I know is self-taught and I love to learn (and won’t stop learning). Was called a poly-math and didn’t know that expression before.\nCan explain well (things I understand)\nI discovered personal development and spirituality with 16. I even did a 3 year training in Shamanism, thinking I’d become a Shaman with 60. But that changed :)\nI once had an artistic cake making business, that changed too :)\nOutlook on life\nDon’t want kids.\nDidn’t want any, bc I wanted to become a better human first and not pass on trauma.\nLove kids of other parents, especially my nieces and nephews.\nI love the role of being the crazy aunt that kids go to get honest and differentiated answers to life.\nI’d like to become 100 years old. Very likely, I won’t die then and I’m ok if earlier or later.\nOn relationships\nLife dreams\nBuilding a successful business that will live beyond retirement, allowing me to do slow travelling.\nRenovate, refurbish and fresco-paint and old agritourismo in Italy, France or Spain.\nHost lavish dinner parties - only for nice humans w/o status games.\nContinued learning, keeping curiosity alive.\nBeing married isn’t one ;)\nGo to perfume school\nMaybe create a product-line of sweets.\nWork\nConsultancy to build efficient operational systems\nHave my own LLC\nPersonality\nQuiet\nFriendly\nDeep thinker\nObservant\nEarly adopter mindset\nLover of irony and British dark humour.\nCompassionate (may not appear at first)\nGetting things done\nLoves “me” time\nLikes people and different cultures.\nI mostly keep a distance to others, letting you in on my inner thoughts takes time.\nOpen introvert.\nI choose solitude over superficial connections.\nI can read people very well.\nTruffle pig\nTalents\nVery handy and crafty. I can drill wholes with this and install lamps.\nI taste dishes by reading recipes and can make up new ones on the fly.\nI cook and bake really good. Love to host.\nLove tech, working on my computer is my hobby and my profession.\nInterests\nClick on triangle to open.\nElements in order of preference\nFood\nSports\nLeisure & Hobby\nTopics\nOutlook on partner\nI don’t mind if you have kids\nSeeking long-term monogamous relationship and you should too. Don’t contact me, if you don’t - I detest time wasters and seekers of ego boosters.\nYou shouldn’t be a velcro and have spaces for your own. Neither a bouncy ball.\nI like entrepreneurial humans.\nYoung spirits preferred.\nMix and match\nIf I would be a painter, I would be a cross-over of Tamara de Lempicka, Rothko, Frida Khalo and Josefa de Obidos.\nIf I would be a cook, I would be a cross-over of Julia Child and a Mexican street cook preparing mole negro.\nIf I would be a carpenter, I’d like to be Laura Kampf, Pablo Reinoso and a canoe builder.\nIf I’d be a sculptor I would be a cross-over of Karen Marie Portaleo and Rodin\nNot that I have the talent to live up to, this is more a description what styles I like.\nQuirks\nI hardly take photos of me. I rather take photos of things I see.\n﻿​\nGet in touch\nor open in browser"
    },
    "scrapeTimestampDetail": "2025-11-27T17:40:29.154798+00:00",
    "id": "usr_72ee7b01b7",
    "docAccessible": true
  },
  {
    "name": "Gustavo Cunha",
    "age": 36,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "Brazil",
    "locationFlexibility": "None",
    "profileUrl": "https://sordid-jellyfish-935.notion.site/Perfil-8fba6a75bd894a90959953dae89882d1?pvs=4",
    "lastUpdated": "2023-08-21",
    "profileDetails": {
      "fullText": "Skip to content\nPerfil\nGet Notion free\nPerfil\nEm breve…"
    },
    "scrapeTimestampDetail": "2025-11-27T17:42:10.440184+00:00",
    "id": "usr_0546b515e7",
    "docAccessible": true
  },
  {
    "name": "Svitlana",
    "age": 24,
    "gender": "F",
    "interestedIn": [
      "F",
      "M"
    ],
    "location": "San Francisco Bay Area",
    "locationFlexibility": "Some",
    "profileUrl": "https://www.notion.so/svitlanamm/Relationship-Builder-aae98e8e08e246768ba278406e03cc2a?pvs=4",
    "lastUpdated": "2023-08-21",
    "profileDetails": {
      "fullText": "Skip to content\n🧱\nRelationship Builder\nGet Notion free\n🧱\nRelationship Builder\n🤗\ndateme: on pause as i am peacefully in love. strongly endorse writing relationships docs.\ndoc is little outdated. will update soon! @August 5, 2024\n💡\nhot mess to be organized —— merged Premises of my life with ex-date me.\nin no specific order. last updated nov 2023.\nlife principles: #seekJoy #seekChallenge #radicalHonesty\ndeath is inevitable.\nlanguage is just a compressor of abstract reality and is not a reality itself.\nmy life is playing an infinite game of self-discovery and finite games are part of it\nmaya vs brahman world. the earth is a very small dot.\nself-love\nlife is full of contradictions and paradoxes\nspirituality.\nmy life mission is to seek and cultivate meaningful relationships\nradical honesty\n“you are me, i am you, and we are the world”\nwe must move towards each other, not away from each other\nthere is no “purpose” for my existence, or existence of the universe. I exist to exist. and i can choose to have a purpose.\nnot better or worse. just different. what is. (trying my best to not play status games)\nmy principle for action is to cultivate three-C spaces: spaces that are Curious, Collective, Consious.\n🤗\nplease challenge me.\nhere is my relationship building doc. thanks for inspiration, here:) this has been a fun experiment — plus writing things here helps me gain clarity in what i want and why. lmk if you are curious about this experiment and wanna hear more!\nmore meta\nVibes\nbased in SF, 25yo, bi, wants kids, open to poly while in search for a (maybe hopefully who knows) life partner:)\nInfinite playfulness & aliveness & being your fullest self\nI resonate with the Infinite Finite Games book (summary by Farnam Street). I love trying out different things and observing how I feel. I am very self-aware and think a lot. Trying to cultivate thinking for myself as my default state of being.\nCuriosity & intelligence\nI have a lot of energy and am deeply curious. You will likely sense it from our first IRL convo. For now, check out this link. (Btw I love curius). Also, wanna try lots of things in my life: https://www.svitlana.me/curiosities.\nSpirituality & interest in the eastern religions/philosophy\nI have been wondering about spiritual-like topics for 3 years now. Some questions are: what is reality? who am I and what is self?\nThe real hunger for spiritual understanding accelerated when russia invaded my home. Check then news on Ukraine. To help myself cope, I have been reading a lot. I think I found some sense equanimity and peace  now that is  becoming more and more present. I meditate, do yoga, breath work, cold plunges on a regular basis.\nMovement\nAt first a coping mechanism, movement now grew into me. I need it and do it often. Not necessarily restricting moving to gym, a square of grass or yoga mat is great too. My goals are handstands, crow pose, pull-ups and flexibility/mobility.\nSeems like I vibe with calisthenics but excited to also try dancing. I regret not doing sports in my adolescence as now there is so much work to be done to get to what I want (e.g. I want handstands and it is hard on both physical and inner-work levels). Persistence and consistency are my best friends here. On a weekly basis I do some movement 5-6x a week (this includes  yoga which many people consider an exercise).\nKindness and love\nKind by nature from my mom and appreciate kindness in others.\nLove — influenced by hippies in sf. But hey love is cool and the world would be a better place if we embraced it.\nSelf-awareness gamey game\nI got to have very random experiences during my life, e.g. living in a dozen of cities around the world and hitchhiking a bunch when I was a naive teenager. I switched “homes” many times and my 5 closest friends are from 5 different countries. As such, I had to learn how to think a lot and choose the best of two/x worlds.\nMy career game\ninvolves me now being a PM at Google’s Labs. thinking a lot and figuring.\ni love my friends so so much\nALT\nThings I like\nBooks: check out my 📚\nbooks and medias. db. recents favs: thich nhat han, creative way, metaphors we live by, consolations, little life, krishnamurti\nReads: check out my https://curius.app/svitlana-midianko2 .\nAlso: breath work, meditation, Sam Harris work, yoga, running, traveling, camping, Bali,  NATURE, cinnamon buns, conversations with strangers, sunsets/rises, mindmaps, books, climbing trees and reading, product management, big history, psychedelics, women’s history, evolution, dogs, temperature play (cold plunges!), dancing, Alan Watts, cross-generational friendships, ecstatic dance\nLife things and mind drills\nWork in progress\nI have soooooo many areas of improvement I am working on. Have tips on how to improve here?\nLetting go of high standards towards myself and other beings\nFiguring out what to do in life\nWhile humbly appreciating things I have been privileged to have.\nIndecisiveness\nIt’s hard to make decisions for me! Contributors: (a) do not know how to listen to my intuition; (b) WIP prioritization skills; (c) I overall just find good things in many things.\nThinking for myself as a muscle\nLetting go of external pressures\nAnd also, building comfort in asking for help\nInsecurities.\nA lot of more on  my substack!\nmy fav weekly routine: handstands class at circus → GGP bike ride + convo w strangers/dogs\nALT\nWhat my friends say: borshch\nIt is hard to have an objective evaluation of a human being, so I found borshch to be the closest proxy for estimating quality of me as future wife.\nBorshch is a Ukrainian soup that takes ~2-3 hours to make and is often cooked as a test for marriage readiness. A wife (yes wife, not a man bc men do not cook!!!) is only as good as her borshch (ah, what a great way to reduce human complexity:).\nMy friend said, “the caliber of a person is determined not by any single borscht they cooked, but that they keep cooking borscht. It is the borscht of the soul that makes the borscht of the stomach.”\nI fed my friends with borshch and asked some follow-up qs.\nbeware that my subjects are coming with personal bias. One friend even ate meat soup  as vegetarian??!?\nALT\nHow likely are you to recommend this borshch to your friend?\nUse three words to describe how this borshch made you feel\nHow often would you eat this borshch?\nThe caliber of a person is determined not by any single borscht they cooked, but that they keep cooking borscht. It is the borscht of the soul that makes the borscht of the stomach.\nThe soup indicates Svitlana is very ready for marriage!! 🤪\nSvitlana is a curious soul who will happily lay under the trees for hours. You will find her doing handstands at beaches (or any other flat surface you can think of), wearing flowers as a hat, or striking conversations with strangers. Ask her about psychedelics and she will give you many good resources.\nShe loves purple, blueberries, and building elaborate Notion pages. Overall, I would describe her as a kind, self-aware, curious, and emotionally mature human being. 20/10. Highly recommend!\nThe Borshch was kind, compassionate, and created a loving environment and home. 10/10, would eat again\nboo\nMisc & bullets\nPodcast in which I talk about my adolescence\nI started Substack!\nI hitchhiked over 10k km when I was 17. It taught me lots of kindness and active listening.\nI was lucky to have lived in seven countries (~12 cities) which helped me build empathy and appreciation for diverse viewpoints. Favorites: for living it is London and NYC; for spiritual growth, it is Bali and India.\nI am Ukrainian. Yes, the war is still happening (on an even larger scale than when the media had incentives to discuss it). Pls check the news and donate if you can.\nFAQ\nIf you have questions, comment here, ask me, or submit via this anonymous form.\n“But hey svitlana what are you looking for in a romantic partner?” - added in anon form in march\n“Hey svitlana, how about your preferences on poly vs mono and gender?” - added as per feedback of too many people\nThanks Alexander Scott for writing an article that explored this theme and sparked my curiosity enough to start this doc!\nLog\nSvitlana-ing\n12/25/2024\nor not\nSvitlana-ing\n02/26/2024\nkinda unsure if i still resonate as much..\nSvitlana-ing\n09/16/2024\nwith self = world, i think this still resonates.\nSvitlana-ing\n03/17/2024\ni sense my friends r tired of my external processing here tho"
    },
    "scrapeTimestampDetail": "2025-11-27T17:43:51.910136+00:00",
    "id": "usr_8e94444f6f",
    "docAccessible": true
  },
  {
    "name": "Xavier",
    "age": 33,
    "gender": "NBM",
    "interestedIn": [
      "F",
      "NB"
    ],
    "location": "NYC",
    "locationFlexibility": "Some",
    "profileUrl": "https://pancakemx.notion.site/Date-Doc-Xavier-Jackson-601b9b63c75747e8895b04ed1474dd8d?pvs=4",
    "lastUpdated": "2023-08-21",
    "profileDetails": {
      "fullText": "Skip to content\n🥞\nDate Doc: Xavier Jackson\nGet Notion free\n🥞\nDate Doc: Xavier Jackson\nWelcome to my Date Doc, maybe you ask me on a date!\nQuick Notes:\nBlack,  Non-binary (They/Them),  Queer,  35,  5'8\",\nLocation: Queens NYC\nMath Teacher, Board Gamer, Polyamorous\nI love games and puzzles and being part of a team. Maybe we can team up?\nI am looking for people to build a relationship with and eventually a nested partnership. I also want to raise children at some point (even if I don't get around to truly feeling ready to do so).\nIf you think you might want to go on a date fill out → this form ←\nArtechouse (2023)\nALT\nQueens Pride (2023)\nALT\nAbout you\nThese are not rigid requirements, but they are things I value.\nHaving any of these would be a strong plus for me.\nYou are either a person of color and/or are on a continuing journey of anti-racism.\nI'm Black and I can't be fully myself if I'm worried about racism (including unconscious biases) in my relationships.\nYou value communication in a relationship and are comfortable setting and respecting boundaries\nI appreciate knowing you will communicate your needs and wants (even if this might make either of us uncomfortable)\nYou consider yourself a lifelong learner.\nEager to learn and grow as a person.\nYou are probably AFAB, but that might not be reflected in your gender presentation.\nTransmasculine folks are more than welcome.\nYou are someone who likes to play games and solve puzzles.\nThis might be competitively or collaboratively\nBoardgames, video games, crossword puzzles\nAbout me\nI am a cuddly and creative person who strives to show off how clever I am. I mostly do this through gaming and the occasional witty remark.\nGen Con (2016)\nALT\nAfropunk (2018)\nALT\nMy nerdy pursuits, besides teaching math include Star Wars, Pokemon, Comics and experiencing fandom vicariously through other people. Seeing other people talk excitedly about things they are passionate about is something I enjoy.\nClass Project (2022)\nALT\nMy favorite jacket (2017)\nALT\nGaming has helped me build community and many of my closest friends I met through a common game. I like to host Boardcakes which is boardgames and pancakes. I also make great pancakes.\nMy current favorite hoodie (2022)\nALT\nPlaying in a card game tournament 2017\nALT\nI enjoy going out and doing things, and I try to make the most of new experiences. I, however, tend to do more staying home.\nOverwatch League Grand Finals at the Barclays Center (2018)\nALT\nWhat next?\nIf you think you might want to go on a date fill out → this form ←\nOr you can just ask me out.\nOr you can reach out to me via a mutual friend.\nIf you want to read the things I have tweeted about I am @PancakeArchduke on Twitter and @PancakeMx on Bluesky\nFeel free to share this doc with someone you think would like me.\nBit.ly/DateXavier\nThanks <3\nNew Earrings (2023)\nALT\nNew glasses? (2025)"
    },
    "scrapeTimestampDetail": "2025-11-27T17:45:33.233194+00:00",
    "id": "usr_bc41567741",
    "docAccessible": true
  },
  {
    "name": "Connie",
    "age": 33,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "San Francisco Bay Area",
    "locationFlexibility": "Some",
    "profileUrl": "https://lishiyo.notion.site/Date-Me-3-2f2c705daf264c6fbde42ee5149d9d6c",
    "lastUpdated": "2023-08-21",
    "profileDetails": {
      "fullText": "Skip to content\n🥰\nEDIT: As of Nov 2024 - this is now deprecated! 😍 I am now happily married 💍 (and yes, we did meet through our dateme docs 😜)\nGet Notion free\n🥰\nEDIT: As of Nov 2024 - this is now deprecated! 😍 I am now happily married 💍 (and yes, we did meet through our dateme docs 😜)\nDate Me! <3\n😍 Hi there! Welcome to my Date Me doc, which I must admit feels a bit charmingly low-tech in this Tinder age but hopefully in a cute we-bumped-each-into-each-other-at-the-online-coffeeshop kinda way. I'm Connie, a 33-year-old Chinese American techie person happily settled now in SF* after many years of wandering, Odysseus-style, through half the hokiest small towns in the US. I'm short, monogamous, and usually dressed in an alarmingly varied array of colors:\n(me, doing things)\n(me, still doing things)\n(me, doing something I will definitely never do again)\nI'd regale you with tales of my wanderings, but they're honestly quite boring and involve a lot of pet lab mice and early internet fanfic for some reason. The gist of it is that some combination of temperament, parental upbringing, and early Shounen Jump issues led to the dorky, egregiously friendly Huffleclaw you see before yourself today. In my bursts of social fancy I love flittering around novel/weird/interesting-sounding events, philosophy salons, and mysterious houseparties in the Bay, but I'm really an introvert at the core who likes to sun by big windows and nerd out on whatever topic has struck her this week (in my previous life I was definitely a cat, just one of those weirdo bodega ones that like people :P).\nI recharge my batteries on all the cozy things - longreads, podcasts, indie movies, coffeeshops and kava bars, bookshops with that old-book smell and perky plants, dinner parties, morning runs by the water and game nights with friends - but will absolutely get hype for the periodic rave, music festival, or good-lord-what-have-I-gotten-myself-into party. I'm high on the openness scale and enjoy poking at new things - even (especially) if they sound a bit out of my comfort zone - though my hope this year is to run around a little less, figure out the things I really care about, and go all in on the people and pursuits that matter to me. Who knows? That could be you 😉\nA few pluses about me:\nno kids, debt, or crazy exes\nlikes doing dishes and laundry because that's podcast time 👌\nprefers homey restaurants over fancy ones so cheap date\nspeaks Mandarin so kids will be set up for the future 💪\npretty good at charming old people so your parents will like me\nnot addicted to tiktok or insta 😃 (but addicted to reddit instead 😔)\ndecent meme game, if I do say so myself 😎\nMy current obsessions in this “just left the city I was in for a decade, hashtag yolo” phase of my life look something like training for a half-marathon, finally learning meditation (or similar in that vein), working on some AI side projects, researching for the book series I keep swearing I'll write, discovering more substacks to hoard in my email, spending a horrifying amount of time on soccer chats (long-suffering Spurs fan here… don't ask 🙈), and making my new home in SF. If I were to pick the one \"thing\" that really moves me, it'd be the idea of community and how we can better invigorate our society and the platforms we use to foster meaningful relationships, chances for connection, any form of antidote to loneliness that's a little less toxic than some of the tribes that have been forming online. I don't have good answers there but it's a subject I'm very interested in and would love to pick folks' brains on - so if you know anyone engaging in that sphere, I'd be all ears! 😊\nWhat I'm looking for\nA thoughtful, kind, kick-ass dude in either SF or NYC also looking for a life partner, a pet or two, and somewhere within one standard deviation of 2.5 kids (I was an only child and I think a sibling-less childhood just really sucks! I want to make a really fun household 😝).\nI'm super into a rigorous, analytical mind (though perhaps less in the sense of traditional booksmarts than street smarts, or a way of thinking outside the box) and curious, driven people who are always looking to learn and grow. I’ve matched well with honest, assertive, maybe even slightly disagreeable partners who aren't afraid to call me out on things and can balance me out as a teammate (I'll play good cop to your bad cop! The Agent J to your K. The Leslie to your Ron Swanson etc), but I also love goofballs who’ll text me a terrible meme at 4 in the morning. It’s stereotypical but oftentimes I think I’m just looking for someone who makes me laugh 😅 whose values also make me want to be a better person.\nI like sporty people. I like nerdy people. I like people who care; I think I'd take that over super “cool” people, as much as I am awed by their badassery sometimes. I love finding the life in people - passion is just delightful! (Even if it's mainly for fantasy football or large language models 😆). I can talk your ear off when I'm in the mood, but I LOVE people who can match my energy in conversation and even steer it or relieve my burden when I'm tired; and I think it's a great sign when we can do our own thing in companionable silence and enjoy that too.\nAbove all else though, I think personal integrity and, like, just giving a shit about people is sine qua non. How someone treats people, whether they keep their word, whether they can navigate the hard times with a steadiness of mind and character is so much more important imho than a few extra points on the IQ scale or zeros in the bank account. I feel the exact same way about close friends, which is why I call my dream life partner as \"basically a best friend I'm attracted to and want to raise a family with\" - some undefinable formula whose variables are a permutation of friendship, passion, and mutual respect.\nHonestly though, I could go on and on rambling here about a shared sense of humor, high bonding-ness, and a level of introversion that agrees to escape a party at the same time, but I do think most of this you're just never going to get off paper because it's really, like, all about the vibes, man. That's not to say dealbreakers don't exist or that compatibility is wholly unpredictable, but I really like waitbutwhy's take on it - a huge part of it is about who you really enjoy being around, and most of that time won't be romantic dates but grocery shopping and waiting for the bus and blobbing on the couch after work. You want someone you enjoy all the times in between the big vacations and dream travel destinations and Burning Mans with - someone you enjoy cooking dinner on the thousandth Wednesday with, or waiting for the Uber with, or rambling about your day to at the end of a long work week. Most of life is the mundane stuff in between the cool exciting stuff, so I'm looking for someone who I can have a mind-boggling amount of fun just Doordashing and watching Celebrity Family Feud with. That's rather difficult to figure out through a few paragraphs and a photo, so really, if this speaks out to you and we seem like a good match - hit me up and let's grab coffee?\nLifestyle compatibility\nIn a burst of abandon I once signed up for a matchmaking service (note: this did not land me on a Netflix reality show sadly, though it did get me a bunch of spam calls for a year after). The service did not work out as you can probably tell, but what I found interesting about it was that a solid 90% of the intake questions I had to answer was on my lifestyle. I'm not kidding - a quarter might have been about my sleeping habits alone (how late I slept, whether I was a light sleeper, if I needed space in the bed etc).\nThat has made me think a bit more about lifestyle fit. Having great dates with someone doesn't mean it's easy to live with them, and the latter gets much more important in a serious relationship. I'm sure plenty of folks might not put much stock in any of these, but just in case, I'll list some lifestyle traits of mine upfront:\nI'm more of a city gal than a super outdoorsy person, though I do run outdoors almost every day and enjoy a scenic hike or two (and I absolutely love parks!). My favored travel destinations lean towards cities and cultural/historical attractions more than extreme nature spots. Basically I'd pick reading in a cafe or visiting the Louvre over heavy-duty camping most of the time, though I’m absolutely down for festivals in the woods and cabin trips with  friends.\nLong-term I also want to stay around a major city, preferably SF or NYC since my social circles are here and my driving skills are uh, stereotypical at best 😅 Having said that, I definitely understand the space + cost trade-off of living in those cities.\nI'm not a huge gamer, though I've played a few RPGs and enjoy word-based boardgames and co-ops; and as you can tell from the Comic-Con pics, I’m a long-time anime/manga fan and geek out on a lot of things across the board (scifi, Doctor Who, Marvel etc).\nI drink socially, and it’d be nice if my partner could join me there though it’s not a big deal by any means. I'm not a huge foodie or picky but I do try to eat healthily (in moderation!) and am omnivorous with a plant-based lean. It doesn't matter to me if my partner's a serious foodie or vegan or has a lot of restrictions, though if their main hobby is food (e.g. eating out at fancy restaurants every other day) I wouldn’t be able to share in it.\nPolitically, I'm generally progressive, though eclectically so since I prefer to evaluate an issue in its own context instead of feeling boxed into one broad political platform. I'm open to partners on other parts of the spectrum, as long as there's still a values alignment.\nFinancially, I try to be pretty frugal on consumables (I don’t eat expensive meals or buy $400 purses) but will absolutely spend money on what I think of as investments: a high-end laptop, Lasik, a course I’m interested in, anything that makes me more productive at work. I care about experiences, especially the ones best done now (it’s hard to travel when old!) but I think tangible goods have their place in making your life better. Basically, my heuristic is to value the things that will buy me more time with friends. ❤️\nI’d like at least some time to myself most days; I think it's important for couples to have their own hobbies, though I do enjoy parallel play. I don't need my partner to go to everything with me - I can get into really social butterfly moods and if anything I'd much more appreciate having someone to come home to! Later on in a relationship, I'd love a little check-in text/call on days we're apart.\nSpeaking of - I do love texting 🙈 Not a huge deal to me if you don't, but some form of communication most days is pretty important to me. I'd be amped to have someone I can send both serious longreads and dumb twitter memes to, though I don't think there's a need to have a bunch of the same interests - it's more about a similar sense of humor and an interest in the other's life.\nMy love language is literally conversation, though I might file that more under quality time and companionship than words of affirmation. I love fussing over people and end up doing a lot of acts of service, and the Chinese heritage in me likes to say words are cheap, but my last relationship made me realize how much I value open affection. That's both physical and verbal - I can barely remember what I ate yesterday but almost never forget what someone says to me, for both good and bad (this is NOT to say I demand sappy love letters, just that a sincere word spoken in kindness goes a long way with me 😊).\nHit me up?\nFirst of all, you're the bomb if you actually read this far. And if this clicks with you and you think we might be a good match, hit me up via email, Facebook, or Twitter! If you have a similar kind of profile up somewhere that would be great, otherwise I'd appreciate an intro about yourself and what you're into, what you're looking for, pics or socials etc. Peace! 🖖\nConnie Li\n06/28/2023 (edited)\nAsterisk here is that I just moved here from NYC and still hope to visit NYC regularly! Essentially I’d like to go bicoastal, with SF as my homebase. I’m open to dating in either SF or NYC, with a leaning towards SF.\nConnie Li\n05/09/2023 (edited)\nI have learned from being around Bay Area circles I need to specify this 😆\nConnie Li\n08/08/2023\n5’1” checking in here 😛"
    },
    "scrapeTimestampDetail": "2025-11-27T17:47:14.544568+00:00",
    "id": "usr_ad60c5f6a0",
    "docAccessible": true
  },
  {
    "name": "Mahir Jayswal",
    "age": 24,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "NYC",
    "locationFlexibility": "Flexible",
    "profileUrl": "https://blue-equipment-c45.notion.site/Mahir-ec780fc3880e4a149a4969ad9137705c",
    "lastUpdated": "2023-08-07",
    "profileDetails": {
      "fullText": "Skip to content\nMahir\nGet Notion free\nMahir\nEmbracing the Journey of Technology, Travel, and Taste 🚀🌍🍽️\nGreetings, fellow explorer of the digital cosmos! I am Mahir Jayswal a dedicated Software Engineer at the esteemed Capgemini IT Company. 🖥️ Hailing from the vibrant state of Gujarat, India, I currently find myself immersed in the dynamic tech landscape of Bangalore.\nA Tech Explorer with a Taste for Adventure:\nBeyond the lines of code and the realm of debugging, I find solace and inspiration in the world of literature. 📚 A bona fide bibliophile at heart, my free moments are often consumed by the written word. From captivating novels to insightful tech manuals, each page turned is a step closer to expanding my horizons.\nTraversing the Uncharted Territories:\nVenturing far beyond the confines of my workspace, I've embarked on numerous journeys that have taken me through the mesmerizing landscapes of South India. 🌄 From Kolkata to the historic ruins of Mysore, every destination is a canvas upon which I paint memories. My YouTube channel serves as a testament to these exploits, offering a glimpse into the harmonious marriage of technology and travel. Through my videos, I strive not only to capture the essence of the places I visit but also to shed light on the technical facets that make these explorations possible.\nA Symphony of Knowledge:\nFueling my quest for learning, I've carved out a niche in the digital domain with a blog channel that delves into the depths of technology, programming, and beyond. 💡 My writing is a manifestation of my unquenchable thirst for knowledge, delivering valuable insights to those who seek them.\nA Culinary Odyssey and the Call of the Wild:\nWhile my fingers dance across the keyboard to craft code and captivating content, they are equally at home in the realm of cooking. The culinary arts have captured my fascination, leading me to experiment with a myriad of flavors and cuisines. 🍳 This mirrors my approach to life itself – a constant experimentation and blending of diverse elements.\nTrekking through nature's wonders and hitchhiking along the road less traveled are pursuits that invigorate my spirit. The thrill of the unknown and the allure of discovery guide my steps, both in the wilderness and in the world of tech. 🏞️🚗\nSeeking a Like-Minded  Adventurer:\nAs I continue to traverse the intersections of technology, travel, and taste, I am on the lookout for a kindred spirit. An individual who, like me, revels in the sensory pleasures of gourmet delights, craves the thrill of uncharted destinations, and finds solace in the pages of a well-worn book.\nSo, if your heart beats to the rhythm of exploration, if your taste buds tingle at the mere mention of exotic flavors, and if your mind eagerly absorbs knowledge like a sponge, then perhaps we are destined to embark on a shared journey through the digital and physical landscapes that lie before us.\nMy love languages are quality time and personal touch! I’m pretty independent and self-sufficient, but I love hanging out and spending downtime with my loved ones. I also would love for someone to encourage my more spontaneous side!\nLet's connect and embrace the adventure together! 🤝\n‼️ More about me!\nThe things I do in my free time…\nThe things I can’t get over…\nDon't see this is secret 🙈\n2024 RECAP  : Click here\nContact Information:\nYouTube Channel :  click here\nBlog Channel: click here\nInstagram : click here\nLocation: Bangalore, India\nThings I like\nthese all are 0.001%  of my collection\nBooks 📖\nThe Almanack Of Naval Ravikant\nWise and Otherwise by Sudha Murthy\nTuesday with Morrie\nAtomic Habits\nAnimal Farm by Gorge Orwell\nstay hungry stay foolish\nMovies 🎬\nThe Shawshank Redemption\nthe founder\nwhiplash\nking Richard\ndead poet society\ngood will hunting\nEnola Holmes\nSound of Metal\nInto the wild\nSchindler’s List\ncast away\nMitty\nDocumentaries 📽️\nChernobyl\nThe Last Dance\nThe Social Dilemma\nPodcast 🎧\njoe rogan\nhuberman labs\nHabit coach\nMusafir stories\npaisa paisa\nankur warikoo\npostcards from nowhere\nTake a pause with Varun Duggirala\nTed Talks\nMahabharat by Dhruv Rathi\n💬 Subscriber Reviews\n(AKA: What my friends think about me!)\n“ He’s charming, intelligent , and super ambitious.”\n“ Any time up for travelling or any trip!”\n“ Give lot of good reccos… about anything in world & encourage you to do things which makes u happy ”\nPhoto Gallery\nMarine beach, Chennai\nALT\nHyderabad\nALT\nPondicherry\nALT\nMehrangarh, Jodhpur\nALT\nMadikeri,Coorg\nALT\nTriveni Sangam, Kanyakumari\nALT\nRameshwaram The End of India\nALT\nKollam, Kerala\nALT\nVarkala\nALT\nAlleppey\nALT\nKochi\nALT\nHampi\nALT\nDussehra in Mysore\nALT\nCoffee woods Chikkmanglur\nALT\nIIM BENGALURU\nALT\nAdiyogi, Coimbatore\nALT\n2024 RECAP :\nM\nMahir Jayswal\n12/28/2023\nTriveni Sangam, Kanyakumari\nM\nMahir Jayswal\n03/16/2024\nIIM BENGALURU"
    },
    "scrapeTimestampDetail": "2025-11-27T17:48:55.908777+00:00",
    "id": "usr_80304fd0b5",
    "docAccessible": true
  },
  {
    "name": "Shanni",
    "age": 30,
    "gender": "F",
    "interestedIn": [
      "M"
    ],
    "location": "Vancouver",
    "locationFlexibility": "Some",
    "profileUrl": "https://shanni-read.notion.site/shanni-read/Shanni-Dating-Profile-3129a32563484843a9711169fb5331cc",
    "lastUpdated": "2023-08-03",
    "profileDetails": {
      "fullText": "Skip to content\nShanni Dating Profile\nGet Notion free\nShanni Dating Profile\nInstagram (@shanni_daily_drawing)\nInstagram photos and videos\nhttps://www.instagram.com/shanni_daily_drawing/"
    },
    "scrapeTimestampDetail": "2025-11-27T17:50:37.434001+00:00",
    "id": "usr_7400c5048a",
    "docAccessible": true
  },
  {
    "name": "Ansh Radhakrishnan",
    "age": 23,
    "gender": "M",
    "interestedIn": [
      "F"
    ],
    "location": "San Francisco Bay Area",
    "locationFlexibility": "Some",
    "profileUrl": "https://www.notion.so/Ansh-s-Dating-Doc-a74d6d12f68646b29a6444bc6496ebbf?pvs=4",
    "lastUpdated": "2023-08-03",
    "profileDetails": {
      "fullText": "Skip to content\nAnsh’s Dating Doc!\nGet Notion free\nAnsh’s Dating Doc!\nHey! I’m Ansh. I’m always excited about meeting new people in NYC, but especially excited about meeting someone to date seriously. Consider this doc as my best current attempt at self-advertisement and feel free to click on any sections you’re interested in!\nContact Me!\nAbout Me\nBasics\nVerbose\nPhotos (of me and Autumn 🐶)!\nWhat I’m Looking For\nBasics\nVerbose"
    },
    "scrapeTimestampDetail": "2025-11-27T17:52:18.911683+00:00",
    "id": "usr_e540f7a375",
    "docAccessible": true
  }
]